{
  "id": 1234406,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8xMjM0NDA2",
  "url": "https://hackerone.com/reports/1234406",
  "title": "Exfiltrating a victim's exact location (to within 5m)",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "high",
  "readable_substate": "Resolved",
  "created_at": "2021-06-15T08:44:18.021Z",
  "submitted_at": "2021-06-15T08:44:18.137Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "robertheaton",
    "url": "/robertheaton",
    "profile_picture_urls": {
      "small": "/assets/avatars/default-25f7248a18bdf9e2dc8310319b148d66cff430fa0fade6c5f25fee1b8d7f27ed.png"
    },
    "is_me?": false,
    "cleared": false,
    "verified": false,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 21554,
    "url": "https://hackerone.com/bumble",
    "handle": "bumble",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/021/554/13fb93fae5496e8e259a0f2a2fba3a72ca10550b_original./d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/021/554/13fb93fae5496e8e259a0f2a2fba3a72ca10550b_original./5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "Bumble",
      "twitter_handle": "bumble",
      "website": "https://bumble.com/",
      "about": "Bumble - Date, Meet, Network Better"
    }
  },
  "has_bounty?": true,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2021-07-21T18:41:34.974Z",
  "bug_reporter_agreed_on_going_public_at": "2021-06-21T18:41:28.815Z",
  "team_member_agreed_on_going_public_at": null,
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "I used Bumble's distance feature to exfiltrate the exact location (to within approx 5m) of a victim. I did this by using the Bumble API to move my attacker account's location around the approximate area of the victim. I was able to obtain the exact distance between attacker and victim at 3 separate locations, and I then used trilateration (https://gis.stackexchange.com/questions/17344/differences-between-triangulation-and-trilateration) to combine these 3 distances into a single, precise location.\n\nThis is not a new vulnerability; Tinder was found to be vulnerable to a version of it in 2014 (https://blog.includesecurity.com/2014/02/how-i-was-able-to-track-the-location-of-any-tinder-user/). What is new is the circumvention of Bumble's attempted mitigations for the Tinder attack. Tinder was trivially vulnerable to trilateration because their API returned the exact distance between attacker and victim, to 15 decimal places, and the client was responsible for rounding it. Bumble attempts to mitigate this by rounding the distance on the server, and returning only this rounded distance to the client. Simple trilateration is still possible using these rounded values, but this only gives us an accuracy of the nearest square mile or so.\n\nHowever, we can massively increase the precision to the nearest few metres by hypothesising that Bumble performs server-side rounding using code like the following:\n\n```\ndef calculate_rounded_distance():\n  exact_distance = calculate_exact_distance()\n  rounded_distance = math.floor(exact_distance)\n  return rounded_distance\n```\n\nThis means that we can have our attacker slowly \"shuffle\" around the vicinity of the victim, looking for the precise location where a victim's distance from us flips from (say) 1.0 miles to 2.0 miles. We can infer that this is the point at which the victim is exactly 1.0 miles from the attacker. We can find 3 such \"flipping points\" (to within arbitrary precision, say 0.001 miles), and use them to perform trilateration as before.\n\nTo reproduce:\n\n1. Create 2 accounts - a victim and an attacker. I don't believe that they need to be made to match with each other in order to exploit this vulnerability.\n2. Use Burp Suite or similar to grab the victim and attacker session IDs so that we can control them programatically via the Bumble API\n3. Use the Bumble API to put the victim in a fixed, target location\n4. Put the attacker in a random location in the vicinity of the victim. The attack does not require any special knowledge of the victim's location beyond the summary shown in the UI (eg. \"Lambeth\")\n5. Step the attacker in a random direction in small increments (smaller increments take longer but give more precise locations). After each step, check the distance between attacker and victim. If it has changed, record the average of the current and previous location as being exactly the smaller of the 2 distances away from the victim.\n6. If desired, repeat step 5 with a smaller step size in the vicinity of the known distance flip in order to increase precision\n7. Repeat steps 4-6 3 times starting in different positions\n8. Draw 3 circles, 1 for each distance found. The radius should be the distance between victim and attacker, the centre should be the point at which the distance flipped. (KML viewed in Google Earth is convenient for this step)\n9. Confirm that all 3 circles cross at the same point - you should have been able to identify the victim's location to within approx 5m\n\nI've included a Python POC with this report, and a screenshot of trilateration results produced using this script where the victim is placed at 10 Downing Street, UK. Depending on precision desired it takes approximately 10 seconds to find a victim's location.\n\n## Impact\n\nThe Bumble API does not appear to restrict the users about whom an attacker can pull information. This means that an attacker could use this vulnerability to find the exact location of any user whose user ID they know. This includes:\n\n* Current matches\n* Past matches who have since broken up with them\n* Any user whose profile the attacker has been shown in an encounter\n\nThe only restriction I've found is that sometimes the API does not return the numerical distance between the attacker and victim. I speculate that this occurs when the victim hasn't checked in for a period of time.\n\nTo mass exfiltrate the locations of a large swathe of Bumble users, an attacker could use multiple accounts with wide filters to cycle through large numbers of encounters, collecting large numbers of user IDs and then using trilateration to find all of their locations.\n\nRevealing the exact location of Bumble users presents a grave danger to their safety, so I have filed this report with a severity of \"High\".",
  "weakness": {
    "id": 18,
    "name": "Information Disclosure"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": "2021-07-21T18:41:28.898Z",
  "allow_singular_disclosure_after": -80940710.8089074,
  "singular_disclosure_allowed": true,
  "vote_count": 263,
  "voters": [
    "taha",
    "bncrypted",
    "arw9234",
    "moloshy",
    "osman1337",
    "illex",
    "p1t",
    "th3hidd3nmist",
    "lacegrilled",
    "kaif0x01",
    "and 253 more..."
  ],
  "severity": {
    "rating": "high",
    "author_type": "User"
  },
  "structured_scope": {
    "databaseId": 61765,
    "asset_type": "URL",
    "asset_identifier": "eu1.badoo.com",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
