{
  "id": 1542881,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8xNTQyODgx",
  "url": "https://hackerone.com/reports/1542881",
  "title": "curl proceeds with unsafe connections when -K file can't be read",
  "state": "Closed",
  "substate": "informative",
  "severity_rating": "high",
  "readable_substate": "Informative",
  "created_at": "2022-04-17T03:11:27.249Z",
  "submitted_at": "2022-04-17T03:11:27.320Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "medianmedianstride",
    "url": "/medianmedianstride",
    "profile_picture_urls": {
      "small": "/assets/avatars/default-25f7248a18bdf9e2dc8310319b148d66cff430fa0fade6c5f25fee1b8d7f27ed.png"
    },
    "is_me?": false,
    "cleared": false,
    "verified": false,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 35663,
    "url": "https://hackerone.com/curl",
    "handle": "curl",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/035/663/2faf4c279d437d64bfda6d23d62ce1833813a4d9_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/035/663/2faf4c279d437d64bfda6d23d62ce1833813a4d9_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "curl",
      "twitter_handle": "",
      "website": "https://curl.se",
      "about": "cURL is an Open Source project providing a library and command-line tool for doing internet transfers"
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2022-04-21T15:38:25.221Z",
  "bug_reporter_agreed_on_going_public_at": "2022-04-21T15:38:25.157Z",
  "team_member_agreed_on_going_public_at": "2022-04-21T11:28:02.068Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "## Summary:\nI'm using curl 7.82.0 on Linux. When the file specified by the -K option can't be read, curl sends network traffic as specified by the other options that are explicitly included on the command line (in other words, there's only a warning and I'd like it to be a fatal error). This behavior occurs even if those other options result in an action that's often considered unsafe, such as use of cleartext passwords. It's fine for curl to be capable of sending cleartext passwords, but this shouldn't happen unintentionally.\n\nI feel that this is a vulnerability in curl because curl is able to recognize that the user's intended set of options was not specified correctly, but curl still decides to send network traffic corresponding to the known subset of those options. One might argue that, philosophically, curl prefers to send network traffic even if the user's input is underspecified; however, this isn't true elsewhere in curl. For example, if the user misspells one of the options on the command line, curl doesn't simply ignore that one, and do whatever is specified by the remaining, correctly spelled options. Instead, any misspelled option is a fatal error, and curl sends no network traffic at all. My suggestion is to make this -K situation consistent with that, i.e., if the file specified by -K can't be read, then that is a fatal error and no network traffic is sent.\n\n## Steps To Reproduce:\n  1. Begin typing a curl command line that uses the -K option followed by a filename.\n  2. Create the file with that filename.\n  3. Within the file, include a curl option that is typically regarded as making network traffic more safe, e.g., the --ssl-reqd option.\n  4. Ensure that the curl process cannot read this file.\n  5. Enter the curl command.\n  6. Observe that curl does **not** exit with an error message stating that the file can't be read.\n  7. Observe that curl makes the network connection without the safety measure chosen in step 3.\n\n## Supporting Material/References:\nA fatal error is the approach taken by many other programs in analogous cases, i.e., the program allows a security-relevant user-specified configuration file on the command line, and that file can't be read, e.g.,\n```\n  % ssh -F /home/user/my-safe-ssh-options/not-exist.config example.com\n  Can't open user config file /home/user/my-safe-ssh-options/not-exist.config: No such file or directory\n\n  % tar -X /home/user/list-of-my-private-key-files/not-exist.config -c -f public.tar .\n  tar: /home/user/list-of-my-private-key-files/not-exist.config: No such file or directory\n  tar: Error is not recoverable: exiting now\n```\nIn other words, ssh realizes it would be wrong to simply use the system-wide SSH client configuration when the user is clearly trying to use a different configuration. The tar program realizes it would be wrong to simply place every file into a public archive, when the user is clearly trying to use -X to exclude specific files. With curl, the user is clearly trying to add some options, which may perhaps be critical for security in that user's use case.\n\nHere's an example in which a curl user wishes to send secret credentials to an FTP server only if the FTP server supports SSL, analogous to the ==curl --ssl-reqd ftp://example.com== example on the https://curl.se/docs/manpage.html page. The user chooses to use only a filename (named my-curl-ftp-options.config below), not a full pathname, with the -K option, just as in the ==curl --config file.txt https://example.com== example on that page.\n\nThis example includes a user mistake, but the vulnerability is also relevant without any user mistake.\n\nSSL detection works fine if the user's current working directory contains the my-curl-ftp-options.config file. However, the user then makes the realistic mistake of changing to a different working directory without changing the -K value. (Here, the user goes to the /mnt/LargeVolume/user directory because it has much more disk space for storing the large FTP downloads.) Indeed, curl warns the user, but then immediately sends the unsafe network traffic.\n\nFor purposes of the example, ftp.dlink.de is used (it always demands a password, but all combinations of usernames and passwords succeed). \n\n### Part 1\n```\n% /usr/bin/curl -L -s -S -o /home/user/curl https://github.com/moparisthebest/static-curl/releases/download/v7.82.0/curl-i386\n% chmod +x /home/user/curl\n% /home/user/curl --version\ncurl 7.82.0 (x86_64-pc-linux-muslx32) libcurl/7.82.0 OpenSSL/1.1.1l zlib/1.2.11 libssh2/1.9.0 nghttp2/1.43.0\nRelease-Date: 2022-03-05\nProtocols: dict file ftp ftps gopher gophers http https imap imaps mqtt pop3 pop3s rtsp scp sftp smb smbs smtp smtps telnet tftp \nFeatures: alt-svc AsynchDNS HSTS HTTP2 HTTPS-proxy IPv6 Largefile libz NTLM NTLM_WB SSL TLS-SRP UnixSockets\n% pwd\n/home/user/ftp\n% cat my-curl-ftp-options.config\n--ssl-reqd\n% /home/user/curl -K my-curl-ftp-options.config -u secretu:secretp --no-progress-meter ftp://ftp.dlink.de 2>&1 | head -6\ncurl: (64) Requested SSL level failed\n```\n### Part 2\n```\n% cd /mnt/LargeVolume/user\n% ls -1\n001-huge-file-from-ftp-server.dat\n002-huge-file-from-ftp-server.dat\n% /home/user/curl -K my-curl-ftp-options.config -u secretu:secretp --no-progress-meter ftp://ftp.dlink.de 2>&1 | head -6\nWarning: error trying read config from the 'my-curl-ftp-options.config' file\ndrwxrwxrwx   1 user     group           0 Mar 16  2016 @archive\ndrwxrwxrwx   1 user     group           0 Jul 03  2020 anleitungen\ndrwxrwxrwx   1 user     group           0 Mar 16  2016 ant24\ndrwxrwxrwx   1 user     group           0 Mar 16  2016 ant70\ndrwxrwxrwx   1 user     group           0 Nov 20 14:40 aspnet_client\n```\nIn Part 2, the cleartext network traffic exchanged begins with:\n```\n220 D-Link FTP Server.ready ...\nUSER secretu\n331 Password required for secretu.\nPASS secretp\n230-Willkommen auf dem D-Link FTP-Server\n```\nIn Part 1, the network traffic exchanged is the following. The cleartext password is never sent:\n```\n220 D-Link FTP Server.ready ...\nAUTH SSL\n534 AUTH command is disabled.\n```\nAs mentioned above, if the user had underspecified the desired network traffic by misspelling an option (e.g., the wrong spelling --ssl-required instead of the correct spelling -ssl-reqd), then there would be a fatal error, and no network traffic (such as a cleartext password) would be sent:\n```\n% /home/user/curl --ssl-required -u secretu:secretp --no-progress-meter ftp://ftp.dlink.de 2>&1 | head -6\ncurl: option --ssl-required: is unknown\ncurl: try 'curl --help' for more information\n```\nIn a more realistic case, the user would not use ftp.dlink.de, but would instead use a series of FTP servers that are normally intended to support SSL. The user would want to place --ssl-reqd in a configuration file because it applies to every server. However, the user would want to place the username and password on the command line because they are different for every server.\n\nAn exploitation scenario (protocol downgrade attack) without a user mistake is:\n1. The victim user has a midnight cron job that is supposed to use curl for FTP with SSL. It has \"-K /home/user/ftp/my-curl-ftp-options.config\" on the command line; that file exists and contains a --ssl-reqd line.\n2. The curl binary is on local disk, but the user's home directory (including the /home/user/ftp/my-curl-ftp-options.config file) is on an NFS file server.\n3. The attacker is already able to disrupt availability (e.g., flood the NFS server for a few minutes at midnight to make it unresponsive) but has no way to disrupt the confidentiality or integrity of curl's use of SSL.\n4. Because /home/user/ftp/my-curl-ftp-options.config can't be read, curl doesn't know that SSL was desired, and thus sends the password in cleartext.\n5. The attacker can read the password off of the wire.\n\nThis vulnerability report is not specific to FTP or SSL. There are many other scenarios in which a missing option makes the network traffic less safe, and they add motivation for introducing a fatal error when the -K file can't be read. Some of the other scenarios are:\n\n* the user intended to have --digest in that file, and curl instead makes an HTTP request with a cleartext password\n* the user intended to have --append in that file, and curl instead overwrites the target file\n* the user intended to have --proxy (followed by the name of an anonymizing proxy server) in that file, and curl instead reveals the user's endpoint IP address to the server operator\n\n## Impact\n\nIn the main example above, the attacker can discover a cleartext password. More generally, the attacker can achieve any security impact that **any** curl option was trying to prevent. For example, the victim's source IP address may be leaked if the curl option was to use a proxy server. The connection may honor a revoked certificate if the curl option was to specify a local file with a Certificate Revocation List. Several others may also be relevant depending on the protocols and threat model.",
  "weakness": {
    "id": 115,
    "name": "Improper Check or Handling of Exceptional Conditions"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": null,
  "vote_count": 1,
  "voters": [
    "shivammusic"
  ],
  "severity": {
    "rating": "high",
    "score": 8.0,
    "author_type": "User",
    "metrics": {
      "attack_vector": "adjacent",
      "attack_complexity": "high",
      "privileges_required": "none",
      "user_interaction": "none",
      "scope": "changed",
      "confidentiality": "high",
      "integrity": "high",
      "availability": "none"
    }
  },
  "structured_scope": {
    "databaseId": 18844,
    "asset_type": "SOURCE_CODE",
    "asset_identifier": "https://github.com/curl/curl",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
