{
  "id": 1622449,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8xNjIyNDQ5",
  "url": "https://hackerone.com/reports/1622449",
  "title": "June 2022 Incident Report",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "critical",
  "readable_substate": "Resolved",
  "created_at": "2022-07-01T17:00:27.763Z",
  "submitted_at": "2022-06-22T17:30:00.000Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "jobert",
    "url": "/jobert",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/ht4b9SmcYNqmpbyCFXd7cxHB/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98"
    },
    "is_me?": false,
    "cleared": true,
    "verified": true,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 13,
    "url": "https://hackerone.com/security",
    "handle": "security",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "HackerOne",
      "twitter_handle": "Hacker0x01",
      "website": "https://hackerone.com",
      "about": "Vulnerability disclosure should be safe, transparent, and rewarding."
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": true,
  "stage": 4,
  "public": true,
  "visibility": "no-content",
  "cve_ids": [],
  "singular_disclosure_disabled": false,
  "disclosed_at": "2022-07-01T19:13:43.112Z",
  "bug_reporter_agreed_on_going_public_at": "2022-07-01T19:11:22.698Z",
  "team_member_agreed_on_going_public_at": "2022-07-01T19:13:42.894Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "",
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": "2022-07-31T19:11:22.912Z",
  "allow_singular_disclosure_after": -48539777.34031391,
  "singular_disclosure_allowed": true,
  "vote_count": 409,
  "voters": [
    "yakunachisli",
    "lowtoe",
    "tikidude",
    "rmmal",
    "sumzer0",
    "jumpydata",
    "hltakydn",
    "math-lover",
    "shreyaschavhan",
    "jerry_jakcson",
    "and 399 more..."
  ],
  "severity": {
    "rating": "critical",
    "author_type": "User"
  },
  "structured_scope": null,
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "id": 169831,
      "category": "team",
      "content": "# Intro\nSince the founding of HackerOne, we have kept a steadfast commitment to disclosing security incidents because we believe that sharing security information far and wide is essential to building a safer internet. HackerOne's culture is to disclose more often, and in more detail than the rest of the industry. This document represents our 431st disclosure to date and we hope it will prove useful to defenders everywhere.\n\nIf you were one of the customers directly impacted by this incident, you will have already received direct communication from us providing actionable details.\n\n# Incident Summary\nOn June 22nd, 2022, a customer asked us to investigate a suspicious vulnerability disclosure made outside of the HackerOne platform. The submitter of this off-platform disclosure reportedly used intimidating language in communication with our customer. Additionally, the submitter’s disclosure was similar to an existing disclosure previously submitted through HackerOne. Bug collisions and duplicates, where multiple security researchers independently discover a single vulnerability, commonly occur in bug bounty platforms. However, this customer expressed skepticism that this was a genuine collision and provided detailed reasoning. The HackerOne security team took these claims seriously and immediately began an investigation.\n\nUpon investigation by the HackerOne Security team, we discovered a then-employee had improperly accessed security reports for personal gain. The person anonymously disclosed this vulnerability information outside the HackerOne platform with the goal of claiming additional bounties. This is a clear violation of our values, our culture, our policies, and our employment contracts. In under 24 hours, we worked quickly to contain the incident by identifying the then-employee and cutting off access to data. We have since terminated the employee, and further bolstered our defenses to avoid similar situations in the future. Subject to our review with counsel, we will also decide whether criminal referral of this matter is appropriate. Our full discussion of the incident is below.\n\n# Investigation Timeline\n\n| Date | Event |\n| --- | --- |\n| 2022-06-22 10:30 PDT | Call with a customer requesting an investigation into reports of an intimidating and suspicious off-platform communication from an actor with the handle \"rzlr\" |\n| 2022-06-22 11:30 PDT | Launched incident investigation into suspected threat actor |\n| 2022-06-22 12:02 PDT | Escalated incident priority, Expanded scope of investigation to include additional off-platform interactions threat actor had with HackerOne customers |\n| 2022-06-22 21:15 PDT | HackerOne Security team directs investigation toward a HackerOne employee account as possible source of access |\n| 2022-06-22 23:29 PDT | Incident update and proposed plan of action shared with HackerOne executive team |\n| 2022-06-23 09:03 PDT | Terminated system access and remotely locked laptop of suspected threat actor pending investigation |\n| 2022-06-23 10:13 PDT | Immediately informed payment partner of investigative activity |\n| 2022-06-23 12:01 PDT | Payment partner corroborated our suspected threat actor attribution with confidence |\n| 2022-06-24 07:00 PDT | Interview conducted with suspended threat actor |\n| 2022-06-27 13:30 PDT | Took possession of laptop of suspended threat actor and conducted remote forensics imaging and analysis |\n| 2022-06-28 Late Evening PDT | Completed thorough log review of data access by threat actor during the entirety of their two and a half months of employment |\n| 2022-06-29 10:00 PDT | Notifications to seven (7) customers known or suspected to be in contact with threat actor |\n| 2022-06-30 13:27 PDT | Completed conversations with all customers known or suspected to be in contact with the threat actor, Additional evidence collated from multiple customer investigations of threat actor reinforces assessment that the threat actor and our suspended employee are the same individual.\n| 2022-06-30 21:20 PDT | Officially terminated employment of the previously suspended threat actor |\n| 2022-07-01 Late Morning PDT | Notifications to *all* customers whose programs had any interaction with this threat actor, including programs that may have only been accessed for legitimate job-related purposes |\n| 2022-07-01 Evening PDT | HackerOne shares threat actor details with organizations in the vulnerability disclosure sector |\n\n# Investigation\nOur investigation has concluded that a (now former) HackerOne employee improperly accessed vulnerability data of customers to re-submit duplicate vulnerabilities to those same customers for personal gain.\n\nThe investigation began after a customer notified us of reportedly receiving a threatening communication, outside the HackerOne platform, about a vulnerability disclosure. We immediately launched an investigation. Within 30 minutes of the investigation, additional evidence surfaced that caused us to escalate the priority of the incident. We began to run down every scenario of a possible exposure to disclosure data, including potential exploitation of our application, a remote compromise of the hacker, customer, or analyst, a leak by misconfiguration, and others. There was information to support only one of our hypotheses, an internal threat actor.\n\nUpon this discovery, we began a separate investigation into the insider threat with a contained group. These steps were necessary as we worked to investigate and eliminate the prospect of multiple insiders. We are now confident that this incident was limited to a single employee who improperly accessed information in clear violation of our values, our culture, our policies, and our employment contracts.\n\nWithin 24 hours of the tip from our customer, we took steps to terminate that employee's system access and remotely locked their laptop pending further investigation.\n\nWe were able to reach our conclusion quickly using the following methods. Our internal logging monitors employee access to customer disclosures for regular business operations, namely vulnerability intake and triage. Analysis of this log data suggested a likely actor soon after our internal investigation kicked off. Only a single employee had accessed each disclosure that our customers suspected of being re-disclosed by the threat actor.\n\nThe threat actor created a HackerOne sockpuppet account and had received bounties in a handful of disclosures. After identifying these bounties as likely improper, HackerOne reached out to the relevant payment providers, who worked cooperatively with us to provide additional information. Following the money trail, we received confirmation that the threat actor's bounty was linked to an account that financially benefited a then-HackerOne employee. Analysis of the threat actor’s network traffic provided supplemental evidence connecting the threat actor's primary and sockpuppet accounts. \n\nWe identified seven customers who received direct communication from the threat actor. We notified each of the customers of our investigation and asked for information related to their interactions. We are grateful for their involvement in our investigation and we thank them for their willing cooperation. Facts shared from their own investigations corroborated the conclusion from our investigation and allowed us to act more quickly. \n\nWe have issued platform bans for the employee's known HackerOne accounts. We have terminated the employee for violating our values, our culture, our policies, and our employment contracts. Subject to review with counsel, we will decide whether criminal referral of this matter is appropriate. We continue forensic analysis on the logs produced and devices used by the former employee. We are reaching out to other bug bounty platforms to share details in case their customers received similar communications from \"rzlr\". The threat actor's motives appear to be financial in nature.\n\nThe threat actor had access to HackerOne systems between April 4th and June 23rd of 2022.\n\nOur investigation will continue. We hope to learn and share more as the investigation continues and will update this post as needed.\n\n# Guidance for customers\nAs a result of the findings of our investigation, we believe we have taken the necessary steps to contain the insider's access. Customers will understandably have questions that we hope to answer here. As any conversation about this disclosure occurs, we will update this guidance with answers to questions as necessary.\n\n## How do I know if I have interacted with this threat actor? \nAll off-platform disclosures known to us have been made with the handle “*rzlr*”. If you have been contacted by this individual, and are not already coordinating with us, please contact support-incident-06-22@hackerone.com immediately. If you receive any security report (on or off the HackerOne platform) that is aggressive or threatening in tone, please contact us immediately.\n\n## What access did the threat actor have to customer data?\nThe former employee's role was to triage vulnerability disclosures for numerous customer programs. This access was granted through their normal job role and their access was visible to our investigation through standard logging within our product. No access to customer data beyond this specific job role was granted or authorized - not through our developer environment, infrastructure, or otherwise. We are confident about access *they were granted* and *what they accessed* (authorized, or not) based on this logging.\n\n## What data did the threat actor access?\nBased on internal logging, we have a clear record of what the threat actor did and did not access. In the vast majority of instances, we have no evidence that the vulnerability data accessed was misused, but we have individually notified customers who had any reports accessed by the threat actor and specified the reports that were accessed along with time of access.\n\n## I received an email from HackerOne about this incident; what do I do?\nThe email you received will identify which reports have been accessed by the threat actor. For the sole purpose of mitigation, unauthorized access to these particular disclosures should be assumed. We recommend escalating the priority in mitigating the risks involved with these disclosures.\n\n## I did *not* receive an email from HackerOne about this incident; what do I do?\nWe have emailed all customers who may have been impacted by this incident, based on the facts of our investigation. If you were not emailed, our investigation does not suggest that any other data was accessed. We do not recommend any further action at this time. We will update this post and notify customers of any new findings.\n\n## I was contacted by this threat actor; what do I do?\nPlease contact your HackerOne customer success manager and/or support-incident-06-22@hackerone.com with the communication, we’ll include it in our investigation, and assist in any manner we can.\n\n## My question hasn't been answered yet; what do I do?\nPlease contact our dedicated incident responders at support-incident-06-22@hackerone.com so we can assist.\n\n# Guidance for Hackers\nYou may be concerned that your disclosures may have been unfairly re-submitted by the threat actor and may have somehow disrupted bounty eligibility by the threat actor involved. Our investigation so far has not discovered any situation where the threat actor made a duplicate disclosure that interfered with the judgment or bounty amount for the original disclosure. All disclosures made from the threat actor were considered duplicates. Bounties applied to these submissions did not impact the original submissions. We will be careful to consider fairness to hackers as our investigation continues.\n\nIf one of your reports was accessed by the threat actor, we will send you an email shortly containing the list of accessed reports. We're sharing these in the spirit of transparency. We would appreciate hearing from you (hackers@hackerone.com) if you believe any of our conclusions above are incorrect.\n\n# Additional Improvements\nWe uphold our commitments to protect your data by continuously improving our resilience to attacks. We have identified several areas that have prompted continual improvement following this incident.\n\n**Logging**: We are happy that our previous investments in logging enabled an expedient investigation and response. While we were able to quickly identify a threat actor in this instance, we will ensure we are further equipped for any eventuality. We have identified further logging improvements that will improve our ability to respond to incidents in the future.\n\n**Detection and Response - Investigation**: Our existing capabilities did not proactively detect and prevent this attack. To ensure we can proactively detect and prevent future threats, we are adding additional employees dedicated to insider threats that will bolster detection, alerting, and response for business operations that require human access to disclosure data.\n\n**Detection and Response - Engineering**: We are allocating additional engineering resources to invest further in internal models designed to identify anomalous access to disclosure data and trigger proactive investigative responses.\n\n**Enhance Hiring Screening**: Our existing industry standard background, criminal, and reference check processes did not screen out the threat actor. We are evaluating possible additional enhancements tailored to this unique threat.\n\n**Data Isolation**: Limiting the impact of a single compromised or malicious insider is an important control in our defenses. We will invest in additional analyst capacity and workflow changes to further reduce the \"blast radius\" of incidents of this type.\t\n\n**Red Team Tabletops**: We are planning additional simulations designed to continuously evaluate and improve our ability to effectively resist insider threats. \n\nIn summary, this was a serious incident. We are confident the insider access is now contained. Insider threats are one of the most insidious in cybersecurity, and we stand ready to do everything in our power to reduce the likelihood of such incidents in the future. A special thank you to the customer who originally alerted us to the possibility of something being wrong and to all the customers who subsequently assisted with this incident.\n\nChris Evans (CISO) and Alex Rice (Founder & CTO)",
      "user": {
        "id": 2,
        "username": "jobert",
        "name": "Jobert Abma",
        "bio": "Co-founder of HackerOne. ಠ_ಠ",
        "cleared": true,
        "verified": true,
        "website": "https://hackerone.com",
        "location": "San Francisco, CA",
        "created_at": "2013-03-08T01:17:12.256Z",
        "url": "https://hackerone.com/jobert",
        "hackerone_triager": false,
        "hackerone_employee": true,
        "user_type": "company",
        "profile_picture_urls": {
          "small": "https://profile-photos.hackerone-user-content.com/variants/ht4b9SmcYNqmpbyCFXd7cxHB/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
          "medium": "https://profile-photos.hackerone-user-content.com/variants/ht4b9SmcYNqmpbyCFXd7cxHB/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937",
          "xtralarge": "https://profile-photos.hackerone-user-content.com/variants/ht4b9SmcYNqmpbyCFXd7cxHB/60f411638706d89ae3052af6fe8b88fa9a798e291deee40f6a22e81418d78d5f"
        }
      },
      "can_view?": true,
      "can_create?": false,
      "attachments": []
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
