{
  "id": 2285198,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8yMjg1MTk4",
  "url": "https://hackerone.com/reports/2285198",
  "title": "How the Arch Angel stole Live Events",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "critical",
  "readable_substate": "Resolved",
  "created_at": "2023-12-14T06:14:59.479Z",
  "submitted_at": "2023-12-14T06:14:59.586Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "archangel",
    "url": "/archangel",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/mi30nrehc6ke2ckv60y093wljrt2/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98"
    },
    "is_me?": false,
    "cleared": true,
    "verified": true,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 13,
    "url": "https://hackerone.com/security",
    "handle": "security",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "HackerOne",
      "twitter_handle": "Hacker0x01",
      "website": "https://hackerone.com",
      "about": "Vulnerability disclosure should be safe, transparent, and rewarding."
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": false,
  "disclosed_at": "2023-12-15T03:47:47.555Z",
  "bug_reporter_agreed_on_going_public_at": "2023-12-14T18:28:27.549Z",
  "team_member_agreed_on_going_public_at": "2023-12-15T03:47:47.321Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "**Summary:**\n\nI figured I'm well overdue for this. \n\nLooking forward to the 2024 LHE season!\n\nI <3 you Hackerone, & Community Team!\n\n**Description:**\n\n\n\n```\n\nEvery hacker on Hackerone liked Live Hacking a lot…  \nBut ArchAngel who’d been to fifteen did NOT!  \nThe Angel hated hacking! The whole live event season!  \nNow, please don’t ask why. No one quite knows the reason.\n\nIt could be perhaps there’s a WAF he can’t thwart,  \nIt could be perhaps the dupe window was too short,  \nBut I think that the most likely reason of all,  \nMay have been that the snack options were two sizes too small.\n\nWhatever the reason, dupe window or the snackers,  \nHe dreaded an invite while HATING the hackers,  \nStaring at his monitor with a sour, bearded frown,  \nAt all the hackers having fun in the live-event town.\n\nFor he knew every hacker at the LHE venue,  \nWas busy ordering drinks from the happy hour menu,  \n“And they’re collabing on bugs!” He snarled with a sneer,  \n“Tomorrow is the event day, it’s practically here!”\n\nThen he growled, with his angelic fingers nervously drumming,  \n“I MUST find some way to stop bounties from coming!”  \nFor Tomorrow, he knew, all the Customer girls and boys,  \nWould wake bright and early. They'd ready their employees!\n\nAnd then! Oh, the exploits! Oh, the exploits!  \nExploits! Exploits! Exploits!  \nThat's one thing he hated! The EXPLOITS!  \nEXPLOITS! EXPLOITS! EXPLOITS!\n\nThen the hackers young and old would sit and hunt bugs.  \nThey’d find bugs, and find bugs, and find BUGS BUGS BUGS BUGS!  \nThey’d find bugs for the customer, who’d give them some hugs,  \nWhich is something that made the arch angel say “ugh!”\n\nAnd THEN they’d do something he liked least of all!  \nEvery hacker at the live event, the tall and the small,  \nWould slam on the keyboard with their fingers jabbing,  \nThey’d hack side by side, and the hackers would start collabing!\n\nThey’d collab! And they’d collar! And they’d COLLAB COLLAB COLLAB!  \nAnd the more the Arch Angel thought of this Live Event Collab,  \nThe more the Arch Angel thought, “their bugs I must grab!”  \nWhy, for thirty-four years I’ve put up with it now!\n\n“I MUST stop the Live Event from starting! But HOW?”  \nThen he got an idea! An awful idea!  \nThe Arch Angel got a wonderful AWFUL idea!  \n“I know just what to do!” The Angel said with fervent,\n\nAs he put on his best Argentine accent  \nAnd he chuckled, “This is the ruse of the century!”  \n“Why with an accent and some stilts, I’ll look just like Ari!”  \n“All I need is some hair…” The Angel looked around.\n\nBut since The Angel was bald, there was none to be found.  \nDid that stop the Arch Angel? No! The Angel simply said,  \n“If I can’t grow my own hair, I’ll steal some good hair instead!”  \nSo he called up Nicole, and took out his shears,\n\nAnd glued on her locks, right above his ears.  \nThen he loaded some bags and some old empty sacks,  \nOnto a plane to go steal some uber leet hax.  \nThe Arch Angel was giddy, as his plane landed down,\n\nAnd slunk from the airport in the live event town.  \nThe venue was dark. He’d have so much success!  \nAll the hackers were still barhopping and partying with Jess!  \nWhen he came to first room of swag he’d finesse.\n\n“This is stop number one,” the old Ari-fake hissed,  \nAnd he walked in the door, empty bags in his fist.  \nHe tried to log into Twitch, a task very painful,  \nBut if Ariel could do it, then so could the Angel.\n\nHe got stuck only once, for a moment or two.  \nThen he restarted his laptop, his monitor blue.  \nAnd announced to the Twitch audience who was there for a show,  \n“These swag boxes,” he grinned, “are the first things to go!”\n\nThen he slithered and slunk, with a smile most unpleasant,  \nAround the whole room, and took every swag present!  \nT-shirts! Waterbottles! Stickers! Hoodies!  \nCustom Snowboards, and other long-awaited goodies!\n\nAnd he stuffed them in bags. Then the Arch Angel of gloom,  \nSet his eyes next on the triaging room.  \nHe slunk into that room. He watched the scope call!  \nHe peaked at the triage queue. His jaw started to fall!\n\nHe darted out of that room as quick as a flash.  \nWhy, the Angel was disgusted they’d make so much cash!  \nSo he set to “NA” all the bugs that were Lows.  \n“And NOW!” Grinned the Angel, “I’ll mark the Crits as Infos!”\n\nAnd the Angel was closing reports without love  \nWhen he heard a small sound, like the coo of a dove.  \nHe turned around fast, and looking quite irate,  \nWas ol Caitlin Allison, whom they call Cait the Great.\n\nThe Angel had been caught by this astute Hackeronie,  \nWho he hoped wouldn’t see that he was just an Ari phony.  \nShe stared at the Angel and said, “Ariel, why,”  \n“Why are you closing the bugs out? WHY?”\n\nBut you know that old Angel was so smart and so slick,  \nHe thought up a lie, and he thought it up quick!  \n“Why my sweet little Cait,” the fake Ariel lied,  \n“There’s a leaderboard change that Shlomie just tried.”\n\n“So I’m closing out TEST bugs, so don’t look so deflated”  \n“I’m just making sure that reputation gets updated.”  \nAnd his fib fooled the Cait. Then he patted her head,  \nAnd he bought her a cosmo and he sent her to bed.\n\nAnd when Cait the Great went to sleep with her booze,  \nHe started closing again, he had no time to lose!  \nThe last bug he closed, was a doozy from Chap,  \nThen he opened up the leaderboard for the event, the old sap.\nAnd with one press of a button, he shut down the whole app.  \n\nAnd the one little bug that he left still open,  \nWas a CSRF from Justin that no one had hope in.  \nThen he did the same thing to other program’s queues,\nKnowing that without bugs, the all the hackers would lose!  \n\nIt was quarter past dawn… All the hackers still hung-over,  \nAll the Hacker’s still asnooze, when his laptop he hunched over,  \nHe packed it up with their swag! Their free drinks! Their Macs!\nTheir Lenovos! Their chargers! Their stickers! Their snacks!  \n\nThree thousand feet up! Up the side of Mt Hood,  \nHe planned to dump it off the mountain for good!  \n“PoohPooh to the Hackers!” He was fiendishly humming!\n“They’re finding out now that no live event is coming!”  \n\n“They’re just waking up! I know just what they’ll do!”  \n“Their mouths will hang open a minute or two,\"\n\"Then the Hackers at the Live Event will all cry BooHoo!”\n\n“That’s a noise,” grinned the Angel, “That I simply MUST hear!”  \nSo he paused. And the Angel put a hand to his ear.  \nAnd he did hear a sound coming in through the Slack.  \nWas it the sound of hackers when they aren’t able to hack?!\n\nBut the sound wasn’t sad! Why, this sound sounded merry!  \nIt couldn’t be so! But it WAS merry! VERY!  \nHe stared at the Live Event! The Angel popped his eyes!  \nThen he shook! What he saw was a shocking surprise!\n\nEvery hacker at the Live Event, the tall and the small,  \nWas collaborating! Without any bounties at all!  \nHe HADN’T stopped the Live Event from coming! IT CAME!  \nSomehow or other, it came just the same!\n\nAnd the Angel, with his angelic fingers tapping on his keyboard,  \nStood puzzling and puzzling: “Why are Live Events so adored?!”  \n“It came without bounties! It came without hacks!”  \n“It came without waterbottles, shirts, or backpacks!”\n\nAnd he puzzled three hours, till his puzzler was sore.  \nThen the Angel thought of something he hadn’t before!  \n“Maybe Live Events,” he thought, “aren’t just about loot.”  \n“Maybe Live Events,” he thought “are about friends and customers to boot!”\n\nAnd what happened next? Well…at Hackerone they say,  \nThat the Angel’s friend circle grew three sizes that day!  \nAnd the minute his heart didn’t feel quite so tight,  \nHe whizzed with his load through the bright morning light,\n\nAnd re-opened the bugs, and gave out swag that was swell,  \nAnd he, HE HIMSELF, The Angel gave the first Show & Tell.\n\n```\n\n## Impact\n\nMerry Christmas & Happy New Year!",
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": "2024-01-13T18:28:27.784Z",
  "allow_singular_disclosure_after": -2664753.398318199,
  "singular_disclosure_allowed": true,
  "vote_count": 88,
  "voters": [
    "onlytesting",
    "0xsp1der",
    "alienisgrinding",
    "sumzer0",
    "aw3t",
    "pinkmeimei",
    "hexpwn",
    "shreyaschavhan",
    "haxor31337",
    "alp",
    "and 78 more..."
  ],
  "severity": {
    "rating": "critical",
    "score": 9.3,
    "author_type": "User",
    "metrics": {
      "attack_vector": "network",
      "attack_complexity": "low",
      "privileges_required": "none",
      "user_interaction": "none",
      "scope": "unchanged",
      "confidentiality": "none",
      "integrity": "none",
      "availability": "high"
    }
  },
  "structured_scope": {
    "databaseId": 5,
    "asset_type": "URL",
    "asset_identifier": "api.hackerone.com",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
