{
  "id": 2353237,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8yMzUzMjM3",
  "url": "https://hackerone.com/reports/2353237",
  "title": "Infromation Disclosure To Use of Hard-coded Cryptographic Key",
  "state": "Closed",
  "substate": "duplicate",
  "severity_rating": "medium",
  "readable_substate": "Duplicate",
  "created_at": "2024-02-02T22:55:18.026Z",
  "submitted_at": "2024-02-02T22:55:18.325Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "ahmed-abdo",
    "url": "/ahmed-abdo",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/62ipu5it7m01cu2wbu69mb7v6eza/ede8cd84a64d5392a2bb88ecb598721116469c27c015c2caa77148f11e211d58"
    },
    "is_me?": false,
    "cleared": false,
    "verified": true,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 35710,
    "url": "https://hackerone.com/reddit",
    "handle": "reddit",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/035/710/c1ae53147a025b33b7c8383200432c8b4a9b839a_original./d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/035/710/c1ae53147a025b33b7c8383200432c8b4a9b839a_original./5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "Reddit",
      "twitter_handle": "reddit",
      "website": "https://www.reddit.com",
      "about": ""
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2024-02-06T16:22:34.580Z",
  "bug_reporter_agreed_on_going_public_at": "2024-02-05T18:08:48.072Z",
  "team_member_agreed_on_going_public_at": "2024-02-06T16:22:34.478Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "## Summary:\n* [ Leaking very sensitive information through a JS file that is clearly for developers within the website and should not be available to the public.\n\n* The leaked information consists of a lot of API keys, Paypal keys, information and keys about the server and the application, and a lot or a lot of sensitive information, and I will explain the information through screenshots. ]\n\n* I will explain and clarify each of these keys that were leaked. I will explain the function of the key, what is its importance, is it considered confidential information or not, and what is the potential impact that would occur if this key was leaked by attackers?, I will try to provide solutions as well .\n\n* Given the functions of these keys and what might happen if they are exploited, I will content myself with providing a detailed breakdown in writing, because if I attempt to exploit them, I strongly believe that severe damage will occur if the exploitation is successful.\n\n## Warning: Please read these details carefully and verify them with one of Reddit’s developers and verify them very carefully because the functions of these keys, their confidentiality, and preserving them from leaking are extremely important for the security of the application and the users.\n\n## POC:\n* 1- stripe:{apiKey:e=>{return e||!Object(n.b)()&&!Object(n.c)()?\"pk_test_Me5fd06PSuMkMF5YnwuMfFf4\":\"pk_live_sD8LeDtVnlJwAGf51jLygWpH\"\nThe stripe key, specifically the apiKey within the stripe object, is used for integration with the payment processing service called Stripe on the Reddit website. Stripe offers tools and APIs that allow websites to accept payments securely over the internet.\nThis apiKey is crucial as it enables Reddit's systems to authenticate and interact securely with Stripe's services. It determines which mode (test or live) Reddit uses to process payment transactions.\nRegarding sensitivity, the apiKey itself is considered sensitive information. If this key were to be leaked or compromised by attackers, it could lead to potential unauthorized access to Reddit's payment processing systems via Stripe. This might result in fraudulent transactions, manipulation of payment settings, or even theft of financial information related to transactions made on Reddit.\nMoreover, leaking the apiKey might allow attackers to bypass Reddit's controls over payment processing, enabling them to initiate transactions or manipulate payment-related functionalities on the platform. This could impact the financial integrity of Reddit and erode user trust in the security of payment transactions on the site.\nIn summary, the stripe apiKey is a critical component for Reddit's payment processing through Stripe. Its security is paramount to prevent unauthorized access, fraudulent transactions, and protect sensitive financial data.\n\n\n* 2- PAYPAL_API_KEY||(Object(n.b)()||Object(n.c)()?\"AXHUGZNCrshqynIpOLkQjqlsrA26Knvf4EB5w1RKfsdxKdsA5WSNo9H_Gng6plKyc48qGhXtmwcYahRy\":\"AXH6yPVeFV8sxT1zMvzr8NyPMXx_YkYui1XCy3btQ_s1Zz2R68JC57PqQ2mrj6la-G8y-7UmZyKVsDaR\")\nThe function of the PAYPAL_API_KEY key in reddit.com\nThe PAYPAL_API_KEY key is used to authenticate requests to the PayPal API. This API is used by reddit.com to process payments.\nThe key is a secret vulnerability because it is used to authenticate requests to the API. If the key is leaked to attackers, they can use it to make unauthorized requests to the API. These requests can then be used to:\nProcess payments without authorization: Attackers could use the key to process payments without authorization from the users. This could be used to steal money from users or to commit fraud.\nChange payment information: Attackers could use the key to change payment information, such as the credit card number or expiration date. This could be used to commit fraud or to steal money from users.\nCancel payments: Attackers could use the key to cancel payments that have already been processed. This could be used to steal money from users or to disrupt business.\nIs it a secret vulnerability?\nYes, the PAYPAL_API_KEY key is a secret vulnerability. It should not be shared with anyone who does not need to know it.\nThe impact if it is leaked to attackers\nThe impact of leaking the PAYPAL_API_KEY key would be significant. It could potentially lead to financial losses for reddit.com, its users, and other businesses that use PayPal.\nHow to protect reddit.com from attacks\nTo protect reddit.com from attacks, site administrators should:\nSecure the key: The key should be stored in a secure location and only accessible to authorized personnel.\nChange the key regularly: The key should be changed regularly to make it more difficult for attackers to obtain it.\nMonitor the site for suspicious activity: If administrators see any signs of suspicious activity, they should investigate immediately.\nBy taking these steps, reddit.com can help to protect itself from attacks using the stolen PAYPAL_API_KEY key.\nSpecific steps reddit.com can take\nIn addition to the general steps listed above, reddit.com can also take the following specific steps to protect itself from attacks using the stolen PAYPAL_API_KEY key:\nScan the site for any existing fraudulent payments: Attackers may have already processed fraudulent payments before the key was changed.\nEducate users about the risks of fraudulent payments: Users should be aware of the signs of fraudulent payments and should report any suspicious activity to reddit.com.\nWork with PayPal to investigate the leak: PayPal may be able to help reddit.com to identify the source of the leak and take steps to prevent it from happening again.\nBy taking these steps, reddit.com can help to protect its users and its site from attacks.\nSpecific examples of how attackers could use the PAYPAL_API_KEY key\nHere are some specific examples of how attackers could use the PAYPAL_API_KEY key:\nTo steal money from users: Attackers could use the key to process payments without authorization from the users. They could then withdraw the money from the users' bank accounts.\nTo commit fraud: Attackers could use the key to change payment information, such as the credit card number or expiration date. This could be used to commit fraud or to steal money from users.\nTo disrupt business: Attackers could use the key to cancel payments that have already been processed. This could be used to disrupt business or to steal money from businesses.\nBy understanding the potential risks of leaking the PAYPAL_API_KEY key, reddit.com can take steps to protect itself and its users from attacks.\nIn the specific case of the key you provided, the impact would be limited because it is a test key. However, it is still important to keep this key secure to prevent it from being used for malicious purposes.\n\n\n* 3- BRAINTREE_PAYPAL_KEY||(Object(n.b)()?\"Aflf49iitQXbetXO8Ufm6q7zjADO-15_X1tzZqv-hveq4htWjHYNxEmrtB0s0yyyLOCG_ceCB-32EtdY\":\"AXH6yPVeFV8sxT1zMvzr8NyPMXx_YkYui1XCy3btQ_s1Zz2R68JC57PqQ2mrj6la-G8y-7UmZyKVsDaR\"),env\nThe BRAINTREE_PAYPAL_KEY is a key used for integrating Braintree's PayPal services into the Reddit website, specifically for handling and facilitating PayPal transactions.\nThis key plays a crucial role in allowing Reddit's systems to securely communicate and authenticate with Braintree's PayPal API. It enables the platform to process payments, manage transactions, and facilitate financial interactions between Reddit and Braintree's PayPal infrastructure.\nRegarding its sensitivity, the BRAINTREE_PAYPAL_KEY is considered confidential information. If this key were to be leaked or compromised by attackers, it could pose significant security risks and potential financial threats. Attackers might exploit the key to gain unauthorized access to Reddit's Braintree integration, potentially performing unauthorized transactions, altering payment configurations, or accessing sensitive financial data associated with PayPal transactions conducted through Reddit.\nAdditionally, a leaked BRAINTREE_PAYPAL_KEY might allow attackers to misuse Braintree's PayPal services on behalf of Reddit without proper authorization. This could lead to financial losses, misuse of resources, or disruptions in the payment processing system, impacting both Reddit and its users.\nOverall, the BRAINTREE_PAYPAL_KEY is a critical component for enabling PayPal's functionalities via Braintree on Reddit. Its security is vital in preventing unauthorized access, financial fraud, and ensuring the integrity of payment transactions and financial data on the platform.\n\n\n* 4- PAYPAL_API_KEY||Object(n.b)()||Object(n.c)()?\"production\":\"sandbox\",buttons:{premium:\"LAYT3KA5EVVTJ\",coins500:\"SNCZX9LADYMT4\",coins1100:\"6P6X4LTAKNDGG\",coins1800:\"2P5FZYZL42NME\",coins7200:\"W8BKWZXBSWZGC\",coins40000:\"Y9LZ5M2W6VT3A\",coinsGild500:\"BPVKB5BY8HXRA\",coinsGild1100:\"TPGZ3HZ3KE5TS\",coinsGild1800:\"YXZDTMAGNMMEA\",coinsGild7200:\"MQDLLC4FBNSZG\",coinsGild40000:\"T3RL7U6STH7WL\"\nThe PAYPAL_API_KEY you're referring to seems to be a part of the configuration or settings related to PayPal integration within Reddit. However, the format provided appears to have a conditional structure involving Object(n.b)() and Object(n.c)() that seems incomplete, possibly indicating a conditional check or logic associated with the PayPal API key for distinguishing between production and sandbox environments.\nIn general, the function of a PayPal API key in any online platform, including Reddit, is to authenticate and authorize access to PayPal's services. This key is used to establish a secure connection between Reddit's systems and PayPal's API (Application Programming Interface). It allows Reddit to initiate and manage payment transactions, process financial operations, and interact with PayPal's infrastructure securely.\nAs for sensitivity, API keys like the PAYPAL_API_KEY are indeed considered sensitive information. If this key were to be exposed or leaked, especially in a scenario where it distinguishes between production (live/real) and sandbox (testing) environments, it could pose several risks:\nUnauthorized Transactions: Attackers could potentially use the exposed key to perform unauthorized transactions, manipulate payment configurations, or access sensitive financial data associated with PayPal transactions conducted through Reddit.\nMisuse of Sandbox Environment: If the key determines whether Reddit operates in a sandbox environment for testing purposes, unauthorized access might lead to the abuse of testing resources or functionalities, potentially disrupting development or testing processes.\nFinancial Risks: Leaking sensitive payment-related keys could result in financial losses, fraudulent activities, or disruptions in the payment processing system, affecting both Reddit and its users.\nRegarding the provided keys such as buttons, these seem to represent specific identifiers or labels associated with different payment options or packages (e.g., premium subscriptions, various coin packages) within Reddit's payment system. These keys likely serve as references or identifiers for specific payment options presented to users during transactions.\nOverall, while the specific context of the conditional statement isn’t entirely clear, the PAYPAL_API_KEY and associated payment identifiers are crucial for Reddit's PayPal integration, and their security is essential to safeguard against unauthorized access, financial fraud, and maintain the integrity of payment transactions within the platform.\n\n\n* 5- giphyApiKey:\"k2kwyMA6VeyHM6ZRT96OXDGaersnx73Z\"\nThe giphyApiKey key is used to authenticate requests to the Giphy API. This API is used by reddit.com to fetch GIFs and other animated images.\nThe key is a secret vulnerability because it is used to authenticate requests to the API. If the key is leaked to attackers, they can use it to make unauthorized requests to the API. These requests can then be used to:\nFetch GIFs that are not publicly available: Attackers can use the key to fetch GIFs that are only available to premium users or that have been marked as private.\nModify GIFs: Attackers can use the key to modify GIFs, such as changing the text or adding watermarks.\nDelete GIFs: Attackers can use the key to delete GIFs.\nThe impact if it is leaked to attackers\nThe impact of leaking the giphyApiKey key would depend on how it is used by attackers. However, it could potentially have a significant impact on reddit.com, its users, and the Giphy API.\nHow to protect reddit.com from attacks\nTo protect reddit.com from attacks, site administrators should:\nSecure the key: The key should be stored in a secure location and only accessible to authorized personnel.\nChange the key regularly: The key should be changed regularly to make it more difficult for attackers to obtain it.\nMonitor the site for suspicious activity: If administrators see any signs of suspicious activity, they should investigate immediately.\nBy taking these steps, reddit.com can help to protect itself from attacks using the stolen giphyApiKey key.\nSpecific steps reddit.com can take\nIn addition to the general steps listed above, reddit.com can also take the following specific steps to protect itself from attacks using the stolen giphyApiKey key:\nScan the site for any existing malicious GIFs. Attackers may have already uploaded malicious GIFs before the key was changed.\nEducate users about the risks of malicious GIFs. Users should be aware that they should not click on any links or open any files in a GIF unless they are sure that the GIF is legitimate.\nWork with Giphy to investigate the leak. Giphy may be able to help reddit.com to identify the source of the leak and take steps to prevent it from happening again.\nBy taking these steps, reddit.com can help to protect its users and its site from attacks.\nSpecific examples of how attackers could use the giphyApiKey key\nHere are some specific examples of how attackers could use the giphyApiKey key:\nTo spread spam: Attackers could use the key to fetch GIFs that are relevant to a particular topic or audience and then post those GIFs to reddit.com or other websites. This could be used to spread spam, promote illegal content, or engage in other malicious activities.\nTo spread misinformation: Attackers could use the key to fetch GIFs that contain false or misleading information and then post those GIFs to reddit.com or other websites. This could be used to spread misinformation or propaganda.\nTo target individuals or groups: Attackers could use the key to fetch GIFs that are targeted at a particular individual or group. This could be used to harass or intimidate individuals or groups.\nBy understanding the potential risks of leaking the giphyApiKey key, reddit.com can take steps to protect itself and its users from attacks.\n\n\n* 6-  muxApiKey:\"mcpf0hehcbo78k9u67arfer8a\"\nThe muxApiKey is a key used on the Reddit website for handling multimedia content, specifically related to Mux services. Mux provides infrastructure for video streaming, analytics, and monitoring. This key is essentially an identifier that allows Reddit's systems to communicate securely with Mux services, ensuring that multimedia content like videos is properly managed and delivered to users.\nThis key is considered sensitive and somewhat confidential. If it were to be leaked or compromised by attackers, it could potentially lead to several issues. One of the primary concerns would be unauthorized access or tampering with multimedia content served through Mux. This could result in a compromise of video content, potentially allowing malicious actors to manipulate or replace videos on the Reddit platform, leading to misinformation or security breaches.\nMoreover, if this key is exposed, it might enable attackers to use Reddit's resources on the Mux platform without permission, leading to misuse of resources and potentially incurring unexpected costs or disrupting services.\nOverall, the muxApiKey is a critical component in managing multimedia content on Reddit, and its security is paramount to ensure the integrity and safety of the platform's multimedia functionalities.\n\n\n* 7- EMBEDLY_KEY||\"522baf40bd3911e08d854040d3dc5c07\" The embedlyApiKey on the Reddit website serves the purpose of integrating and displaying embedded content from various sources across the web. Embedly is a service that allows websites to embed rich media content like videos, articles, and images from different platforms and sources.\nThis key is used by Reddit's systems to communicate securely with Embedly's services, enabling the platform to fetch and display content previews, such as when users post links or embed media in their posts or comments.\nRegarding its sensitivity, while it's not a private key per se, it still holds importance in the functionality of the platform. If this key were to be compromised or leaked by attackers, it could lead to potential abuse or disruption of the embedded content functionality on Reddit. Attackers might misuse the key to manipulate embedded content or disrupt the way these external resources are displayed, affecting the user experience by potentially altering the appearance or accessibility of linked content.\nMoreover, a leaked embedlyApiKey could allow unauthorized access to Embedly's services using Reddit's account, leading to misuse of resources and potentially incurring unexpected costs or service disruptions.\nIn summary, the embedlyApiKey is crucial for integrating external content into Reddit, and while not as sensitive as certain authentication keys, its security is vital to ensure the proper functioning and security of embedded content on the platform.\n\n\n[*] I cannot attach more keys or information, and I will suffice with screenshots. No, the file is very large and I cannot review it. I leave this matter to you because this is confidential information and I will not access it without your permission.\n* Link : https://www.redditstatic.com/desktop2x/Governance~Reddit.d5b31ca1a5d24df34b88.js\n\n\n## Steps To Reproduce:\n[add details for how we can reproduce the issue]\n* [ I discovered this link while I was conducting a survey and collecting information, and I discovered it when I visited this link https://www.reddit.com/?rdt=49420 after logging into my account, as I will explain in pictures using the Trufflehog tool. ]\n\n\n## Impact\n\n* The impact is very large due to the large number of leaked information and its many types, and I will not be able to mention all the possible impact due to the large number of leaked information. I will leave this matter to you, and I believe that this will require a great deal of time and effort that",
  "weakness": {
    "id": 35,
    "name": "Use of Hard-coded Cryptographic Key"
  },
  "original_report_id": 2300140,
  "original_report_url": "https://hackerone.com/reports/2300140",
  "attachments": [],
  "allow_singular_disclosure_at": null,
  "vote_count": 36,
  "voters": [
    "pkkr",
    "im4x",
    "roland_hack",
    "exec_iq",
    "shubham_srt",
    "neil-tsakatsa",
    "isira_adithya",
    "shivammusic",
    "ahmed-abdo",
    "muhammed_anas_kp",
    "and 26 more..."
  ],
  "severity": {
    "rating": "medium",
    "author_type": "User"
  },
  "structured_scope": {
    "databaseId": 18825,
    "asset_type": "URL",
    "asset_identifier": "www.reddit.com",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
