Repository: Rbcafe/CVER
Catalog: CVE/YEAR/2010/CVE-2010-2387/Source/gdm/po/*.po
Languages: ta, vi, zh_cn

source: Setup the picture that will show in the GDM (login manager) face browser
zh_cn: 设定将显示在 GDM (登录管理器) 的头像浏览器中的照片

source: Xnest command line
vi: Lệnh Xnest
zh_cn: Xnest 命令行

source: STRING
vi: CHUỖI
zh_cn: 字符串

source: Extra options for Xnest
vi: Tùy chọn bổ sung cho Xnest
zh_cn: Xnest 的更多选项

source: OPTIONS
vi: TÙY CHỌN
zh_cn: 选项

source: Just run Xnest, no query (no chooser)
vi: Chỉ chạy Xnest, không truy vấn (không trình chọn lựa)
zh_cn: 仅仅运行 Xnest，而不必查询 (无选择程序)

source: Do direct query instead of indirect (chooser)
vi: Thực hiện truy vấn trực tiếp thay vì gián tiếp (trình chọn lựa)
zh_cn: 进行直接查询而不是间接查询 (选择程序)

source: Run broadcast instead of indirect (chooser)
zh_cn: 进行广播而不是间接查询 (选择程序)

source: Run in background
vi: Chạy đằng sau
zh_cn: 在后台中运行

source: Don't check for running gdm
vi: Không kiểm tra GDM có đang chạy hay không
zh_cn: 不要检查运行中的 gdm

source: Xnest doesn't exist. Please ask your system administrator to install it.
vi: Xnest không tồn tại. Vui lòng yêu cầu system administrator cài đặt Xnest.
zh_cn: Xnest 不存在。 请要求您的系统 管理员安装它。

source: Indirect XDMCP is not enabled, please ask your system administrator to enable it in the GDM configurator program.
vi: XDMCP gián tiếp không được bật, vui lòng yêu cầu system administrator bật nó trong trình cấu hình GDM.
zh_cn: 没有启用间接 XDMCP， 请要求您的系统管理员在 GDM 配置程序中启用它。

source: Could not find a free display number
vi: Không tìm thấy số hiệu display dùng được
zh_cn: 无法找到空闲的显示编号

source: greeter_parse_config: No configuration file: %s. Using defaults.
vi: greeter_parse_config: Không có tập tin cấu hình: %s. Dùng cấu hình mặc định.
zh_cn: greeter_parse_config：缺少配置文件：%s。使用默认配置。

source: Catalan
zh_cn: 加泰罗尼亚语

source: Chinese (simplified)
zh_cn: 中文 (简体)

source: Chinese (traditional)
zh_cn: 中文 (繁体)

source: Croatian
vi: Croatia
zh_cn: 克罗地亚语

source: Czech
vi: Séc
zh_cn: 捷克语

source: Danish
vi: Đan Mạch
zh_cn: 丹麦语

source: Dutch
vi: Hà Lan
zh_cn: 荷兰语

source: English
vi: Anh
zh_cn: 英语

source: American English
vi: Mỹ
zh_cn: 美国英语

source: British English
vi: Anh
zh_cn: 英国英语

source: Estonian
vi: Estonia
zh_cn: 爱沙尼亚语

source: Finnish
vi: Phần Lan
zh_cn: 芬兰语

source: French
vi: Pháp
zh_cn: 法语

source: Galician
zh_cn: 加利西亚语

source: German
vi: Đức
zh_cn: 德语

source: Greek
vi: Hy Lạp
zh_cn: 希腊语

source: Hebrew
vi: Do Thái
zh_cn: 希伯来语

source: Hungarian
vi: Hungari
zh_cn: 匈牙利语

source: Icelandic
zh_cn: 冰岛语

source: Italian
vi: Ý
zh_cn: 意大利语

source: Japanese
vi: Nhật
zh_cn: 日语

source: Korean
vi: Hàn Quốc
zh_cn: 韩语

source: Lithuanian
zh_cn: 立陶宛语

source: Norwegian (bokmal)
zh_cn: 挪威语 (博克马尔语)

source: Norwegian (nynorsk)
zh_cn: 挪威语 (尼诺斯克语)

source: Polish
vi: Ba Lan
zh_cn: 波兰语

source: Portuguese
vi: Bồ Đào Nha
zh_cn: 葡萄牙语

source: Brazilian Portuguese
vi: Braxin
zh_cn: 巴西葡萄牙语

source: Romanian
vi: Rumani
zh_cn: 罗马尼亚语

source: Russian
vi: Nga
zh_cn: 俄语

source: Slovak
zh_cn: 斯洛伐克语

source: Slovenian
vi: Slovenia
zh_cn: 斯洛文尼亚语

source: Spanish
vi: Tây Ban Nha
zh_cn: 西班牙语

source: Swedish
vi: Thụy Điển
zh_cn: 瑞典语

source: Turkish
vi: Thổ Nhĩ Ký
zh_cn: 土耳其语

source: Shut down the computer
vi: Tắt máy
zh_cn: 关闭计算机

source: Suspend the computer
vi: Tạm dừng máy
zh_cn: 挂起计算机

source: Reboot the computer
vi: Khởi động máy
zh_cn: 重启计算机

source: gdmaskpass only runs as root
vi: gdmaskpass chỉ chạy với root
zh_cn: gdmaskpass 只能以根用户身份运行

source: Authentication failure!
vi: Quá trình xác nhận thất bại!
zh_cn: 认证失败！

source: (memory buffer)
vi: (vùng đệm bộ nhớ)
zh_cn: (内存缓冲区)

source: (memory buffer
vi: (vùng đệm bộ nhớ
zh_cn: (内存缓冲区)

source: An error occured while loading the user interface element %s%s from file %s. Possibly the glade interface description was corrupted. %s cannot continue and will exit now. You should check your installation of %s or reinstall %s.
vi: Xảy ra lỗi khi nạp %s%s từ tập tin %s. Có lẽ tập tin glade bị hỏng. %s không thế tiếp tục nên sẽ kết thúc ở đây. Bạn nên kiểm tra lại bản cài đăn %s hoặc cài đặt lại %s.
zh_cn: 从文件 %3$s 中装入用户界面 元素 %1$s%2$s 是出现错误。 glade 界面描述可能已毁坏。 %4$s 无法继续并将立即退出。 您应该检查您安装的 %5$s 或重新安装 %6$s。

source: Glade file is on crack! Make sure the correct file is installed! file: %s widget: %s
vi: Tập tin glade bị hư! Hãy kiểm tra lại xem tập tin này được cài đặt chưa. tập tin: %s ô điều khiển: %s
zh_cn: Glade 文件已毁坏！确认安装了正确的文件！ 文件：%s 构件：%s

source: An error occured while loading the user interface element %s%s from file %s. CList type widget should have %d columns. Possibly the glade interface description was corrupted. %s cannot continue and will exit now. You should check your installation of %s or reinstall %s.
vi: Một lỗi đã xảy ra trong quá trình nạp %s%s từ tập tin %s. Ô điều khiển CList nên có %d cột. Có lẽ tập tin glade bị hỏng. %s không thể tiếp tục và sẽ kết ở đây. Bạn nên xem lại bản cài đặt %s hoặc cài lại %s.
zh_cn: 从文件 %3$s 中装入用户界面 元素 %1$s%2$s 时出现错误。 CList 类型构件应该含有 %4$d 列。 Glade 界面描述可能已经毁坏。 %5$s 无法继续并将立即退出。 您应该检查您安装的 %6$s 或重新安装 %7$s。

source: Glade file is on crack! Make sure the correct file is installed! file: %s widget: %s expected clist columns: %d
vi: Tập tin glade bị hư! Hãy chắc rằng tập tin này đã được cài đặt! tập tin: %s ô điều khiển: %s số cột clist yêu cầu: %d
zh_cn: Glade 文件已毁坏！请确认安装了正确的文件！ 文件：%s 构件：%s 需要 clist 列：%d

source: An error occured while loading the user interface from file %s. Possibly the glade interface description was not found. %s cannot continue and will exit now. You should check your installation of %s or reinstall %s.
vi: Một lỗi đã xảy ra trong khi nạp tập tin glade %s. Có lẽ tập tin glade bị hỏng. %s không thể tiếp tục và sẽ kết thúc ở đây. Bạn nên kiểm tra lại bản cài đặt của %s hoặc cài đặt lại %s.
zh_cn: 从文件 %s 中装入用户 界面时出现错误。 可能找不到 glade 界面描述。 %s 无法继续并将立即退出。 您应该检查您安装的 %s 或重新安装 %s。

source: No interface could be loaded, BAD! (file: %s)
vi: Không thể nạp có giao diện nào cả, tệ quá! (tập tin: %s)
zh_cn: 没有可以装入的界面，糟糕！(文件：%s)

source: %s: Cannot create pipe
vi: %s: Không thể tạo ống dẫn.

source: %s: No configuration file: %s. Using defaults.
vi: %s: Không có tập tin cấu hình: %s. Dùng cấu hình mặc định.

source: %s: XDMCP was enabled while there is no XDMCP support, turning it off
vi: %s: XDMCP được bật trong khi không có hỗ trợ XDMCP. Tắt XDMCP

source: %s: Root cannot be autologged in, turing off automatic login
vi: %s: Root không thể đăng nhập tự động. Tắt chức năng tự động đăng nhập

source: %s: Root cannot be autologged in, turing off timed login
vi: %s: Root thể không thể đăng nhập tự động. Tắt chức năng timed login

source: %s: TimedLoginDelay less then 5, so I will just use 5.
vi: %s: TimedLoginDelay nhỏ hơn 5. Chỉnh lại bằng 5.

source: %s: No greeter specified.
vi: %s: Chưa xác định trình chào hỏi.

source: %s: No remote greeter specified.
vi: %s: Chưa xác định trình chào hỏi từ xa.

source: %s: No authdir specified.
vi: %s: Không có thông số authdir.

source: %s: No sessions directory specified.
vi: %s: Không có thư mục session.

source: %s: Invalid server line in config file. Ignoring!
vi: %s: Dòng server trong tập tin cấu hình không hợp lệ. Bỏ qua!

source: %s: XDMCP disabled and no local servers defined. Aborting!
vi: %s: XDMCP đã tắt mà lại không tìm thấy server cục bộ. Ngừng hoạt động!

source: %s: Can't find the gdm user (%s). Trying 'nobody'!
vi: %s: Không thể tìm thấy người dùng gdm (%s). Thử dùng 'nobody'!

source: %s: Can't find the gdm user (%s). Aborting!
vi: %s: Không thể tìm thấy người dùng gdm (%s). Ngừng hoạt động!

source: %s: The gdm user should not be root. Aborting!
vi: %s: Người dùng gdm không thể là root. Ngừng hoạt động!

source: %s: Can't find the gdm group (%s). Trying 'nobody'!
vi: %s: Không thể tìm thấy nhóm gdm (%s). Thử dùng 'nobody'!

source: %s: Can't find the gdm group (%s). Aborting!
vi: %s: Không thể tìm thấy nhóm gdm (%s). Ngừng hoạt động!

source: %s: The gdm group should not be root. Aborting!
vi: %s: Nhóm gdm không thể là root. Ngừng hoạt động!

source: %s: Remote greeter not found or can't be executed by the gdm user
vi: %s: Không tìm thấy trình chào hỏi từ xa, hoặc người dùng gdm không thể thực hiện trình chào hỏi

source: %s: Authdir %s does not exist. Aborting.
vi: %s: Thư mục Authdir %s không tồn tại. Ngừng hoạt động.

source: %s: Authdir %s is not a directory. Aborting.
vi: %s: Thư mục Authdir %s không phải là một thư mục. Ngừng hoạt động.

source: %s: Authdir %s is not owned by user %s, group %s. Aborting.
vi: %s: Thư mục Authdir %s không được sở hũu bởi người dùng %s, nhóm %s. Ngừng hoạt động.

source: %s: Authdir %s has wrong permissions %o. Should be 0750. Aborting.
vi: %s: Thư mục Authdir %s có quyền truy nhập %o không đúng. Phải là 0750. Ngừng hoạt động.

source: %s: Can't init pipe to gdmgreeter
vi: %s: Không thể khởi động ống dẫn tới gdmgreeter

source: %s: Error starting greeter on display %s
vi: %s: Lỗi khi khởi động trình chào hỏi trên display %s

source: %s: Can't fork gdmgreeter process
vi: %s: Không thể nhân đôi tiến trình gdmgreeter

source: The main area of this application shows the hosts on the local network that have "XDMCP" enabled. This allows users to login remotely to other machines as if they were logged on using the console. You can rescan the network for new hosts by clicking "Refresh". When you have selected a host click "Connect" to open a session to that machine.
vi: Phần chính của ứng dụng hiển thị các máy chủ trên mạng nội bộ mà có bật "XDMCP". Nó cho phép các người dùng đăng nhập từ xa vào các máy khác như thể họ đăng nhập bằng console. Bạn có thể quét lại mạng để phát hiện các máy chủ mới bằng cách nhấn nút 'Quét lại'. Khi bạn chọn một máy, nhấn "Kết nối" để mở một session tới máy đó.

source: Gdm Host Chooser
vi: Bộ chọn máy chủ

source: C_onnect
vi: Kết nối

source: Status
vi: Trạng thái

source: Trying to update an unsupported configuration key.
vi: Đang thử cập nhật khóa cấu hình chưa được hỗ trợ.

source: This panel displays the basic options for configuring GDM. If you need finer detail, select 'Expert' or 'System' from the list above,which will display some of the more complex options of GDM that rarely need to be changed.
vi: Panel này hiển thị các tùy chọn cơ bản để cấu hình GDM. Nếu bạn cần thông tin cao cấp hơn, hay chọn mục 'Chuyên gia' hoặc 'Hệ thống' từ danh sách trên. Những mục đó sẽ hiển thị các tùy chọn phức tạp hơn và hiếm khi cần thay đổi.

source: Change the picture that will show in the GDM (login manager) face browser
vi: Thay đổi ảnh dùng để hiển thị trong trình duyệt mặt GDM

source: Login Photo
vi: Ảnh đăng nhập

source: Standard greeter
vi: Trình chào hỏi chuẩn

source: Graphical greeter
vi: Trình chào hỏi đồ họa

source: GDM Setup
vi: Thiết lập GDM

source: Local:
vi: Cục bộ:

source: Remote:
vi: Từ xa:

source: Greeter
vi: Trình chào hỏi

source: Automatic login username:
vi: Tên người dùng tự động đăng nhập:

source: Seconds before login:
vi: Số giây trưới khi đăng nhập:

source: General
vi: Chung

source: Retry delay (seconds) :
vi: Khoảng đợi trước khi thử lại:

source: Maximum pending requests:
vi: Số yêu cầu bị hoãn tối đa:

source: Max pending indirect requests:
vi: Số yêu cầu gián tiếp tối đa:

source: Maximum remote sessions:
vi: Số session từ xa tối đa:

source: Maximum wait time:
vi: Thời gian chờ tối đa:

source: Maximum indirect wait time:
vi: Thời gian chờ gián tiếp tối đa:

source: There was an error loading the theme, and the default theme also could not have been loaded, I will attempt to start the standard greeter
vi: Xảy ra lỗi khi đang nạp theme, mà theme mặc định cũng không thể nạp. Sẽ thử khởi động trình chào hỏi mặc định

source: I could not start the standard greeter. This display will abort and you may have to login another way and fix the installation of gdm
vi: Không thể khởi động trình chào hỏi mặc định. Display này sẽ bị dừng và bạn có lẽ phải đăng nhập bằng cách khác và sửa bản cài đặt GDM

source: Remote Host Login
ta: ¦¾¡¨Ä-Å¢Õó§¾¡õÀ¸ ¦¾¡¼ì¸õ

source: Cancel
ta: ¿£ìÌ

source: gdm_config_parse: No configuration file: %s. Aborting.
ta: gdm_config_parse: %s «¨ÁÅÊÅ §¸¡ôÒ ­ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.

source: gdm_config_parse: Authdir %s is not owned by root, group %s. Aborting.
ta: gdm_config_parse: Authdir %s ìÌ ¦º¡ó¾õ root, ¦¾¡Ì¾¢ %s «øÄ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.

source: gdm_config_parse: Authdir %s has wrong permissions. Should be 750. Aborting.
ta: gdm_config_parse: Authdir %s ìÌ À¢¨ÆÂ¡É «ÑÁ¾¢¸û. 750 ¬¸ ­Õì¸ §ÅñÎõ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.

source: gdm_child_handler: Server slave %s exited
ta: gdm_child_handler: «Ê¨Á §º¨ÅÂ¸õ %s ¦ÅÇ¢§ÂÈ¢Å¢ğ¼Ğ

source: gdm_child_handler: Aborting display %s due to server failure
ta: gdm_child_handler: §º¨ÅÂ¸õ ¦¿¡ÊôÀ¨¼ó¾¾¡ø ¸¡ğÊ %s ÓÈ¢ò¾Ğ

source: gdm_child_handler: Aborting display %s
ta: gdm_child_handler: ¸¡ğÊ %s ã¼ôÀÎ¸¢ıÈĞ

source: gdm_child_handler: Reboot failed: %s
ta: gdm_child_handler: ÁÚ ¦¾¡¼ì¸õ À¢¨ÆÂ¨¼ó¾Ğ: %s

source: gdm_child_handler: Halt failed: %s
ta: gdm_child_handler: ¿¢Úò¾ø À¢¨ÆÂ¨¼ó¾Ğ: %s

source: gdm_main: Error setting up TERM signal handler
ta: gdm_main: TERM ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_main: Error setting up INT signal handler
ta: gdm_main: INT ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_main: Error setting up CHLD signal handler
ta: gdm_main: CHLD ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_auth_user_file: Could not open cookie file %s
ta: gdm_auth_user_file: cookie §¸¡ôÒ %s ¾¢Èì¸ ÓÊÂÅ¢ø¨Ä

source: gdm_server_start: Could not open logfile for display %s!
ta: gdm_server_start: ¸¡ñÀ¢ôÀ¾üÌ logfile ¾¢Èì¸ ÓÊÂÅ¢ø¨Ä %s!

source: gdm_server_start: Error setting up TERM signal handler
ta: gdm_server_start: TERM ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_server_start: Error setting up INT signal handler
ta: gdm_server_start: INT ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_server_start: Error setting up HUP signal handler
ta: gdm_server_start: HUP ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_server_start: Error setting up USR1 signal handler
ta: gdm_server_start: USR1 ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_server_start: Error setting up CHLD signal handler
ta: gdm_server_start: CHLD ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_server_spawn: X server not found: %s
ta: gdm_server_spawn: X §º¨ÅÂ¸ò¨¾ ¸ñÎÀ¢Êì¸ ÓÊÂÅ¢ø¨Ä: %s

source: gdm_slave_init: Failed starting local X server
ta: gdm_slave_init: ¯ûÇ¨Á X §º¨ÅÂ¸ò¨¾ ¦¾¡¼í¸ ÓÊÂÅ¢ø¨Ä

source: gdm_slave_init: Error setting up TERM/INT signal handler
ta: gdm_slave_init: TERM/INT ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_slave_init: Error setting up CHLD signal handler
ta: gdm_slave_init: CHLD ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: gdm_slave_greeter: Couldn't set groupid to %d
ta: gdm_slave_greeter: groupid¨Â %d ìÌ «¨Áì¸ ÓÊÂÅ¢ø¨Ä

source: gdm_slave_greeter: Couldn't set userid to %d
ta: gdm_slave_greeter: userid¨Â %d ìÌ «¨Áì¸ ÓÊÂÅ¢ø¨Ä

source: gdm_slave_session_start: Could not setgid %d. Aborting.
ta: gdm_slave_session_start: setgid %d ÓÊÂÅ¢ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.

source: gdm_slave_session_start: initgroups() failed for %s. Aborting.
ta: gdm_slave_session_start: %s ¸Ì initgroups() ¦¿¡ÊôÀ¨¼ó¾Ğ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.

source: gdm_slave_windows_kill_ioerror_handler: Fatal X error - Restarting %s
ta: gdm_slave_windows_kill_ioerror_handler: X ¦¸¡ø À¢¨Æ - %s ÁÚ¦¾¡¼ì¸õ

source: gdm_slave_xsync_ping: Error setting up ALARM signal handler
ta: gdm_slave_xsync_ping: ALARM ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ

source: Login:
ta: Ñ¨Æ:

source: Can't find /etc/pam.d/gdm!
ta: /etc/pam.d/gdm ¸ñÎÀ¢Êì¸ ÓÊÂÅ¢ø¨Ä!

source: Couldn't authenticate %s
ta: ¿¢ÕÀ¢ì¸ ÓÊÂÅ¢ø¨Ä %s

source: gdm_verify_check: Can't find PAM configuration file for gdm
ta: gdm_verify_check: gdmì¸¡É PAM «¨Á-ÅÊÅì §¸¡ô¨À ¸ñÎÀ¢Êì¸ ÓÊÂÅ¢ø¨Ä

source: Password:
ta: ¸¼×î¦º¡ø:

source: User unknown
ta: ¦¾Ã¢Â¡¾ ÀÂÉ÷

source: Root login disallowed
ta: Root Ñ¨ÆÂ «ÛÁ¾¢ ¸¢¨¼Â¡Ğ

source: Incorrect password
ta: À¢¨ÆÂ¡É ¸¼×î¦º¡ø

source: Display not authorized to connect
ta: ¦¾¡ÎôÒ¦¸¡ûÇ ¸¡ğº¢ìÌ «ÛÁ¾¢ ¸¢¨¼Â¡Ğ

source: gdm_xdmcp_manage: Could not read Display Class
ta: gdm_xdmcp_manage: ¸¡ğº¢ Å¨¸¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä

source: gdm_xdmcp_handle_manage: Could not open logfile for display %s!
ta: gdm_xdmcp_handle_manage: %s ¸¡ğº¢Â¢ı logfile ¾¢Èì¸ ÓÊÂÅ¢ø¨Ä!

source: gdm_login_parse_config: No configuration file: %s. Aborting.
ta: gdm_login_parse_config: %s «¨Á ÅÊÅ §¸¡ôÒ ¸¢¨¼Â¡Ğ. ¿¢Úò¾ôÀÎ¸¢È¾Â.

source: Are you sure you want to halt the machine?
ta: ¯ı¨ÁÂ¡¸ ­ó¾ ¦À¡È¢¨Â ¿¢Úò¾ §ÅñÎÁ¡?

source: Locale...
ta: ¦Á¡Æ¢-­¼õ...

source: Halt...
ta: ¿¢ÚòĞ...

source: Iconify
ta: ÌÚõÀ¼Á¡ìÌ

source: Language Selection
ta: ¦Á¡Æ¢ ¦¾Ã¢× ¦ºö¾ø

source: Select your preferred language to the left, then your country to the right.
ta: ¯í¸û ¿¡ğ¨¼ ÅÄĞ Àì¸ò¾¢Öõ, À¢Êò¾ ¦Á¡Æ¢¨Â ­¼Ğ Àì¸ò¾¢Öõ ¦¾Ã¢× ¦ºöÂ×õ.

source: Country
ta: ¿¡Î

source: Save
ta: §ºÁ¢

source: Use
ta: ÀÂıÀÎòĞ

source: Welcome to %s
ta: %s ìÌ ÅÕ¸
