Repository: Rbcafe/CVER
Catalog: CVE/YEAR/2010/CVE-2010-2387/Source/gdm/po/*.po
Languages: ta, vi, zh_cn

source: gdm_slave_wait_for_login: No login/Bad login
vi: gdm_slave_wait_for_login: Không có login hoặc login bị hỏng
zh_cn: gdm_slave_wait_for_login：未登录/错误的登录

source: gdm_slave_greeter: Can't init pipe to gdmgreeter
zh_cn: gdm_slave_greeter：无法初始化到 gdmgreeter 的管道

source: No servers were defined in the configuration file and XDMCP was disabled. This can only be a configuration error. So I have started a single server for you. You should log in and fix the configuration. Note that automatic and timed logins are disabled now.
vi: Không thấy server nào trong tập tin cấu hình mà XDMCP lại bị tắt. Chỉ có thể do lỗi cấu hình. Vì thế nên sẽ khởi động một server đơn cho bạn. Bạn nên đăng nhập và sửa lại cấu hình. Chú ý là tính năng đăng nhập tự động và timed login sẽ bị tắt.
zh_cn: 在配置文件中没有定义 服务器并且禁用了 XDMCP。 这只能是配置错误。所以 我已经为您启动了一个 服务器。您应当登录并 修正配置。请注意自动 和延迟登录目前已被禁用 了。

source: I could not start the regular X server (your graphical environment) and so this is a failsafe X server. You should log in and properly configure the X server.
vi: Không thể khởu động X server bình thường vì thế đây là failsafe X server. Bạn nên đăng nhập và cấu hình lại X server.
zh_cn: 我无法启动普通 X 服务器 (您的图形环境) 因而这是 个 failsafe X 服务器。 您应该登录并正确地配置 X 服务器。

source: The specified display number was busy, so this server was started on display %s.
vi: Số hiệu display được yêu cầu đang bận, vì thế server được khởi động trên display %s.
zh_cn: 指定的显示编号正忙，所以该服务器是在显示 %s 上启动的。

source: gdm_slave_greeter: Cannot start greeter trying default: %s
vi: gdm_slave_greeter: Không thể khởi động trình chào hỏi. Thử dùng trình mặc định: %s
zh_cn: gdm_slave_greeter：无法启动欢迎程序，正在尝试默认值：%s

source: Cannot start the greeter program, you will not be able to log in. This display will be disabled. Try logging in by other means and editing the configuration file
vi: Không thể khởi động trình chào hỏi, bạn sẽ không thể đăng nhập. Display này sẽ bị tắt. Hãy thữ đăng nhập bằng cách khác và sửa lại tập tin cấu hình
zh_cn: 无法启动欢迎程序， 您将无法登录。 该显示将被禁用。 试图通过其它方式登录 并编辑配置文件

source: gdm_slave_greeter: Error starting greeter on display %s
ta: gdm_slave_greeter: greeter %s ¾¢¨ÃÂ¢ø ¦¾¡¼íÌõ§À¡Ğ À¢¨Æ
zh_cn: gdm_slave_greeter：在显示 %s 上启动欢迎程序出错

source: gdm_slave_greeter: Can't fork gdmgreeter process
zh_cn: gdm_slave_greeter：无法创建 gdmgreeter 进程

source: %s: Can't open fifo!
vi: %s: Không thể mở fifo!
zh_cn: %s：无法打开 fifo！

source: gdm_slave_chooser: Can't init pipe to gdmchooser
vi: gdm_slave_chooser: Không thể khởi động ống dẫn tới gdmchooser
zh_cn: gdm_slave_chooser：无法初始化到 gdmchooser 的管道

source: Cannot start the chooser program, you will not be able to log in. Please contact the system administrator.
vi: Không thể khởi động trình chọn lựa, bạn sẽ không thể đăng nhập được. Vui lòng liên hệ system administrator.
zh_cn: 无法打开选择程序， 您将无法登录。 请联系系统管理员。

source: gdm_slave_chooser: Error starting chooser on display %s
vi: gdm_slave_chooser: Lỗi khi khởi động trình chọn lựa trên display %s
zh_cn: gdm_slave_chooser：在显示 %s 中启动选择器出错

source: gdm_slave_chooser: Can't fork gdmchooser process
vi: gdm_slave_chooser: Không thể nhân đôi tiến trình gdmchooser
zh_cn: gdm_slave_chooser：无法创建 gdmchooser 进程

source: %s: Could not setup environment for %s. Aborting.
vi: %s: Không thể thiết lập biến môi trường cho %s. Dừng.
zh_cn: %s：无法为 %s 设置环境。中止。

source: gdm_slave_session_start: Could not become %s. Aborting.
ta: gdm_slave_session_start: %s ¬¸ ÓÊÂÅ¢ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.
vi: gdm_slave_session_start: Không thể trở thành %s. Dừng.
zh_cn: gdm_slave_session_start：无法成为 %s。中止。

source: gdm_slave_session_start: gnome-session not found for a failsafe gnome session, trying xterm
vi: gdm_slave_session_start: Không tìm thấy gnome-session để thực hiện failsafe gnome session, thử dùng xterm
zh_cn: gdm_slave_session_start：无法为 gnome-session 找到 failsafe gnome session，尝试 xterm

source: Could not find the GNOME installation, will try running the "Failsafe xterm" session.
vi: Không thể tìm thấy bản cài đặt GNOME, sẽ thử thực hiện "Failsafe xterm" session.
zh_cn: 无法找到 GNOME 的安装， 将尝试运行“Failsafe xterm” 会话。

source: This is the Failsafe Gnome session. You will be logged into the 'Default' session of Gnome with no startup scripts run. This is only to fix problems in your installation.
vi: Đây là Failsafe Gnome Session. Bạn đã đăng nhập vào session 'Mặc định' của Gnome và không có script khởi động. Chế độ này chỉ được dùng để sửa lỗi trong bản cài đặt của bạn.
zh_cn: 这是 Failsafe Gnome 会话。 您将登录到没有启动脚本的 “默认”Gnome 会话。这 仅仅是用于修正您安装中的 问题的。

source: Cannot find "xterm" to start a failsafe session.
vi: Không thể tìm thấy "xterm" để khởi động failsafe session.
zh_cn: 无法找到“xterm”以启动一个 failsafe 会话。

source: This is the Failsafe xterm session. You will be logged into a terminal console so that you may fix your system if you cannot log in any other way. To exit the terminal emulator, type 'exit' and an enter into the window.
vi: Đây là Failsafe xterm session. Bạn đã đăng nhập vào terminal console để có thể sửa lỗi trên hệ thống của bạn khi bạn không còn có thể đăng nhập theo cách khác. Để thoát khỏi bộ giả lập terminal này, hãy gõ 'exit' và nhấn enter để vào cửa sổ.
zh_cn: 这是 Failsafe xterm 会话。 您将登录到终端控制台以便 在您无法以其它方式登录的 情况下修正您的系统。为了 退出终端模拟器，把“exit” 和回车输入到终端窗口即可。

source: Running %s for %s on %s
vi: Đang chạy %s cho %s trên %s
zh_cn: 在 %3$s 上为 %2$s 运行 %1$s

source: gdm_slave_session_start: User not allowed to log in
vi: gdm_slave_session_start: Người dùng không được quyền đăng nhập
zh_cn: gdm_slave_session_start：不允许用户登录

source: The system administrator has disabled your account.
vi: System adminitrator đã vô hiệu hóa account này.
zh_cn: 系统管理员已 禁用您的帐号。

source: gdm_slave_session_start: Could not find/run session `%s'
vi: gdm_slave_session_start: Không thể tìm/thực hiện session `%s'
zh_cn: gdm_slave_session_start：无法找到/运行会话“%s”

source: Cannot start the session, most likely the session does not exist. Please select from the list of available sessions in the login dialog window.
vi: Không thể khởi động session, hầu hết session không tồn tại. Vui lòng chọn từ danh sách các session còn dùng được trong hộp thoại đăng nhập.
zh_cn: 无法启动会话，最可能的 原因是会话不存在。请从 登录对话框窗口列表中 选择可用的会话。

source: gdm_slave_session_start: Could not start session `%s'
ta: gdm_slave_session_start: `%s' «Á÷× ¦¾¡¼í¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_slave_session_start: Không thể khởi động session `%s'
zh_cn: gdm_slave_session_start：无法启动会话“%s”

source: Cannot start your shell. It could be that the system administrator has disabled your login. It could also indicate an error with your account.
vi: Không thể khởi động shell. Có lẽ system administrator đã vô hiệu hóa quá trình đăng nhập của bạn. Ngoài ra nó chỉ ra rằng có lỗi trong account của bạn.
zh_cn: 无法启动您的 shell。可能是 系统管理员已经禁止您登录。 也可能是您的帐号含有错误。

source: gdm_slave_session_start: User passed auth but getpwnam(%s) failed!
vi: gdm_slave_session_start: Người dùng đã chuyển auth nhưng getpwnam(%s) thất bại!
zh_cn: gdm_slave_session_start：用户通过了认证但 getpwnam(%s) 失败！

source: Your home directory is listed as: '%s' but it does not appear to exist. Do you want to log in with the root directory as your home directory? It is unlikely anything will work unless you use a failsafe session.
vi: Thư mục nhà của bạn là: '%s' nhưng nó không tồn tại. Bạn có muốn đăng nhập với thư mục root là thư mục nhà của bạn? Có lẽ sẽ không hoạt động được trừ khi bạn đang dùng failsafe session.
zh_cn: 您的家目录为： “%s” 但它好像不存在。 您是否希望将根目录 作为您的家目录登录？ 除非您以 failsafe 会话登录， 看起来并不是所有东西都能工作。

source: %s: Home directory for %s: '%s' does not exist!
vi: %s: Thư mục nhà của %s: '%s' không tồn tại!
zh_cn: %s：%s 的家目录不存在：“%s”不存在！

source: gdm_slave_session_start: Authentication completed. Whacking greeter
vi: gdm_slave_session_start: Quá trình xác nhận hoàn tất. Whacking greeter
zh_cn: gdm_slave_session_start：验证完成。执行欢迎程序

source: gdm_slave_session_start: Execution of PreSession script returned > 0. Aborting.
vi: gdm_slave_session_start: Sự thực hiện script PreSession trả về giả trị > 0.
zh_cn: gdm_slave_session_start：执行会话前脚本的返回值大于 0。中止。

source: gdm_slave_session_start: Error forking user session
ta: gdm_slave_session_start: ÀÂÉ÷ «Á÷× fork ¦ºöÔõ§À¡Ğ À¢¨Æ
vi: gdm_slave_session_start: Lỗi khi nhân đôi session người dùng
zh_cn: gdm_slave_session_start：创建用户会话出错

source: Ping to %s failed, whacking display!
vi: Ping tới %s thất bại, whacking display!
zh_cn: Ping %s 失败，启动显示！

source: gdm_slave_xioerror_handler: Fatal X error - Restarting %s
vi: gdm_slave_xioerror_handler: Lỗi X nghiêm trọng. Khởi động lại %s
zh_cn: gdm_slave_xioerror_handler：致命的 X 错误 - 正在重新开始 %s

source: gdm_slave_exec_script: Failed starting: %s
ta: gdm_slave_exec_script: ¦¾¡¼íÌõ§À¡Ğ À¢¨Æ: %s
vi: gdm_slae_exec_script: Lỗi khi khởi động: %s
zh_cn: gdm_slave_exec_script：启动失败：%s

source: gdm_slave_exec_script: Can't fork script process!
vi: gdm_slave_exec_script: Không thể nhân đôi tiến trình script!
zh_cn: gdm_slave_exec_script：无法创建脚本进程！

source: gdm_parse_enriched_login: Failed creating pipe
vi: gdm_parse_enriched_login: Lỗi tạo ống dẫn
zh_cn: gdm_parse_enriched_login：创建管道失败

source: gdm_parse_enriched_login: Failed executing: %s
vi: gdm_parse_enriched_login: Lỗi thực thi: %s
zh_cn: gdm_parse_enriched_login：执行失败：%s

source: gdm_parse_enriched_login: Can't fork script process!
vi: gdm_parse_enriched_login: Không thể nhân đôi tiến trình script!
zh_cn: gdm_parse_enriched_login：无法创建脚本进程！

source: Please enter your username
vi: Nhập tên người dùng của bạn
zh_cn: 请输入您的用户名

source: Username:
vi: Tên người dùng:
zh_cn: 用户名：

source: Password:
vi: Mật khẩu:
zh_cn: 口令：

source: Couldn't authenticate user
vi: Không thể xác nhận người dùng
zh_cn: 无法认证用户

source: Incorrect username or password. Letters must be typed in the correct case. Please be sure the Caps Lock key is not enabled
vi: Tên người dùng sai hoặc mật khẩu sai. Các ký tự phải được gõ chính xác, phân biệt chữ hoa,thường. Hãy chắc chắn rằng phím Caps Lock không được bật.
zh_cn: 用户名或口令不正确。字母必须以正确的大小写输入。请确认 Caps Lock 将没有开启

source: Root login disallowed on display '%s'
ta: ¾¢¨Ã '%s' ­ø Root Ñ¨ÆÂ «ÛÁ¾¢ ¸¢¨¼Â¡Ğ
vi: Không được quyền đăng nhập root trên display '%s'
zh_cn: 显示“%s”禁止根用户登录

source: The system administrator is not allowed to login from this screen
vi: System administrator không được phép đăng nhập vào màn hình này
zh_cn: 不允许从该屏幕登录系统管理员

source: User %s not allowed to log in
vi: Người dùng %s không được phép đăng nhập
zh_cn: 不允许用户 %s 登录

source: The system administrator has disabled your account.
vi: System administrator đã vô hiệu hóa account của bạ.
zh_cn: 系统管理员已经禁用您的帐号。

source: Cannot set user group for %s
vi: Không thể thiết lập nhóm người dùng cho %s
zh_cn: 无法为 %s 设置用户组

source: Cannot set your user group, you will not be able to log in, please contact your system administrator.
vi: Không thể thiết lập nhóm người dùng của bạn, bạn không thể đăng nhập, vui lòng liên hệ system administrator.
zh_cn: 无法设置您的用户组，您将无法登录，请联系您的系统管理员。

source: Cannot get passwd structure for %s
vi: Không thể lấy cấu trúc passwd cho %s
zh_cn: 无法为 %s 获取 passwd 结构

source: Cannot setup pam handle with null login and/or display
vi: Không thể cài đặt bộ xử lý PAM với đăng nhập rỗng và/hoặc display
zh_cn: 无法以 null 登录和/或 null 显示设置 pam 句柄

source: Can't find /etc/pam.d/%s!
vi: Không thể tìm thấy /etc/pam.d/%s!
zh_cn: 无法找到 /etc/pam.d/%s！

source: Can't set PAM_TTY=%s
ta: PAM_TTY «¨Áì¸ ÓÊÂÅ¢ø¨Ä=%s
vi: Không thể gán PAM_TTY=%s
zh_cn: 无法设置 PAM_TTY=%s

source: Can't set PAM_RUSER=%s
vi: Không thể gán PAM_RUSER=%s
zh_cn: 无法设置 PAM_RUSER=%s

source: Can't set PAM_RHOST=%s
vi: Không thể gán PAM_RHOST=%s
zh_cn: 无法设置 PAM_RHOST=%s

source: The system administrator is not allowed to login from this screen
vi: System administrator không được phép đăng nhập vào màn hình này
zh_cn: 不允许从该屏幕登录系统管理员

source: Authentication token change failed for user %s
vi: Quá trình xác nhận thay đổi token thất bại cho người dùng %s
zh_cn: 用户 %s 的认证标记修改失败

source: The change of the authentication token failed. Please try again later or contact the system administrator.
vi: Sự thay đổi của xác nhận token thất bại. Vui lòng thử lại hoặc liên hệ system administrator.
zh_cn: 修改认证标记失败。请今后再试或与系统管理员联系。

source: User %s no longer permitted to access the system
vi: Người dùng %s không còn được phép truy cập hệ thống
zh_cn: 用户 %s 不再被允许访问系统

source: User %s not permitted to gain access at this time
vi: Người dùng %s không được phép truy cập vào lúc này
zh_cn: 此时不允许用户 %s 获得访问权

source: The system administrator has disabled access to the system temporary.
vi: System administrator đã vô hiệu hóa truy cập hệ thống tạm thời
zh_cn: 系统管理员已经暂时地收回了您对系统的访问权。

source: Couldn't set acct. mgmt for %s
vi: Không thể thiết lập acct. mgmt cho %s
zh_cn: 无法设置 %s 的帐号管理

source: Couldn't set credentials for %s
vi: Không thể thiết lập giấy ủy nhiệm cho %s
zh_cn: 无法为 %s 设置证书

source: Couldn't open session for %s
ta: %s ìÌ «Á÷× ¾¢Èì¸ ÓÊÂÅ¢ø¨Ä
vi: Không thể mở session cho %s
zh_cn: 无法为 %s 打开会话

source: Incorrect username or password. Letters must be typed in the correct case. Please make sure the Caps Lock key is not enabled.
vi: Sai tên người dùng hoặc mật khẩu. Các ký tự phải phân biệt chữ hoa, chữ thường. Vui lòng kiểm tra xem phím Caps Lock có bật hay không.
zh_cn: 用户名或口令不正确。字母的大小写必须正确。请确认没有开启 Caps Lock 键。

source: Authentication failed
vi: Quá trình xác nhận thất bại.
zh_cn: 认证失败

source: The system administrator has disabled your access to the system temporary.
vi: System administrator đã vô hiệu hóa tạm thời quyền truy cập hệ thống của bạn.
zh_cn: 系统管理员已暂时地禁止您对系统的访问。

source: Can't find PAM configuration for gdm.
vi: Không thể tìm thấy cấu hình PAM cho GDM.
zh_cn: 无法为 gdm 找到 PAM 配置。

source: gdm_xdmcp_init: Could not get server hostname: %s!
ta: gdm_xdmcp_init: §º¨ÅÂ¸ò¾¢ı ¦ÀÂ¨Ãô ¦ÀÈ ÓÊÂÅ¢ø¨Ä: %s!
vi: gdm_xdmcp_init: Không thể lấy tên máy chủ server: %s!
zh_cn: gdm_xdmcp_init：无法找到服务主机名：%s！

source: gdm_xdmcp_init: Could not create socket!
ta: gdm_xdmcp_init: Ğ¨Ç À¨¼ì¸ ÓÊÂÅ¢ø¨Ä!
vi: gdm_xdmcp_init: Không thể tạo socket!
zh_cn: gdm_xdmcp_init：无法创建套接字！

source: gdm_xdmcp_init: Could not bind to XDMCP socket!
ta: gdm_xdmcp_init: XDMCP Ğ¨Ç×¼ı §º÷òĞì¦¸¡øÄ ÓÊÂÅ¢ø¨Ä!
vi: gdm_xdmcp_init: Không thể nối với XDMCP socket!
zh_cn: gdm_xdmcp_init：无法绑定 XDMCP 套接字！

source: gdm_xdmcp_decode: Could not create XDMCP buffer!
ta: gdm_xdmcp_decode: XDMCP ¾¡í¸¸õ À¨¼ì¸ ÓÊÂÅ¢ø¨Ä!
vi: gdm_xdmcp_decode: Không thể tạo vùng đệm XDMCP!
zh_cn: gdm_xdmcp_decode：无法创建 XDMCP 缓冲区！

source: gdm_xdmcp_decode: Could not read XDMCP header!
ta: gdm_xdmcp_decode: XDMCP ¾¨ÄôÒ ÀÌ¾¢¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä!
vi: gdm_xdmcp_decode: Không thể đọc header XDMCP!
zh_cn: gdm_xdmcp_decode：无法读取 XDMCP 头信息！

source: gdm_xdmcp_decode: Incorrect XDMCP version!
ta: gdm_xdmcp_decode: À¢¨ÆÂ¡É XDMCP À¾¢ôÒ!
vi: gdm_xdmcp_decode: Sai version XDMCP!
zh_cn: gdm_xdmcp_decode：XDMCP 版本错误！

source: gdm_xdmcp_decode_packet: Unknown opcode from host %s
vi: gdm_xdmcp_decode_packet: Mã lạ từ máy chủ %s
zh_cn: gdm_xdmcp_decode_packet：未知操作码来自主机 %s

source: gdm_xdmcp_handle_query: Could not extract authlist from packet
ta: gdm_xdmcp_handle_query: ¦À¡ğ¼Äò¾¢Ä¢ÕóĞ authlist ¦ÀÈ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_query: Không thể trích lấy authlist từ gói tin
zh_cn: gdm_xdmcp_handle_query：无法从包中分解出认证表

source: gdm_xdmcp_handle_query: Error in checksum
ta: gdm_xdmcp_handle_query: ÜğÎò¦¾¡¨¸Â¢ø À¢¨Æ
vi: gdm_xdmcp_handle_query: Lỗi checksum
zh_cn: gdm_xdmcp_handle_query：校验和错误

source: gdm_xdmcp_handle_forward_query: Could not read display address
ta: gdm_xdmcp_handle_forward_query: ¸¡ğº¢ Ó¸ÅÃ¢¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_forward_query: Không thể đọc địa chỉ display
zh_cn: gdm_xdmcp_handle_forward_query：无法读取显示地址

source: gdm_xdmcp_handle_forward_query: Could not read display port number
ta: gdm_xdmcp_handle_forward_query: ¸¡ğº¢ Ğ¨È ±ñ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_forward_query: Không thể trích lấy authlist từ gói tin
zh_cn: gdm_xdmcp_handle_forward_query：无法读取显示端口号

source: gdm_xdmcp_handle_forward_query: Could not extract authlist from packet
ta: gdm_xdmcp_handle_forward_query: ¦À¡ğ¼Äò¾¢Ä¢ÕóĞ authlist ¦ÀÈ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_forward_query: Không thể trích authlist từ gói tin
zh_cn: gdm_xdmcp_handle_forward_query：无法从包中分解出认证表

source: gdm_xdmcp_handle_forward_query: Error in checksum
ta: gdm_xdmcp_handle_forward_query: ÜğÎò¦¾¡¨¸Â¢ø À¢¨Æ
vi: gdm_xdmcp_handle_forward_query: Lỗi checksum
zh_cn: gdm_xdmcp_handle_forward_query：校验和错误

source: gdm_xdmcp_handle_forward_query: Bad address
vi: gdm_xdmcp_handle_forward_query: Địa chỉ sai
zh_cn: gdm_xdmcp_handle_forward_query：错误的地址

source: Denied XDMCP query from host %s
ta: Å¢Õó§¾¡õÀ¸õ %s ­ÕóĞ Å¢É¡×ìÌ «ÛÁ¾¢ ¸¢¨¼Â¡Ğ
vi: Truy vấn XDMCP bị từ chối từ máy chủ %s
zh_cn: 从主机 %s 获得禁止的 XDMCP 请求

source: gdm_xdmcp_handle_request: Got REQUEST from banned host %s
vi: gdm_xdmcp_handle_request: Nhận được REQUEST từ máy chủ bị cấm %s
zh_cn: gdm_xdmcp_handle_request：从禁止的主机获得 REQUEST %s

source: gdm_xdmcp_handle_request: Could not read Display Number
ta: gdm_xdmcp_handle_request: ¸¡ğº¢ ±ñ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc Số hiệu Display
zh_cn: gdm_xdmcp_handle_request：无法读取显示编号

source: gdm_xdmcp_handle_request: Could not read Connection Type
ta: gdm_xdmcp_handle_request: ¦¾¡ÎôÒ Å¨¸¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc kiểu client
zh_cn: gdm_xdmcp_handle_request：无法获取连接类型

source: gdm_xdmcp_handle_request: Could not read Client Address
ta: gdm_xdmcp_handle_request: §º¨ÅôÀÂÉÃ¢ı Ó¸ÅÃ¢¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc địa chỉ Client
zh_cn: gdm_xdmcp_handle_request：无法获取客户机地址

source: gdm_xdmcp_handle_request: Could not read Authentication Names
ta: gdm_xdmcp_handle_request: ¿¢ÕÀ¢ò¾ø ¦ÀÂ÷¸¨Ç Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc Tên quá trình xác nhận
zh_cn: gdm_xdmcp_handle_request：无法读取认证名

source: gdm_xdmcp_handle_request: Could not read Authentication Data
ta: gdm_xdmcp_handle_request: ¿¢ÕÀ¢ò¾ø ¾¢¸¾¢¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc dữ liệu quá trình xác nhận
zh_cn: gdm_xdmcp_handle_request：无法读取认证数据

source: gdm_xdmcp_handle_request: Could not read Authorization List
ta: gdm_xdmcp_handle_request: ¿¢ÕÀ¢ò¾ø ÀğÊ¨Â Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc Authentication List
zh_cn: gdm_xdmcp_handle_request：无法读取认证表

source: gdm_xdmcp_handle_request: Could not read Manufacturer ID
ta: gdm_xdmcp_handle_request: ¯üÀò¾¢Â¡Ç÷ «¨¼Â¡Çò¨¾ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_request: Không thể đọc mã ID của nhà sản xuất
zh_cn: gdm_xdmcp_handle_request：无法读取厂商ID

source: gdm_xdmcp_handle_request: Failed checksum from %s
ta: gdm_xdmcp_handle_request: %s ­Ä¢ÕóĞ Åó¾ ÜğÎò¦¾¡¨¸ ¦¿¡ÊôÀ¨¼ó¾Ğ
vi: gdm_xdmcp_handle_request: Lỗi checksum của %s
zh_cn: gdm_xdmcp_handle_request：%s 校验和校验失败

source: gdm_xdmcp_handle_manage: Got Manage from banned host %s
vi: gdm_xdmcp_handle_manage: Nhận được Manage từ máy chủ bị cấm %s
zh_cn: gdm_xdmcp_handle_manage：从禁止的主机 %s 获得 Manage

source: gdm_xdmcp_handle_manage: Could not read Session ID
ta: gdm_xdmcp_handle_manage: «Á÷× «¨¼Â¡Çò¨¾ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_manage: Không thể đọc mã ID của session
zh_cn: gdm_xdmcp_handle_manage：无法获取会话 ID

source: gdm_xdmcp_handle_manage: Could not read Display Number
ta: gdm_xdmcp_handle_manage: ¸¡ğº¢ «¨¼Â¡Ç ±ñ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_manage: Không thể đọc Số hiệu Display
zh_cn: gdm_xdmcp_handle_manage：无法获取显示编号

source: gdm_xdmcp_handle_manage: Could not read Display Class
vi: gdm_xdmcp_handle_manage: Không thể đọc Display Class
zh_cn: gdm_xdmcp_handle_manage：无法读取显示类

source: %s: Could not read address
vi: %s: Không thể đọc địa chỉ
zh_cn: %s：无法读取地址

source: gdm_xdmcp_handle_keepalive: Got KEEPALIVE from banned host %s
vi: gdm_xdmcp_handle_keepalive: Nhận được KEEPALIVE từ máy chủ bị cấm %s
zh_cn: gdm_xdmcp_handle_keepalive：从禁止的主机获得 KEEPALIVE %s

source: gdm_xdmcp_handle_keepalive: Could not read Display Number
ta: gdm_xdmcp_handle_keepalive: ¸¡ğº¢ «¨¼Â¡Ç ±ñ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_keepalive: Không thể đọc Số hiệu Display
zh_cn: gdm_xdmcp_handle_keepalive：无法获取显示编号

source: gdm_xdmcp_handle_keepalive: Could not read Session ID
ta: gdm_xdmcp_handle_keepalive: «Á÷× «¨¼Â¡Ç ±ñ Å¡º¢ì¸ ÓÊÂÅ¢ø¨Ä
vi: gdm_xdmcp_handle_keepalive: Không thể đọc mã ID của session
zh_cn: gdm_xdmcp_handle_keepalive：无法获取会话 ID

source: gdm_xdmcp_init: No XDMCP support
vi: gdm_xdmcp_init: Không hỗ trợ XDMCP
zh_cn: gdm_xdmcp_init：不支持 XDMCP

source: gdm_xdmcp_run: No XDMCP support
vi: gdm_xdmcp_run: Không hỗ trợ XDMCP
zh_cn: gdm_xdmcp_run：不支持 XDMCP

source: gdm_xdmcp_close: No XDMCP support
vi: gdm_xdmcp_close: Không hỗ trợ XDMCP
zh_cn: gdm_xdmcp_close：不支持 XDMCP

source: Please wait: scanning local network for XDMCP-enabled hosts...
vi: Vui lòng chờ: đang quét mạng nội bộ để tìm các máy chủ có bật XDMCP...
zh_cn: 请等待：正在本地网络扫描启动 XDMCP 支持的主机...

source: No serving hosts were found.
vi: Không tìm thấy máy chủ dịch vụ.
zh_cn: 找不到正在服务的主机。

source: Choose a host to connect to from the selection below.
vi: Hãy chọn một máy chủ để nối từ những lựa chọn dưới đây.
zh_cn: 从下列主机中选择一个主机以便连接。

source: gdm_chooser_parse_config: No configuration file: %s. Aborting.
ta: gdm_chooser_parse_config: %s «¨ÁÅÊÅ §¸¡ôÒ ­ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.
vi: gdm_chooser_parse_config: Không có tập tin cấu hình: %s. Dừng.
zh_cn: gdm_chooser_parse_config：缺少配置文件：%s。中止。

source: Can't open default host icon: %s
ta: Å¢Õó§¾¡õÀ¸ò¾¢ı ¦¸¡¼¡¿¢¨Ä ÌÚõÀ¼ò¨¾ ¾¢Èì¸ ÓÊÂÅ¢ø¨Ä: %s
vi: Không thể mở biểu tượng máy chủ mặc định: %s
zh_cn: 无法打开默认主机图标：%s

source: Cannot find the glade interface description file, cannot run gdmchooser. Please check your installation and the location of the gdmchooser.glade2 file.
zh_cn: 无法找到 glade 界面描述 文件，无法运行 gdmchooser。 请检查您的安装和 gdmchooser.glade2 文件的位置。

source: The glade interface description file appears to be corrupted. Please check your installation.
zh_cn: glade 界面描述 文件似乎已崩溃。 请检查您的安装。

source: gdm_signals_init: Error setting up HUP signal handler
ta: gdm_signals_init: HUP ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: gdm_signals_init: Lỗi khi thiết lập bộ xử lý tín hiệu HUP
zh_cn: gdm_signals_init：设置 HUP 信号处理器出错

source: gdm_signals_init: Error setting up INT signal handler
ta: gdm_signals_init: INT ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: gdm_signals_init: Lỗi khi thiết lập bộ xử lý tín hiệu INT
zh_cn: gdm_signals_init：设置 INT 信号处理器出错

source: gdm_signals_init: Error setting up TERM signal handler
ta: gdm_signals_init: TERM ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: gdm_signals_init: Lỗi khi thiết lập bộ xử lý tín hiệu TERM
zh_cn: gdm_signals_init：设置 TERM 信号处理器出错

source: Could not set signal mask!
ta: ÌÈ¢ôÒ-ãÊ¨Â «¨Áì¸ ÓÊÂÅ¢ø¨Ä!
vi: Không thể thiết lập mặt nạ tín hiệu!
zh_cn: 无法设置信号屏蔽！

source: Socket for xdm communication
vi: Socket cho liên lạc xdm
zh_cn: 进行 xdm 通讯的套接字

source: Client address to return in response to xdm
vi: Địa chỉ client để trả lời XDM
zh_cn: 响应 xdm 时返回的客户端地址

source: ADDRESS
vi: ĐỊA CHỈ
zh_cn: 地址

source: Connection type to return in response to xdm
vi: Loại kết nối để trả lời XDM
zh_cn: 响应 xdm 时返回的连接类型

source: TYPE
vi: KIỂU
zh_cn: 类型

source: The chooser version (%s) does not match the daemon version (%s). You have probably just upgraded gdm. Please restart the gdm daemon or reboot the computer.
vi: Phiên bản bộ chọn lựa (%s) không khớp với phiên bản daemon (%s). Bạn nên nâng cấp GDM. Vui lòng khởi động lại GDM daemon hoặc khởi động lại máy.
zh_cn: 选择程序版本 (%s) 与 daemon 版本 (%s) 不匹配。 您可能刚刚升级 gdm。 请重启 gdm daemon 或重新启动计算机。

source: GDM Host Chooser
zh_cn: GDM 主机选择程序

source: Open a session to the selected host
vi: Mở một session tới máy chủ được chọn
zh_cn: 打开一个到选定主机的会话

source: Connect
ta: ¦¾¡ÎôÀ¢Î
zh_cn: 连接

source: Probe the network
vi: Thăm dò mạng
zh_cn: 探测网络

source: Rescan
ta: ÁÚÅÕÎ
zh_cn: 刷新

source: How to use this application
vi: Dùng ứng dụng này thế nào
zh_cn: 如何使用该应用程序

source: Help
zh_cn: 求助

source: Exit the application
vi: Thoát khỏi ứng dụng
zh_cn: 退出应用程序

source: Quit
vi: Thoát
zh_cn: 退出

source: Most recently queried hosts
zh_cn: 最近查询的主机
