Repository: Rbcafe/CVER
Catalog: CVE/YEAR/2010/CVE-2010-2387/Source/gdm/po/*.po
Languages: ta, vi, zh_cn

source: I cannot start the X server (your graphical interface). It is likely that it is not set up correctly. You will need to log in on a console and rerun the X configuration program. Then restart GDM.
vi: Không thể khởi động X server (giao diện đồ họa). Có lẽ các thông số không đúng. Bạn cần đăng nhập trong console và thực hiện trình cấu hình X Window. Sau đó khởi động lại GDM.
zh_cn: 我无法启动 X 服务器 (您的图形界面)。好像是由于没有正确地设置它。您需要从控制台登录并重新运行 X 配置程序。而后重新启动 GDM。

source: Would you like me to try to run the X configuration program? Note that you will need the root password for this.
vi: Bạn có muốn thử thực hiện trình cấu hình X Window? Chú ý là bạn sẽ cần mật khẩu root để thực hiện điều này.
zh_cn: 您是否希望我尝试运行 X 配置程序？请注意为此您需要根用户口令。

source: Please type in the root (privileged user) password.
vi: Vui lòng nhập mật khẩu root (người dùng ưu tiên).
zh_cn: 请输入根用户 (特权用户) 口令。

source: I will now try to restart the X server again.
vi: Sẽ thử khởi động lại X server.
zh_cn: 我将再次试图重新启动 X 服务器。

source: I will disable this X server for now. Restart GDM when it is configured correctly.
vi: Sẽ tắt X Server ngay bây giờ. Hãy khởi động GDM khi đã cấu hình xong.
zh_cn: 我将立刻禁用 X 服务器。当它被正确地配置了的时候重新启动 GDM。

source: I cannot start the X server (your graphical interface). It is likely that it is not set up correctly. Would you like to view the X server output to diagnose the problem?
vi: Không thể khởi động X server. Có lẽ các thông số cấu hình không đúng. Bạn có muốn xem các thông tin do X server cung cấp để giải quyết vấn đề?
zh_cn: 我无法启动 X 服务器 (您的图形界面)。好像是因为没有正确地设置它。您是否希望查看 X 服务器的输出以检查问题？

source: I cannot start the X server (your graphical interface). It seems that the pointer device (your mouse) is not set up correctly. Would you like to view the X server output to diagnose the problem?
vi: Không thể khởi động X server. Có lẽ thiết bị trỏ (con chuột) không được cấu hình đúng. Bạn có muốn xem các thông tin X server cung cấp để giải quyết vấn đề?
zh_cn: 我无法启动 X 服务器 (您的图形界面)。好像是因为没有正确地设置指针设备 (您的鼠标)。您是否希望查看 X 服务器的输出以便检查问题？

source: Would you like me to try to run the mouse configuration program? Note that you will need the root password for this.
vi: Bạn có muốn thử thực hiện trình cấu hình chuột? Chú ý rằng bạn sẽ cần mật khẩu root để thực hiện điều này.
zh_cn: 您是否希望我运行鼠标配置程序？请注意为此您需要根用户口令。

source: %s: Could not make new cookie file in %s
vi: %s: Không thể tạo tập tin cookie mới trong %s
zh_cn: %s：无法在 %s 中创建新 cookie 文件

source: gdm_auth_user_add: Could not open cookie file %s
vi: gdm_auth_user_add: Không thể mở tập tin cookie %s
zh_cn: gdm_auth_user_add：无法打开 cookie 文件 %s

source: gdm_auth_user_add: Could not lock cookie file %s
vi: gdm_auth_user_add: Không thể khóa tập tin cookie %s
zh_cn: gdm_auth_user_add：无法锁定 cookie 文件 %s

source: gdm_auth_user_remove: Ignoring suspiciously looking cookie file %s
vi: gdm_auth_user_remove: Bỏ qua tập tin cookie đáng ngờ %s
zh_cn: gdm_auth_user_remove：忽略可疑 cookie 文件 %s

source: Failed to start the display server several times in a short time period; disabling display %s
vi: Lỗi khi khởi động display server nhiều lần trong một khoảng thời gian ngắn; tắt display %s
zh_cn: 在短时间内启动显示服务器多次失败；禁用显示 %s

source: gdm_display_manage: Failed forking gdm slave process for %s
vi: gdm_display_manage: Lỗi khi tạo tiến trình gdm con cho %s
zh_cn: gdm_display_manage：为 %s 创建 gdm 子进程失败

source: gdm_error_box: Cannot fork to display error/info box
vi: gdm_error_box: Không thể tạo tiến trình để hiển thị lỗi/ hộp thoại thông tin
zh_cn: gdm_error_box：无法创建子进程以显示错误/信息对话框

source: gdm_failsafe_question: Cannot fork to display error/info box
vi: gdm_failsafe_question: Không thể tạo tiến trình để hiển thị lỗi/hộp thoại thông tin
zh_cn: gdm_failsafe_question：无法创建子进程以显示错误/信息对话框

source: %s: Directory %s does not exist.
ta: %s: «¨¼× %s ¸¢¨¼Â¡Ğ.
vi: %s: Thư mục %s không tồn tại.
zh_cn: %s：目录 %s 不存在。

source: %s: %s is not owned by uid %d.
ta: %s: %s ­ı ¦º¡ı¾ì¸¡Ã÷ uid %d «øÄ.
vi: %1$s: Người dùng có uid %3$d không sở hữu %2$s.
zh_cn: %s：%s 不属于 uid %d。

source: %s: %s is writable by group.
ta: %s: %s ¦¾¡Ì¾¢Â¡ø ±Ø¾ìÜÊÂĞ.
vi: %s: %s cho phép nhóm có quyền ghi.
zh_cn: %s：%s 对同组用户可写。

source: %s: %s is writable by other.
ta: %s: %s ÁüÈ¨ÅÂ¡ø ±Ø¾ìÜÊÂĞ.
vi: %s: %s cho phép những người khác có quyền ghi.
zh_cn: %s：%s 对其他用户可写。

source: %s: %s does not exist but must exist.
vi: %s: %s không tồn tại nhưng lẽ ra phải tồn tại.
zh_cn: %s：%s 必须存在但它不存在。

source: %s: %s is not a regular file.
ta: %s: %s º¡¾¡Ã½Á¡É §¸¡ôÒ «øÄ.
vi: %s: %s không phải là file bình thường.
zh_cn: %s：%s 不是一个普通文件。

source: %s: %s is writable by group/other.
ta: %s: %s ¦¾¡Ì¾¢Â¡ø/ÁüÈ¨ÅÂ¡ø ±Ø¾ìÜÊÂĞ.
vi: %s: %s cho phép nhóm/những người khác có quyền ghi.
zh_cn: %s：%s 对同组用户和其它用户可写。

source: %s: %s is bigger than sysadmin specified maximum file size.
vi: %s: %s lớn hơn kích thước tối đa sysadmin cho phép.
zh_cn: %s：%s 超过系统管理员指定的最大文件尺寸。

source: gdm_config_parse: No configuration file: %s. Using defaults.
zh_cn: gdm_config_parse：无配置文件：%s。使用默认值。

source: gdm_config_parse: XDMCP was enabled while there is no XDMCP support, turning it off
zh_cn: gdm_config_parse：在不支持 XDMCP 的情况下启用了 XDMCP，关闭 XDMCP

source: gdm_config_parse: Root cannot be autologged in, turing off automatic login
zh_cn: gdm_config_parse：无法自动登录根用户，关闭自动登录

source: gdm_config_parse: Root cannot be autologged in, turing off timed login
zh_cn: gdm_config_parse：无法自动登录根用户，关闭 timed 登录

source: gdm_config_parse: TimedLoginDelay less then 5, so I will just use 5.
zh_cn: gdm_config_parse：TimedLoginDelay 小于 5，所以我就使用 5。

source: gdm_config_parse: No greeter specified.
ta: gdm_config_parse: greeter ÌÈ¢ôÀ¢¼Å¢ø¨Ä.
zh_cn: gdm_config_parse：未指定的欢迎程序。

source: No daemon/ServAuthDir specified in the configuration file
vi: Không tìm thấy thông số daemon/ServAuthDir trong tập tin cấu hình
zh_cn: 在配置文件中未指定 daemon/ServAuthDir

source: gdm_config_parse: No authdir specified.
ta: gdm_config_parse: authdir ÌÈ¢ôÀ¢¼Å¢ø¨Ä.
zh_cn: gdm_config_parse：未指定 authdir。

source: gdm_config_parse: No sessions directory specified.
ta: gdm_config_parse: «Á÷×¸û «¨¼× ÌÈ¢ôÀ¢¼Å¢ø¨Ä.
zh_cn: gdm_config_parse：未指定会话目录。

source: %s: Empty server command, using standard one.
vi: %s: Không có lệnh server. Dùng lệnh chuẩn.
zh_cn: %s：服务器命令为空，使用标准命令。

source: %s: Display number %d in use! I will use %d
vi: %s: Số hiệu display %d đang được dùng! Dùng số %d
zh_cn: %s：显示编号 %d 正在使用！我将使用 %d

source: gdm_config_parse: Invalid server line in config file. Ignoring!
ta: gdm_config_parse: config §¸¡ôÀ¢ø ¦ºøÖÀÊÂ¡¸¡¾ §º¨ÅÂ¸ ÅÃ¢¨º. ÒÈì¸½¢¸¢ÈĞ
zh_cn: gdm_config_parse：配置文件中出现非法服务器行。忽略！

source: %s: XDMCP disabled and no local servers defined. Adding /usr/bin/X11/X on :%d to allow configuration!
vi: %s: XDMCP đã tắt mà lại không tìm thấy server cục bộ nào. Thêm /usr/bin/X11/X vào :%d để cho phép cấu hình!
zh_cn: %s：XDMCP 已被禁用，而且未定义本地服务器。添加 /usr/bin/X11/X 为 :%d 以便进行配置！

source: XDMCP is disabled and gdm cannot find any local server to start. Aborting! Please correct the configuration %s and restart gdm.
vi: XDMCP đã tắt mà gdm lại không tìm thấy server cục bộ nào để khởi động. Ngừng hoạt động! Vui lòng xem lại cấu hình %s và khởi động lại gdm.
zh_cn: XDMCP 已被禁用，而且 gdm 无法找到要启动的任何本地服务器。中止！请更正配置 %s 并重新启动 gdm。

source: gdm_config_parse: XDMCP disabled and no local servers defined. Aborting!
ta: gdm_config_parse: XDMCP Ó¼Á¡¸¢ÂĞ ÁüÚõ ¯ûÇ¨Á §º¨ÅÂ¸í¸û Å¨ÃÂÚì¸Å¢ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ!
zh_cn: gdm_config_parse：已禁用 XDMCP，而且未定义本地服务器。中止！

source: gdm_config_parse: Can't find the gdm user (%s). Trying 'nobody'!
zh_cn: gdm_config_parse：无法找到 gdm 用户 (%s)。正在尝试“nobody”！

source: The gdm user does not exist. Please correct gdm configuration %s and restart gdm.
vi: Người dùng gdm không tồn tại. Vui lòng hiệu chỉnh cấu hình gdm %s và khởi động lại gdm.
zh_cn: gdm 用户不存在。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Can't find the gdm user (%s). Aborting!
ta: gdm_config_parse: gdm ÀÂÉ÷ (%s) ¸ñÎÀ¢Êì¸ÓÊÂÅ¢ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ!
zh_cn: gdm_config_parse：无法找到 gdm 用户 (%s)。中止！

source: The gdm user is set to be root, but this is not allowed since it can pose a security risk. Please correct gdm configuration %s and restart gdm.
vi: Người dùng gdm là root, nhưng root không được phép làm người dùng gdm để tránh rủi ro bảo mật. Vui lòng hiệu chỉnh cấu hình gdm %s và khởi động lại gdm.
zh_cn: gdm 用户被设置为根用户，但由于这会导致安全问题而是不允许的。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: The gdm user should not be root. Aborting!
ta: gdm_config_parse: gdm ÀÂÉ÷ 'root'¬¸ ­Õì¸ìÜ¼¡Ğ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ!
zh_cn: gdm_config_parse：gdm 用户不能为根用户。中止！

source: gdm_config_parse: Can't find the gdm group (%s). Trying 'nobody'!
zh_cn: gdm_config_parse：无法找到 gdm 组 (%s)。正在尝试“nobody”!

source: The gdm group does not exist. Please correct gdm configuration %s and restart gdm.
vi: Nhóm gdm không tồn tại. Vui lòng hiệu chỉnh cấu hình gdm %s và khởi động lại gdm.
zh_cn: gdm 组不存在。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Can't find the gdm group (%s). Aborting!
ta: gdm_config_parse: gdm ¦¾¡Ì¾¢ (%s) ¸ñÎÀ¢Êì¸ÓÊÂÅ¢ø¨Ä. ¦ÅÇ¢§ÂÚ¸¢ÈĞ!
zh_cn: gdm_config_parse：无法找到 gdm 组 (%s)。中止！

source: The gdm group is set to be root, but this is not allowed since it can pose a security risk. Please correct gdm configuration %s and restart gdm.
vi: Nhóm gdm là root, nhưng root không được phép là nhóm gdm để tránh rủi ro bảo mật. Vui lòng hiệu chỉnh cấu hình gdm %s và khởi động lại gdm.
zh_cn: gdm 组被设置为根，但由于这将导致安全问题而是不允许的。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: The gdm group should not be root. Aborting!
ta: gdm_config_parse: gdm ¦¾¡Ì¾¢ 'root'¬¸ ­Õì¸ìÜ¼¡Ğ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ!
zh_cn: gdm_config_parse：gdm 组不能为根。中止！

source: %s: Greeter not found or can't be executed by the gdm user
vi: %s: Không tìm thấy trình chào hỏi, hoặc người dùng gdm không thể thực hiện trình chào hỏi
zh_cn: %s：gdm 用户无法找到或无法执行欢迎程序

source: %s: Chooser not found or it can't be executed by the gdm user
vi: %s: Không tìm thấy bộ chọn lựa, hoặc người dùng gdm không thể thực hiện bộ chọn lựa
zh_cn: %s：gdm 用户无法找到或无法执行选择程序

source: Server Authorization directory (daemon/ServAuthDir) is set to %s but this does not exist. Please correct gdm configuration %s and restart gdm.
vi: Thư mục Server Authorization (xác nhận server - daemon/ServAuthDir) là %s nhưng nó không tồn tại. Vui lòng hiệu chỉnh cấu hình gdn %s và khởi động lại gdm.
zh_cn: 服务器认证目录 (daemon/ServAuthDir) 被设置为 %s 但它并不存在。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Authdir %s does not exist. Aborting.
ta: gdm_config_parse: Authdir %s ¸¢¨¼Â¡Ğ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.
zh_cn: gdm_config_parse：Authdir %s 不存在。中止。

source: Server Authorization directory (daemon/ServAuthDir) is set to %s but this is not a directory. Please correct gdm configuration %s and restart gdm.
vi: Thư mục Server Authorization (xác nhận server - daemon/ServAuthDir) là %s nhưng nó không phải là một thư mục. Vui lòng hiệu chỉnh cấu hình gdn %s và khởi động lại gdm.
zh_cn: 服务器认证目录 (daemon/ServAuthDir) 被设置为 %s 但它不是一个目录。请更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Authdir %s is not a directory. Aborting.
ta: gdm_config_parse: Authdir %s µ÷ «¨¼ÅøÄ. ¦ÅÇ¢§ÂÚ¸¢ÈĞ.
zh_cn: gdm_config_parse：Authdir %s 不是目录。中止。

source: Server Authorization directory (daemon/ServAuthDir) is set to %s but is not owned by user %s and group %s. Please correct the ownership or gdm configuration %s and restart gdm.
vi: Thư mục Server Authorization (xác nhận server - daemon/ServAuthDir) là %s nhưng không được sở hữu bởi người dùng %s và nhóm %s. Vui lòng hiệu chỉnh cấu hình gdn %s và khởi động lại gdm.
zh_cn: 服务器认证目录 (daemon/ServAuthDir) 被设置为 %s 但它并不属于用户 %s 和组 %s。请更正所有权或更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Authdir %s is not owned by user %s, group %s. Aborting.
zh_cn: gdm_config_parse：Authdir %s 不属于用户 %s，组 %s。中止。

source: Server Authorization directory (daemon/ServAuthDir) is set to %s but has the wrong permissions, it should have permissions of 0750. Please correct the permissions or the gdm configuration %s and restart gdm.
vi: Thư mục Server Authorization (xác nhận server - daemon/ServAuthDir) là %s nhưng quyền truy nhập của nó không đúng, quyền truy nhập nên là 0750. Vui lòng hiệu chỉnh cấu hình gdn %s và khởi động lại gdm.
zh_cn: 服务器认证目录 (daemon/ServAuthDir) 被设置为 %s 但权限不正确，它的权限应为 0750。请更正权限或更正 gdm 配置 %s 并重新启动 gdm。

source: gdm_config_parse: Authdir %s has wrong permissions %o. Should be 0750. Aborting.
zh_cn: gdm_config_parse：Authdir %s 的权限 %o 是错误的。应为 0750。中止。

source: gdm_daemonify: fork() failed!
ta: gdm_daemonify: fork() ¦¿¡ÊôÀ¨¼ó¾Ğ!
vi: gdm_deamonify: fork() không thành công!
zh_cn: gdm_daemonify：fork() 失败！

source: gdm_daemonify: setsid() failed: %s!
ta: gdm_daemonify: setsid() ¦¿¡ÊôÀ¨¼ó¾Ğ: %s!
vi: gdm_daemonify: setsid() không thành công: %s!
zh_cn: gdm_daemonify：setsid() 失败：%s！

source: deal_with_x_crashes: Trying failsafe X server %s
vi: deal_with_x_crashes: Thử dùng failsafe X server %s
zh_cn: deal_with_x_crashes：正在尝试 failsafe X 服务器 %s

source: deal_with_x_crashes: Running the XKeepsCrashing script
vi: deal_with_x_crashes: Đang chạy script XKeepsCrashing
zh_cn: deal_with_x_crashes：正在运行 XKeepsCrashing 脚本

source: I cannot start the X server (your graphical interface). It is likely that it is not set up correctly. You will need to log in on a console and rerun the X configuration program. Then restart GDM.
vi: Không thể khởi động X server. Có lẽ thông số cấu hình sai. Bạn nên đăng nhập vào console và thực hiện trình cấu hình X Window. Sau đó khởi động lại GDM.
zh_cn: 我无法启动 X 服务器 (您的图形界面)。这大概是由于没有正确地设置它。您需要从控制台登录并重新运行 X 的配置程序。而后重新启动 GDM。

source: Failed to start X server several times in a short time period; disabling display %s
vi: Lỗi khi khởi động X server vài lần trong khoảng thời gian ngắn; tắt display %s
zh_cn: 在短时间内多次启动 X 服务器失败；禁用显示 %s

source: gdm_child_action: Reboot or Halt request when there is no system menu from display %s
vi: gdm_child_action: Nhận yêu cầu Reboot (khởi động máy) hoặc Halt (ngắt) từ display %s khi không có hệ thống menu nào
zh_cn: gdm_child_action：在没有系统菜单时收到来自显示 %s 的重启或关机请求

source: gdm_child_action: Restart, Reboot or Halt request from a non-local display %s
vi: gdm_child_action: Nhận yêu cầu Restart (khởi động lại), Reboot (khởi động máy) hoặc Halt (ngắt) từ display từ xa %s
zh_cn: gdm_child_action：从非本地显示 %s 发出的重新开始、重新起动或关机请求

source: gdm_child_action: Aborting display %s
vi: gdm_child_action: Dừng hoạt động display %s
zh_cn: gdm_child_action：中止显示 %s

source: gdm_child_action: Master rebooting...
vi: gdm_child_action: Đang khởi động máy...
zh_cn: gdm_child_action：Master 正在重新启动...

source: gdm_child_action: Reboot failed: %s
vi: gdm_child_action: Khởi động máy thất bại: %s
zh_cn: gdm_child_action：重启动失败：%s

source: gdm_child_action: Master halting...
vi: gdm_child_action: Chuẩn bị ngừng hoạt động...
zh_cn: gdm_child_action：Master 正在关机...

source: gdm_child_action: Halt failed: %s
vi: gdm_child_action: Quá trình ngừng hoạt động thất bại: %s
zh_cn: gdm_child_action：关闭失败：%s

source: gdm_child_action: Master suspending...
vi: gdm_child_action: Chuẩn bị đình chỉ hoạt động...
zh_cn: gdm_child_action：Master 正在挂起...

source: gdm_child_action: Suspend failed: %s
vi: gdm_child_actin: Quá trình đình chỉ hoạt động thất bại: %s
zh_cn: gdm_child_action：挂起失败：%s

source: Gdm restarting ...
vi: Đang khởi động lại GDM...
zh_cn: 正在重新启动 Gdm ...

source: Failed to restart self
vi: Lỗi khi khởi động lại
zh_cn: 重新启动自身失败

source: Do not fork into the background
vi: Không thể chuyển qua chế độ nền
zh_cn: 无法在后台创建子进程

source: Preserve LD_* variables
vi: Bảo toàn các biến LD_*
zh_cn: 保留 LD_* 变量

source: Only root wants to run gdm
vi: Chỉ có root có thể chạy gdm
zh_cn: 只有根用户需要运行 gdm

source: gdm already running. Aborting!
ta: gdm ²ü¦¸É§Å ­ÂíÌ¸¢ÈĞ. ¦ÅÇ¢§ÂÕ¸¢ÈĞ!
vi: GDM đã chạy rồi. Dừng!
zh_cn: gdm 已经运行。中止！

source: %s: Error setting up TERM signal handler
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu TERM
zh_cn: %s：设置 TERM 信号处理器出错

source: %s: Error setting up INT signal handler
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu INT
zh_cn: %s：设置 INT 信号处理器出错

source: %s: Error setting up HUP signal handler
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu HUP
zh_cn: %s：设置 HUP 信号处理器出错

source: %s: Error setting up USR1 signal handler
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu USR1
zh_cn: %s：设置 HUP 信号处理器出错

source: %s: Error setting up CHLD signal handler
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu CHLD
zh_cn: %s：设置 CHLD 信号处理器出错

source: Flexible server request denied: Not authenticated
vi: Yêu cầu flexible server bị từ chối: Không thể xác nhận
zh_cn: 便捷服务器请求被否决：未通过认证

source: Unknown server type requested, using standard server.
vi: Yêu cầu kiểu server lạ, dùng server chuẩn.
zh_cn: 请求未知的服务器类型，使用标准服务器。

source: Requested server %s not allowed to be used for flexible servers, using standard server.
vi: Server được yêu cầu %s không thể được dùng như là flexible server, dùng server chuẩn.
zh_cn: 请求的服务器 %s 不能被用于便捷服务器，使用标准服务器。

source: %s: Could not make socket
vi: %s: Không thể tạo socket
zh_cn: %s：无法创建套接字

source: %s: Could not bind socket
vi: %s: Không thể bind socket
zh_cn: %s：无法绑定套接字

source: %s: Could not make FIFO
vi: %s: Không thể tạo FIFO
zh_cn: %s：无法创建 FIFO

source: %s: Could not open FIFO
vi: %s: Không thể mở FIFO
zh_cn: %s：无法打开 FIFO

source: y = Yes or n = No? >
vi: y = Đúng hoặc n = Sai? >
zh_cn: y = 是 或 n = 否？>

source: %s: Cannot get local addresses!
vi: %s: Không thể lấy địa chỉ cục bộ!
zh_cn: %s：无法获取本地地址！

source: %s: Could not get server hostname: %s!
vi: %s: Không thể lấy tên máy chủ server: %s!
zh_cn: %s：无法找到服务主机名：%s！

source: %s: Could not get address from hostname!
vi: %s: Không thể lấy địa chỉ từ tên máy chủ!
zh_cn: %s：无法从主机名得到地址！

source: Could not setgid %d. Aborting.
vi: Không thể setgid %d. Dừng.
zh_cn: 无法调用 setgid %d。中止。

source: initgroups() failed for %s. Aborting.
vi: initgroups() thất bại bởi %s. Dừng.
zh_cn: initgroups() 执行 %s 失败。中止。

source: There already appears to be an X server running on display %s. Should I try another display number? If you answer no, I will attempt to start the server on %s again.%s
vi: Đã có một X server đang chạy trên display %s. Nên thử một số hiệu display khác? Nếu không thì sẽ khởi động server trên %s một lần nữa. %s
zh_cn: 好像已经有一个 X 服务器运行在显示 %s 上。我是否该尝试其它显示编号？如果您回答否，我就再次尝试在 %s 上启动服务器。%s

source: (You can change consoles by pressing Ctrl-Alt plus a function key, such as Ctrl-Alt-F7 to go to console 7. X servers usually run on consoles 7 and higher.)
vi: (Bạn có thể chuyển qua console bằng cách nhấn tổ hợp phím Ctrl-Alt kèm theo một phím chức năng, ví dụ Ctrl-Alt-F7 sẽ chuyển sang console 7. X server thường chạy trên console 7 hoặc cao hơn.)
zh_cn: (您可以通过按 Ctrl-Alt 和一个功能键来切换到控制台，例如 Ctrl-Alt-F7 将切换到控制台 7。X 服务器通常运行在 7 号或更高号码的控制台上。)

source: Display '%s' cannot be opened by Xnest
vi: Xnest không thể mở display '%s'
zh_cn: Xnest 无法打开显示“%s”

source: Display %s is busy. There is another X server running already.
vi: Display %s đang bận. Có một X server khác đang chạy.
zh_cn: 显示 %s 正忙。已有另外一个 X 服务器运行于其上。

source: %s: Error opening a pipe: %s
vi: %s: Lỗi khi mở ống dẫn: %s
zh_cn: %s：打开管道错误：%s

source: %s: Error setting up USR1 signal handler: %s
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu USR1: %s
zh_cn: %s：设置 USR1 信号处理器出错：%s

source: %s: Error setting up CHLD signal handler: %s
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu CHLD: %s
zh_cn: %s：设置 CHLD 信号处理器出错：%s

source: %s: Error setting up ALRM signal handler: %s
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu ALRM: %s
zh_cn: %s：设置 ALRM 信号处理器出错：%s

source: %s: Cannot find a free display number
vi: %s: Không thể tìm thấy một số hiệu display có thể dùng.
zh_cn: %s：无法找到空闲的显示编号

source: %s: Display %s busy. Trying another display number.
vi: %s: Display %s đang bận. Đang thử một số hiệu display khác.
zh_cn: %s：显示 %s 正忙。正在尝试其它显示编号。

source: gdm_server_spawn: Could not open logfile for display %s!
vi: gdm_server_spawn: Không thể mở logfile cho display %s!
zh_cn: gdm_server_spawn：无法为显示 %s 开打日志文件！

source: gdm_server_spawn: Error setting USR1 to SIG_IGN
ta: gdm_server_spawn: USR1, SIG_IGNìÌ «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: gdm_server_spawn: Lỗi thiết lập USR1 thành SIG_IGN
zh_cn: gdm_server_spawn：将 USR1 设置成 SIG_IGN 时出错

source: gdm_server_spawn: Error setting TTIN to SIG_IGN
vi: gdm_server_spawn: Lỗi thiết lập TTIN thành SIG_IGN
zh_cn: gdm_server_spawn：将 TTIN 设置到 SIG_IGN 时出错

source: gdm_server_spawn: Error setting TTOU to SIG_IGN
vi: gdm_server_spawn: Lỗi thiết lập TTOU thành SIG_IGN
zh_cn: gdm_server_spawn：将 TTOU 设置成 SIG_IGN 时出错

source: gdm_server_spawn: Error setting HUP to SIG_DFL
vi: gdm_server_spawn: Lỗi thiết lập HUP thành SIG_IGN
zh_cn: gdm_server_spawn：将 HUP 设置成 SIG_DFL 时出错

source: gdm_server_spawn: Error setting TERM to SIG_DFL
vi: gdm_server_spawn: Lỗi thiết lập TERM thành SIG_IGN
zh_cn: gdm_server_spawn：将 TERM 设置成 SIG_DFL 时出错

source: Invalid server command '%s'
vi: Lệnh server '%s' không hợp lệ
zh_cn: 非法服务器命令“%s”

source: Server name '%s' not found, using standard server
vi: Không tìm thấy server tên '%s', dùng server mặc định
zh_cn: 找不到服务器名“%s”，使用标准服务器

source: %s: Empty server command for display %s
vi: %s: Không có lệnh server cho display %s
zh_cn: %s：显示 %s 的空服务器命令

source: %s: Server was to be spawned by uid %d but that user doesn't exist
vi: %s: Server được thực hiện bởi người dùng có uid %d nhưng người dùng này không tồn tại
zh_cn: %s：服务器是由 uid %d 启动的但那个用户不存在

source: %s: Couldn't set groupid to %d
vi: %s: Không thể thiết lập groupid thành %d
zh_cn: %s：无法将组 ID 设置为 %d

source: %s: initgroups() failed for %s
vi: %s: initgroups() thất bại bởi %s
zh_cn: %s：initgroups() 执行 %s 失败

source: %s: Couldn't set userid to %d
vi: %s: Không thể thiết lập userid thành %d
zh_cn: %s：无法将用户 ID 设置为 %d

source: %s: Couldn't set groupid to 0
vi: %s: Không thể thiết lập groupid bằng 0
zh_cn: %s：无法将组 ID 设置为 0

source: gdm_server_spawn: Xserver not found: %s
vi: gdm_server_spawn: Không tìm thấy Xserver: %s
zh_cn: gdm_server_spawn：无法找到 Xserver：%s

source: gdm_server_spawn: Can't fork Xserver process!
vi: gdm_server_spawn: Không thể nhân đôi tiến trình Xserver
zh_cn: gdm_server_spawn：无法创建 Xserver 进程！

source: %s: Error setting up TERM/INT signal handler: %s
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu TERM/INT: %s
zh_cn: %s：设置 TERM/INT 信号处理器出错：%s

source: %s: Error setting up USR2 signal handler: %s
vi: %s: Lỗi khi thiết lập trình xử lý tín hiệu USR2: %s
zh_cn: %s：设置 USR2 信号处理器出错：%s

source: I could not start the X server (your graphical environment) due to some internal error. Please contact your system administrator or check your syslog to diagnose. In the meantime this display will be disabled. Please restart gdm when the problem is corrected.
vi: Không thể khởi động X server do nguyên nhân bên trong. Vui lòng liên hệ system administrator của bạn hoặc kiểm tra syslog để chẩn đoán lỗi. Bây giờ display này sẽ bị tắt. Vui lòng khởi động lại gdm khi đã giải quyết xong vấn đề.
zh_cn: 由于一些内部错误无法 启动 X 服务器 (您的 图形界面)。请与您的 系统管理员联系或检查 您的 syslog 以便进行 诊断。此时该显示将被 禁用。请在问题更正 以后重新启动 gdm。

source: focus_first_x_window: cannot fork
vi: focus_firset_x_window: không thể nhân đôi tiến trình
zh_cn: focus_first_x_window：无法创建子进程

source: focus_first_x_window: cannot open display %s
vi: focus_first_x_window: không thể mở display %s
zh_cn: focus_first_x_window：无法打开显示 %s

source: Could not execute the configuration program. Make sure it's path is set correctly in the configuration file. I will attempt to start it from the default location.
vi: Không thể thực hiện trình cấu hình. Hãy bảo đảm rằng đường dẫn trong tập tin cấu hình vẫn đúng. Sẽ thử khởi động với đường dẫn mặc định.
zh_cn: 无法执行配置程序。 请确认在配置文件 中正确地设置了它 的路径。我将试图 从默认位置启动它。

source: Could not execute the configuration program. Make sure it's path is set correctly in the configuration file.
vi: Không thể thực hiện trình cấu hình. Hãy bảo đảm là đường dẫn trong tập tin cấu hình vẫn đúng.
zh_cn: 无法执行配置程序。请 确认在配置文件中为它 设置了正确的路径。

source: Enter the root password to run the configuration.
vi: Nhập mật khẩu root để chạy trình cấu hình.
zh_cn: 输入根用户口令 以便进行配置。
