Repository: Rbcafe/CVER
Catalog: CVE/YEAR/2010/CVE-2010-2387/Source/gdm/po/*.po
Languages: ta, vi, zh_cn

source: Maximum displays per single host. You can use this to prevent attacks by hogging all the possible displays. Does not apply to local connections.
vi: Số display tối đa trên mỗi máy chủ. Bạn có thể tránh bị tấn công bằng cách giảm số display có thể dùng. Không áp dụng cho các kết nối nội bộ.
zh_cn: 单个主机可接受的最大显示数。您可以用此选项防止夺取所有可能显示的攻击。不要应用于本地连接。

source: Displays per host:
vi: Số display trên một máy chủ:
zh_cn: 主机最大显示数：

source: Servers
vi: Server
zh_cn: 服务器

source: Name
vi: Tên
zh_cn: 名称

source: Command
vi: Lệnh
zh_cn: 命令

source: Flexible
zh_cn: 便捷

source: Add server
vi: Thêm server
zh_cn: 添加服务器

source: Edit server
vi: Hiệu chỉnh server
zh_cn: 编辑服务器

source: Delete server
vi: Xóa server
zh_cn: 删除服务器

source: Set as default
vi: Dùng như mặc định
zh_cn: 设为默认

source: Static Servers (servers to always run)
vi: Server tĩnh (luôn chạy)
zh_cn: 静态服务器 (服务器总在运行)

source: No.
vi: Không.
zh_cn: 编号

source: Server
zh_cn: 服务器

source: Extra arguments
vi: Thông số bổ sung
zh_cn: 额外参数

source: Instead of reinitializing running servers when a user logs out. Always kill and then start the server again.
vi: Thay vì tái khởi tạo thông số các server đang chạy khi người dùng thoát. Luôn luôn kết thúc server, sau đó chạy lại.
zh_cn: 当用户注消时不是重新初始化运行中的服务器，而总是杀死服务器而后再重新启动服务器。

source: Always restart X servers
vi: Luôn khởi động lại X server
zh_cn: 总是启动 X 服务器

source: Miscellaneous
vi: Linh tinh
zh_cn: 杂项

source: Xnest server:
vi: Server Xnest:
zh_cn: Xnest 服务器：

source: Maximum number of flexible servers:
vi: Số flexible server tối đa:
zh_cn: 便捷服务器的最大数量：

source: The Xnest server. This is a server that can run inside another server, used for the flexible nested login.
vi: Server Xnest. Đây là server có thể chay trong một server khác, được dùng trong các quá trình đăng nhập lồng nhau.
zh_cn: Xnest 服务器。这是一个可以运行在其它服务器内的服务器，用于嵌套的便捷登录。

source: Standard X server:
vi: X server chuẩn:
zh_cn: 标准 X 服务器：

source: This is the standard X server to run when we are not told otherwise.
vi: X server chuẩn cần chạy khi không còn cách nào khác.
zh_cn: 这是在没有其它要求时运行的标准 X 服务器。

source: Script to run when X is crashing:
vi: Script cần chạy khi X Window đổ vỡ:
zh_cn: 当 X 崩溃时运行的脚本：

source: A script to run when the X server keeps crashing and the failsafe X server is either empty or also didn't take. This will run an X setup program defined below.
vi: Script được chạy khi X server đổ vỡ và không có failsafe X server, hoặc không thể chạy failsafe X server. Script này sẽ chạy chương trình cấu hình X Window được định nghĩa bên dưới
zh_cn: 当 X 服务器总是崩溃并且 failsafe X 服务器为空或无法得到时运行的脚本。这将运行下面定义的 X 设置程序。

source: Failsafe X server:
zh_cn: Failsafe X 服务器：

source: An X server binary to run if the standard one keeps crashing. If this fails the script below will be run.
vi: X server được dùng khi server chuẩn đổ vỡ. Nếu X server này không chạy, script dưới đây sẽ được dùng.
zh_cn: 如果标准 X 服务器总是崩溃时运行的 X 服务器可执行文件。如果该服务器失败，就将运行下面的脚本。

source: X-server setup
vi: Trình cấu hình X server
zh_cn: X-服务器设置

source: Session configuration
vi: Cấu hình session
zh_cn: 会话配置

source: Session directory:
vi: Thư mục session:
zh_cn: 会话目录：

source: Select a directory to be used for system-wide session scripts
vi: Chọn một thư mục được dùng để lưu các session script cấp hệ thống
zh_cn: 选择一个用于系统范围会话脚本的目录

source: Available Sessions
vi: Session sẵn sàng
zh_cn: 可用的会话

source: Show the Gnome Chooser session, if a session named 'Gnome' is present
vi: Hiện session Gnome Chooser, nếu session tên là Gnome tồn tại
zh_cn: 如果名为 “Gnome” 的会话存在，则显示 Gnome 选择程序会话

source: Gnome Chooser
vi: Trình chọn lựa
zh_cn: Gnome 选择程序

source: Show the Gnome failsafe session
vi: Hiện Gnome failsafe session
zh_cn: 显示 Gnome failsafe 会话

source: Show the Xterm failsafe session
vi: Hiện Xterm failsafe session
zh_cn: 显示 Xterm failsafe 会话

source: Add session
vi: Thêm session
zh_cn: 添加会话

source: Remove session
vi: Loại bỏ session
zh_cn: 删除会话

source: Selected session name:
vi: Session được chọn:
zh_cn: 选定的会话名：

source: The exact script details of a session will appear here when you select one from the list on the left.
vi: Chi tiết về script của session sẽ được ghi vào đây khi bạn chọn từ danh sách bên trái.
zh_cn: 当您从左侧的列表选择 会话时将在这里显示 确切的脚本细节。

source: Login sessions
vi: Session đăng nhập
zh_cn: 登录会话

source: Appearance
vi: Diện mạo
zh_cn: 外观

source: Directory for host images:
vi: Thư mục chứa ảnh máy chủ:
zh_cn: 主机图像目录：

source: Default host image:
vi: Ảnh máy chủ mặc định:
zh_cn: 默认主机图像：

source: Refresh
vi: Cập nhật
zh_cn: 刷新

source: Scan every 'x' seconds:
vi: Quét mỗi 'x' giây:
zh_cn: 每隔“x”秒进行扫描：

source: Hosts
vi: Máy chủ
zh_cn: 主机

source: Send a query to the local network and list all servers that respond
vi: Gởi truy vấn tới mạng cục bộ và lấy danh sách tất cả server sẵn sàng
zh_cn: 向本地网络发送一个查询并列出所有应答的服务器

source: Broadcast query
vi: Truy vấn toàn mạng
zh_cn: 广播查询

source: Hosts to list:
zh_cn: 列出的主机：

source: Comma separated list of hostnames to list in the chooser (in addition to the broadcast above)
vi: Danh sách tên máy chủ cách nhau bởi dấu chấm phẩy trong trình chọn lựa (cộng thêm với broadcast ở trên)
zh_cn: 逗号分隔的在选择程序中列出的主机名列表 (除了上面广播的以外)

source: Chooser
vi: Trình chọn lựa
zh_cn: 选择程序

source: Debugging
zh_cn: 正在调试

source: Enable debugging output to be printed into the syslog. Useful for tracking down problems. But not so useful for normal usage as it can fill up your logs very quickly.
vi: Đầu ra debug sẽ được ghi vào syslog. Hữu dùng để tìm lỗi. Nhưng không hữu dụng đối với người dùng bình thường vì nó ghi đầy trong log rất mau.
zh_cn: 启用调试输出，将调试输出打印到 syslog 中。用于查找问题。但由于它会很快充满您的日志，因而对普通用途没用。

source: Enable debugging output
vi: Bật xuất thông tin debug
zh_cn: 启用调试输出

source: system_setup
zh_cn: 系统设置

source: Executables
zh_cn: 可执行程序

source: Chooser command:
vi: Lệnh của trình chọn lựa:
zh_cn: 选择程序命令：

source: Greeter command:
vi: Lệnh của trình chào hỏi:
zh_cn: 欢迎程序命令：

source: Halt command:
vi: Lệnh dừng máy:
zh_cn: 关机命令：

source: Reboot command:
vi: Lệnh khởi động máy:
zh_cn: 重新启动命令：

source: Configurator command:
vi: Lệnh cấu hình máy:
zh_cn: 配置程序命令：

source: Suspend command:
vi: Lệnh tạm ngưng hoạt động máy:
zh_cn: 挂起命令：

source: Directories
vi: Thư mục
zh_cn: 目录

source: PRE session scripts directory:
vi: Thư mục chứa PRE session script:
zh_cn: 会话前脚本目录：

source: POST session scripts directory:
vi: Thư mục chứa POST session script:
zh_cn: 会话后脚本目录：

source: Logging directory:
vi: Thư mục log:
zh_cn: 登录目录：

source: Display initialization directory:
vi: Thư mục khởi động:
zh_cn: 显示初始化目录：

source: PID file:
vi: Tập tin PID:
zh_cn: PID 文件：

source: Default GNOME session file:
vi: Tập tin session mặc định:
zh_cn: 默认 GNOME 会话文件：

source: Paths
vi: Đường dẫn
zh_cn: 路径

source: Default $PATH:
vi: $PATH mặc định:
zh_cn: 默认 $PATH：

source: Root $PATH:
vi: $PATH gốc:
zh_cn: 根用户 $PATH：

source: Localization
vi: Bản địa hóa
zh_cn: 本地化

source: Locale file:
vi: Tập tin Locale:
zh_cn: 区域设置文件：

source: Environment
vi: Môi trường
zh_cn: 环境

source: Configure the GNOME Display Manager. Please submit any bugs or feature requests at http://bugzilla.gnome.org under the `gdm' product.
vi: Cấu hình GDM. Vui lòng gửi bất cứ lỗi hay đề nghị nào tới http://bugzilla.gnome.org với product là `gdm'.
zh_cn: 配置 GNOME 显示管理器。 请把任何错误或功能需求提交到 http://bugzilla.gnome.org 的 “gdm”产品下。

source: label273
zh_cn: 标签273

source: Extra arguments:
vi: Thông số mở rộng:
zh_cn: 额外参数：

source: Custom command line:
vi: Thông số riêng:
zh_cn: 定制命令行：

source: Name:
vi: Tên:
zh_cn: 名称：

source: Command line:
vi: Dòng lệnh:
zh_cn: 命令行：

source: Allow as flexible server
vi: Dùng như flexible server
zh_cn: 允许作为便捷服务器使用

source: Make this the default server
vi: Chọn làm server mặc định
zh_cn: 使该服务器成为默认服务器

source: Choose server
vi: Chọn server
zh_cn: 选择服务器

source: Choose the X server to start
vi: Chọn server khởi động
zh_cn: 选择启动的 X 服务器

source: Send the specified protocol command to gdm
vi: Gửi lệnh giao thức xác định tới GDN
zh_cn: 将特定的协议命令发送到 gdm

source: COMMAND
vi: LỆNH
zh_cn: 命令

source: Xnest mode
vi: Chế độ Xnest
zh_cn: Xnest 模式

source: Do not lock current screen
vi: Không khóa màn hình hiện thời
zh_cn: 不要锁定当前屏幕

source: Debugging output
vi: Ngõ ra debug
zh_cn: 调试输出

source: Authenticate before running --command
vi: Xác nhận trước khi chạy --command
zh_cn: 在运行 --command 前进行认证

source: GDM is not running. Please ask your system administrator to start it.
vi: GDM chưa chạy. Vui lòng yêu cầu system administrator khởi động GDM.
zh_cn: GDM 未运行。 请要求您的系统管理员启动它。

source: Cannot communicate with gdm, perhaps you have an old version running.
vi: Không thể liên lạc với GDM, có lẽ bạn đang chạy một phiên bản cũ.
zh_cn: 无法于 gdm 通讯，可能您正在运行老版本的 gdm。

source: You do not seem to have authentication needed be for this operation. Perhaps your .Xauthority file is not set up correctly.
vi: Có lẽ không cần xác nhận để thực hiện thao tác này. Có lẽ tập tin .Xautority của bạn không được thiết lập đúng.
zh_cn: 您可能不具有该操作所必须的认证权限。可能您的 .Xauthority 文件的设置不正确。

source: You do not seem to be logged in on the console. Starting a new login only works correctly on the console.
vi: Hình như bạn chưa đăng nhập vào console. Các lần đăng nhập mới chỉ làm việc với console.
zh_cn: 您似乎不能从控制台登录。启动一个新的登录只能在控制台上正常工作。

source: Can't lock screen
vi: Không thể khóa màn hình
zh_cn: 无法锁定屏幕

source: Can't disable xscreensaver display hacks
zh_cn: 无法禁用 X 屏幕保护显示设置

source: The allowed limit of flexible X servers reached.
vi: Đã tiến tới giới hạn số flexible X server.
zh_cn: 已达到允许的便捷 X 服务器个数上限。

source: There were errors trying to start the X server.
vi: Xảy ra lỗi khi cố thử khởi động X server.
zh_cn: 试图启动 X 服务器时出错。

source: The X server failed. Perhaps it is not configured well.
vi: X server bị lỗu. Có lẽ do cấu hình sai.
zh_cn: X 服务器失败。可能没有配置好。

source: Too many X sessions running.
vi: Quá nhiều X session đang chạy.
zh_cn: 运行了过多的 X 会话。

source: The nested X server (Xnest) cannot connect to your current X server. You may be missing an X authorization file.
vi: X server con không thể kết nối với X server hiện thời. Có thể do thiếu tập tin xác nhận.
zh_cn: 嵌入 X 服务器 (Xnest) 无法连接到您当前的 X 服务器。您可能缺少 X 认证文件。

source: The nested X server (Xnest) is not available, or gdm is badly configured. Please install the Xnest package in order to use the nested login.
vi: X server con (Xnest) không sẵn sàng, hoặc gdm được cấu hình sai. Vui lòng cài đặt gói phần mềm Xnest để dùng đăng nhập lồng nhau.
zh_cn: 嵌入 X 服务器 (Xnest) 不可用，或者错误地配置了 gdm。 请安装 Xnest 包以便使用嵌套登录。

source: The X server is not available, it is likely that gdm is badly configured.
vi: X server không sẵn sàng, có thể do GDM được cấu hình sai.
zh_cn: X 服务器不可用，gdm 可能配置错误。

source: Unknown error occured.
vi: Xảy ra lỗi lạ.
zh_cn: 发生未知错误。

source: Log in as another user without loging out
vi: Đăng nhập với tên người dùng khác mà không cần thoát
zh_cn: 在没有注消时就作为其它用户登录

source: New login
vi: Đăng nhập lại
zh_cn: 新登录

source: Log in as another user inside a nested window
vi: Đăng nhập với tên người dùng khác trong một cửa sổ con
zh_cn: 在嵌套的窗口中以其它用户登录

source: New login in a nested window
vi: Đăng nhập lại trong cửa sổ lồng nhau
zh_cn: 嵌套窗口中的新登录

source: A-M|Azerbaijani
zh_cn: A-M|阿塞拜疆语

source: A-M|Basque
zh_cn: A-M|巴斯克语

source: A-M|Bulgarian
vi: A-M|Bungari
zh_cn: A-M|保加利亚语

source: A-M|Catalan
zh_cn: A-M|加泰罗尼亚语

source: A-M|Chinese (simplified)
vi: A-M|Trung Hoa (simplified)
zh_cn: A-M|中文 (简体)

source: A-M|Chinese (traditional)
vi: A-M|Trung Hoa (traditional)
zh_cn: A-M|中文 (繁体)

source: A-M|Croatian
vi: A-M|Croatia
zh_cn: A-M|克罗地亚语

source: A-M|Czech
vi: A-M|Séc
zh_cn: A-M|捷克语

source: A-M|Danish
vi: A-M|Đan Mạch
zh_cn: A-M|丹麦语

source: A-M|Dutch
vi: A-M|Hà Lan
zh_cn: A-M|荷兰语

source: A-M|English
vi: A-M|Anh
zh_cn: A-M|英语

source: A-M|Estonian
vi: A-M|Estonia
zh_cn: A-M|爱沙尼亚语

source: A-M|American English
vi: A-M|Anh (theo Mỹ)
zh_cn: A-M|美国英语

source: A-M|British English
vi: A-M|Anh (theo Anh Quốc)
zh_cn: A-M|英国英语

source: A-M|Finnish
vi: A-M|Phần Lan
zh_cn: A-M|芬兰语

source: A-M|French
vi: A-M|Pháp
zh_cn: A-M|法语

source: A-M|Galician
zh_cn: A-M|加利西亚语

source: A-M|German
vi: A-M|Đức
zh_cn: A-M|德语

source: A-M|Greek
vi: A-M|Hy Lạp
zh_cn: A-M|希腊语

source: A-M|Hebrew
vi: A-M|Do Thái
zh_cn: A-M|希伯来语

source: A-M|Hungarian
vi: A-M|Hungari
zh_cn: A-M|匈牙利语

source: A-M|Icelandic
zh_cn: A-M|冰岛语

source: A-M|Italian
vi: A-M|Ý
zh_cn: A-M|意大利语

source: A-M|Japanese
vi: A-M|Nhật
zh_cn: A-M|日语

source: A-M|Korean
vi: A-M|Hàn Quốc
zh_cn: A-M|韩语

source: A-M|Latvian
zh_cn: A-M|拉脱维亚语

source: A-M|Lithuanian
zh_cn: A-M|立陶宛语

source: N-Z|Norwegian (bokmal)
zh_cn: N-Z|挪威语 (博克马尔语)

source: N-Z|Norwegian (nynorsk)
zh_cn: N-Z|挪威语 (尼诺斯克语)

source: N-Z|Polish
vi: N-Z|Ba Lan
zh_cn: N-Z|波兰语

source: N-Z|Portuguese
vi: N-Z|Bồ Đào Nha
zh_cn: N-Z|葡萄牙语

source: N-Z|Brazilian Portuguese
zh_cn: N-Z|巴西葡萄牙语

source: N-Z|Romanian
vi: N-Z|Rumani
zh_cn: N-Z|罗马尼亚语

source: N-Z|Russian
vi: N-Z|Nga
zh_cn: N-Z|俄语

source: N-Z|Slovak
zh_cn: N-Z|斯洛伐克语

source: N-Z|Slovenian
vi: N-Z|Slovenia
zh_cn: N-Z|斯洛文尼亚语

source: N-Z|Spanish
vi: N-Z|Tây Ban Nha
zh_cn: N-Z|西班牙语

source: N-Z|Swedish
vi: N-Z|Thụy Điển
zh_cn: N-Z|瑞典语

source: N-Z|Turkish
vi: N-Z|Thổ Nhĩ Kỳ
zh_cn: N-Z|土耳其语

source: N-Z|Ukrainian
vi: N-Z|Ukraina
zh_cn: N-Z|乌克兰语

source: N-Z|Walloon
zh_cn: N-Z|瓦龙语

source: Other|POSIX/C English
vi: Khác| Tiếng Anh POSIX/C
zh_cn: 其它|POSIX/C 英语

source: AnotherLevel
vi: Mức khác
zh_cn: 其它级别

source: Default
vi: Mặc định
zh_cn: 默认

source: XSession
zh_cn: X 会话

source: Last
ta: ¸¨¼º¢
vi: Cuối cùng
zh_cn: 最后

source: User %s will login in %d seconds
vi: Người dùng %s sẽ đăng nhập trong vòng %d giây
zh_cn: 用户 %s 将在 %d 秒后登录

source: Doubleclick here to un-iconify the login window, so that you may log in.
vi: Nhấn đúp vào đây để mở cửa sổ đăng nhập, như thế bạn có thể đăng nhập.
zh_cn: 双击此处以便揭穿登录窗口的图标化，以便您能够登录。

source: %sWelcome to %s%s
vi: %sChào mừng đến %s%s
zh_cn: %s欢迎来到 %s%s

source: gdm_parse_enriched_string: String too long!
ta: gdm_parse_enriched_string: Á¢¸ ¿£ñ¼ ºÃõ!
vi: gdm_parse_enriched_string: Chuỗi quá dài!
zh_cn: gdm_parse_enriched_string：字符串太长！

source: Could not fork a new process! You likely won't be able to log in either.
vi: Không thể nhân đôi tiến trình! Bạn có lẽ không thể đăng nhập được.
zh_cn: 无法创建新进程！ 您恐怕还是无法登录。

source: Are you sure you want to reboot the machine?
ta: ¯ı¨ÁÂ¡¸ ­ó¾ ¦À¡È¢¨Â ÁÚÀÊÔõ ¦¾¡¼í¸ §ÅñÎÁ¡?
vi: Bạn có muốn khởi động máy?
zh_cn: 您确信您要重新启动计算机？

source: Are you sure you want to shut down the machine?
vi: Bạn có muốn tắt máy?
zh_cn: 您确信您要关闭计算机？

source: Are you sure you want to suspend the machine?
vi: Bạn có muốn tạm dừng máy?
zh_cn: 您确信您要挂起计算机？

source: gdm_login_parse_config: No configuration file: %s. Using defaults.
vi: gdm_login_parse_config: Không có tập tin cấu hình: %s. Dùng cấu hình mặc định.
zh_cn: gdm_login_parse_config：缺少配置文件：%s。使用默认值。

source: TimedLoginDelay was less then 5. I'll just use 5.
vi: TimedLoginDelay nhỏ hơn 5. Chỉnh lại bằng 5.
zh_cn: TimedLoginDelay 少于 5。我就使用 5。

source: Your preferred session type %s is not installed on this machine. Do you wish to make %s the default for future sessions?
vi: Kiểu session %s ưa thích của bạn không được cài đặt trên máy này. Bạn có muốn dùng %s như là kiểu session mặt định?
zh_cn: 您偏爱的会话类型 %s 在该机上没有安装。 是否希望使 %s 成为以后会话的默认设置？

source: You have chosen %s for this session, but your default setting is %s. Do you wish to make %s the default for future sessions?
vi: Bạn đã chọn %s cho session này, nhưng thông số mặc định là %s. Bạn có muốn dùng %s làm mặc định không?
zh_cn: 你已为该会话选择了 %s，但默认的设置为 %s。 是否希望使 %s 成为以后会话的默认设置？

source: You have chosen %s for this session. If you wish to make %s the default for future sessions, run the 'switchdesk' utility (System->Desktop Switching Tool from the panel menu).
vi: Bạn đã chọn %s cho session này. Nếu bạn có muốn dùng %s làm mặc định, chạy tiện ích 'switchdesk' (Hệ thống->Công cụ chuyển Desktop từ menu).
zh_cn: 您已为该会话选择了 %s。 如果您希望使 %s 成为未来会话的默认值， 请运行工具“switchdesk” (从面板菜单选取 系统->桌面切换工具)。

source: %s session selected
ta: %s «Á÷× ¦¾Ã¢× ¦ºöÂôÀğÎûÇĞ
vi: %s session được chọn
zh_cn: %s 会话选定

source: Log in using the session that you have used last time you logged in
vi: Đăng nhập dùng session mà bạn dùng trước đây
zh_cn: 使用您上次登录的会话登录

source: gdm_login_session_init: Session script directory not found!
vi: gdm_login_session_init: Không có thư mục session script!
zh_cn: gdm_login_session_init：无法找到会话脚本目录！

source: This session will log you directly into GNOME, into your current session.
vi: Session này sẽ đăng nhập trực tiếp vào GNOME, vào session hiện thời của bạn.
zh_cn: 该会话将把您直接登录到 GNOME，登录到您的当前会话中。

source: This session will log you into GNOME and it will let you choose which one of the GNOME sessions you want to use.
vi: Session này sẽ đăng nhập vào GNOME và cho phép chọn một trong các session của GNOME mà bạn muốn dùng
zh_cn: 该会话将把您登录到 GNOME 中，并且允许您选择一个您希望使用的 GNOME 会话。

source: Yaikes, nothing found in the session directory.
vi: Không có gì trong thư mục session.
zh_cn: 啊呀，在会话目录中什么也找不到。

source: This is a failsafe session that will log you into GNOME. No startup scripts will be read and it is only to be used when you can't log in otherwise. GNOME will use the 'Default' session.
vi: Đây là failsafe session bạn dùng để đăng nhập vào GNOME, không thực hiện các script khởi động. Chỉ được dùng khi bạn không thể đăng nhập bằng cách khác. GNOME sẽ dùng session 'Mặc định'
zh_cn: 这是个将您登录到 GNOME 的 failsafe 会话。不会读入启动脚本，而且只有在您无法以其它方式登录时才使用。GNOME将使用“默认”会话。

source: This is a failsafe session that will log you into a terminal. No startup scripts will be read and it is only to be used when you can't log in otherwise. To exit the terminal, type 'exit'.
vi: Đây là failsafe session được dùng để đăng nhập vào terminal. Không có script khởi động nào được thực hiện. Chỉ dùng session này khi bạn không thể đăng nhập bằng cách khác. Để thoát khỏi terminal, gõ 'exit'.
zh_cn: 这是个将您登录到终端的 failsafe 会话。不会读入启动脚本，并且只有在您无法以其它方式登录时才使用。为了退出终端，输入“exit”。

source: No default session link found. Using Failsafe GNOME.
vi: Không tìm thấy liên kết session mặc định. Dùng Failsafe GNOME.
zh_cn: 未找到默认会话连接。使用 Failsafe GNOME。

source: %s language selected
ta: %s ¦Á¡Æ¢ ¦¾Ã¢× ¦ºöÂôÀğÎûÇĞ
vi: Ngôn ngữ %s được chọn
zh_cn: %s 语言选定

source: Log in using the language that you have used last time you logged in
vi: Đăng nhập dùng ngôn ngữ mà bạn đã dùng trước đây
zh_cn: 使用您上次登录时使用的语言登录

source: Other
vi: Khác
zh_cn: 其它

source: Select GNOME session
vi: Chọn session
zh_cn: 选择 GNOME 会话

source: Create new session
vi: Tạo session
zh_cn: 创建新会话

source: Remember this setting
vi: Ghi nhớ thông số
zh_cn: 记住该设置

source: Please insert 25 cents to log in.
vi: Vui lòng bỏ 25 đồng để đăng nhập.
zh_cn: 请投币两毛五以便登录。

source: GNOME Desktop Manager
vi: Trình quản lý desktop GNOME (GDM)
zh_cn: GNOME 桌面管理器

source: Can't open icon file: %s. Suspending iconify feature!
ta: %s ÌÚõÀ¼ §¸¡ô¨À ¾¢Èì¸ ÓÊÂ¡Ğ. ÌÚõÀ¼Á¡ìÌ¾ø ¿¢Úò¾ôÀÎ¸¢ÈĞ!
vi: Không thể mở tập tin icon: %s. Ngừng tính năng thu nhỏ!
zh_cn: 无法打开图标文件：%s。暂时中止图标化功能！

source: Iconify the login window
vi: Thu nhỏ cửa sổ đăng nhập
zh_cn: 图标化登录窗口

source: %a %b %d, %H:%M
vi: %d %a %b, %H:%M
zh_cn: %b %d %a, %H:%M

source: %a %b %d, %I:%M %p
vi: %d %a %b, %I:%M %p
zh_cn: %b %d %a, %I:%M %p

source: GDM Login
vi: Đăng nhập
zh_cn: GDM 登录

source: Session
ta: «Á÷×
zh_cn: 会话

source: Language
ta: ¦Á¡Æ¢
vi: Ngôn ngữ
zh_cn: 语言

source: Configure...
vi: Cấu hình...
zh_cn: 配置...

source: Configure GDM (this login manager). This will require the root password.
vi: Cấu hình GDM. Sẽ phải cần mật khẩu root.
zh_cn: 配置 GDM (该登录管理器)。这将需要根用户口令。

source: Reboot...
ta: ÁÚ ¦¾¡¼í¸ø...
vi: Khởi động máy...
zh_cn: 重启...

source: Reboot your computer
vi: Khởi động máy
zh_cn: 重新启动您的计算机

source: Shut down...
vi: Tắt máy...
zh_cn: 关闭...

source: Shut down your computer so that you may turn it off.
vi: Tắt máy
zh_cn: 关闭您的计算机以便您可以切断电源。

source: Suspend...
vi: Tạm dừng máy...
zh_cn: 挂起...

source: Suspend your computer
vi: Tạm dừng máy
zh_cn: 挂起您的计算机

source: Disconnect
vi: Ngắt kết nối
zh_cn: 断开连接

source: Can't open DefaultImage: %s. Suspending face browser!
vi: Không thể mở DefaultImage: %s. Ngừng tính năng duyệt bộ mặt!
zh_cn: 无法打开默认图像：%s。暂时中止人像浏览器！

source: The greeter version (%s) does not match the daemon version. You have probably just upgraded gdm. Please restart the gdm daemon or reboot the computer.
vi: Phiên bản của trình chào hỏi (%s) không khớp với phiên bản daemon. Có lẽ bạn vừa nâng cấp GDM. Vui lòng khởi động lại daemon GDM hoặc khởi động lại máy.
zh_cn: 欢迎程序版本 (%s) 于 daemon 版本不匹配。 您可能刚刚升级 gdm。 请重新启动 gdm daemon 或重新启动计算机。

source: Reboot
vi: Khởi động máy
zh_cn: 重启

source: The greeter version (%s) does not match the daemon version (%s). You have probably just upgraded gdm. Please restart the gdm daemon or reboot the computer.
vi: Phiên bản trình chào hỏi (%s) không khớp với phiên bản daemon (%s). Có lẽ bạn cần nâng cấp gdm. Vui lòng khởi động lại daemon gdm hoặc khởi động lại máy tính.
zh_cn: 欢迎程序版本 (%s) 与 daemon 版本 (%s) 不匹配。 您可能刚刚升级 gdm。 请重新启动 gdm daemon 或重新启动计算机。

source: Restart
vi: Khởi động lại
zh_cn: 重新开始

source: main: Error setting up HUP signal handler
ta: main: HUP ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: main: Lỗi thiết lập trình xử lý tín hiệu HUP
zh_cn: main：设置 HUP 信号处理器出错

source: main: Error setting up INT signal handler
ta: main: INT ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: main: Lỗi thiết lập trình xử lý tín hiệu INT
zh_cn: main：设置 INT 信号处理器出错

source: main: Error setting up TERM signal handler
ta: main: TERM ÌÈ¢ôÒ ¨¸ôÀ¢ÊÂ¡Ç¨Ã «¨ÁìÌõ§À¡Ğ À¢¨Æ
vi: main: Lỗi thiết lập trình xử lý tín hiệu TERM
zh_cn: main：设置 TERM 信号处理器出错

source: main: Error setting up CHLD signal handler
vi: main: Lỗi thiết lập trình xử lý tín hiệu CHLD
zh_cn: main：设置 CHLD 信号处理器出错

source: Your session directory is missing or empty! There are two available sessions you can use, but you should log in and correct the gdm configuration.
vi: Thiếu thư mục session hoặc thư mục session rỗng Có hai session có thể dùng, nhưng bạn nên đăng nhập và sửa lại cấu hình GDM.
zh_cn: 您的会话目录不存在或为空！ 您现在可以使用两个会话， 但您应该登录并修正 gdm 配置。

source: The configuration file contains an invalid command line for the login dialog, and thus I ran the default command. Please fix your configuration.
vi: Tập tin cấu hình chứa lệnh cho hộp thoại đăng nhập sai, vậy nên sẽ chạy lệnh mặc định. Vui lòng sửa lại cấu hình.
zh_cn: 配置文件含有登录对话框的非法 命令行，因而我运行了默认命令。 请修正您的配置。

source: The configuration was not found. GDM is using defaults to run this session. You should log in and create a configuration file with the GDM configuration program.
vi: Không có cấu hình. GDM đang dùng cấu hình mặc định để chạy session này. Bạn nên đăng nhập và tạo tập tin cấu hình cho GDM.
zh_cn: 无法找到配置。GDM 正在使用 默认配置运行该会话。您应当 登录并使用 GDM 配置程序创建 配置文件。

source: The face browser is not configured, please ask your system administrator to enable it in the GDM configurator program.
vi: Trình duyệt bộ mặt không được cấu hình, vui lòng yêu cầu system administrator bật tính năng này trong trình cấu hình GDM.
zh_cn: 尚未配置头像浏览器， 请要求您的系统管理员在 GDM 配置程序中启用它。

source: Select a photo
vi: Chọn ảnh
zh_cn: 选择一张照片

source: Select a photograph to show in the facebrowser:
vi: Chọn ảnh để hiển thị trong trình duyệt bộ mặt:
zh_cn: 选择一张将显示在头像浏览器中的照片：

source: Browse
vi: Duyệt
zh_cn: 浏览

source: No picture selected.
vi: Chưa chọn.
zh_cn: 没有选择照片。

source: The picture is too large and the system administrator disallowed pictures larger then %d bytes to show in the face browser
vi: Ảnh quá lớn và system administrator không cho phép ảnh lớn hơn %d byte.
zh_cn: 该照片太大，而系统管理员不 允许在头像浏览器中显示大于 %d 个字节的照片

source: File %s cannot be open for reading Error: %s
vi: Không thể mở tập tin %s để đọc. Lỗi: %s
zh_cn: 无法按读打开文件 %s 错误：%s

source: File %s cannot be open for writing Error: %s
vi: Không thể mở tập tin %s để ghi Lỗi: %s
zh_cn: 无法按写打开文件 %s 错误：%s

source: Setup my GDM Face
zh_cn: 设定我的 GDM 头像
