Repository: Rbcafe/CVER
Catalog: CVE/YEAR/2010/CVE-2010-2387/Source/gdm/po/*.po
Languages: ta, vi, zh_cn

source: The main area of this application shows the hosts on the local network that have "XDMCP" enabled. This allows users to login remotely to other machines as if they were logged on using the console. You can rescan the network for new hosts by clicking 'rescan'. When you have selected a host click "Connect" to open a session to that machine.
zh_cn: 该应用程序的主窗口用于显示本地网络 中启用“XDMCP”的主机。它允许用户 远程登录到其它机器就好像他们是从 控制台登录一样。 您可以点击“重新扫描”重新扫描网络 以便找到新主机。当您选择了一个主机， 点击“连接”以打开到那个主机的会话。

source: Information
vi: Thông tin
zh_cn: 信息

source: Basic
vi: Cơ bản
zh_cn: 基本

source: Expert
vi: Chuyên gia
zh_cn: 专家

source: System
ta: «¨ÁôÒ
vi: Hệ thống
zh_cn: 系统

source: This panel displays the basic options for configuring GDM. If you need finer detail, select 'expert' or 'system setup' from the list above. This will display some of the more complex options of GDM that rarely need to be changed.
zh_cn: 该面板显示配置 GDM 的基本选项。 如果您需要更多细节，请从上面的列表中选择“专家”或“系统设置”。 这将显示一些很少需要变更的更复杂的 GDM 选项。

source: This panel displays the more advanced options of GDM. Be sure to take care when manipulating the security options, or you could be vulnerable to attackers. Choose "System" to change fundamental options in GDM.
vi: Khung này hiển thị nhiều tùy chọn nâng cao hơn. Hãy chắc chắn bạn rất cẩn thẩn khi thay đổi các tùy chọn liên quan đến bảo mật, nếu không bạn sẽ tạo ra các điểm yếu và dễ bị tấn công. Chọn "Hệ thống" để thay đổi các tùy chọn cơ bản của GDM.
zh_cn: 该面板显示 GDM 的高级选项。 在修改安全选项时请确实谨慎行事，否则您将很容易遭到攻击者的攻击。 选择“系统”以修改 GDM 的基本选项。

source: This panel displays GDM's fundamental system settings. You should only change these paths if you really know what you are doing, as an incorrect setup could stop your machine from booting properly. Choose "Basic" if you just want to change your machine's login appearance.
vi: Khung này hiển thị các thiết lập hệ thống cơ bản của GDM. Bạn chỉ có thể thay đổi những đường dẫn này nếu bạn thất sự biết rõ bạn đang làm gì, vì một thiết lập sai sẽ làm cho máy bạn khởi động không được. Chọn "Cơ bản" nếu bạn chỉ muốn thay đổi diện mạo của quá trình đăng nhập
zh_cn: 该面板显示 GDM 的基础系统选项。 您只应该在您真的知道您在做什么的前提下修改这些路径，这是由于错误的设置将阻止您正确地启动您的机器。 如果您只希望修改您机器的登录外观，选择“基本”。

source: The glade ui description file doesn't seem to contain the widget "%s". Unfortunately I cannot continue. Please check your installation.
vi: Tập tin glade không chứa ô điều khiển "%s". Không thể tiếp tục chương trình. Vui lòng kiểm tra lại bản cài đặt.
zh_cn: glade 界面描述文件好像不含有构件 “%s”。不幸的是我无法继续。 请检查您的安装。

source: You must be the superuser (root) to configure GDM.
vi: Bạn phải là siêu người dùng (root) thì mới có thể cấu hình GDM.
zh_cn: 只有超级用户 (根用户) 才能配置 GDM。

source: Cannot find the glade interface description file, cannot run gdmconfig. Please check your installation and the location of the gdmconfig.glade2 file.
vi: Không thể tìm thấy tập tin glade nên không thể chạy gdmconfig. Vui lòng kiểm tra lại bản cài đặt và vị trí tập tin gdmconfig.glade2
zh_cn: 无法找到 glade 界面描述 文件，无法运行 gdmconfig。 请检查您的安装和 gdmconfig.glade2 文件的位置。

source: Cannot find the gdmconfigurator widget in the glade interface description file Please check your installation.
vi: Không thể tìm thấy ô điều khiển gdmconfigurator trong tập tin glade. Vul lòng kiểm tra lại bản cài đặt.
zh_cn: 无法在 glade 界面配置文件 中找到 gdmconfigurator 构件。 请检查您的安装。

source: GNOME Display Manager Configurator
vi: Trình cấu hình GDM
zh_cn: GNOME 显示管理器配置程序

source: The configuration file: %s does not exist! Using default values.
vi: Tập tin cấu hình không tồn tại: %s Dùng giá trị mặc định.
zh_cn: 配置文件：%s 不存在！使用默认值。

source: Standard server
vi: Server chuẩn
zh_cn: 标准服务器

source: Error reading session script!
vi: Lỗi khi đọc script session!
zh_cn: 读取会话脚本错误！

source: Error reading this session script
vi: Lỗi khi đọc script session này
zh_cn: 读取该会话脚本错误

source: Yes
vi: Đúng
zh_cn: 是

source: No
vi: Sai
zh_cn: 否

source: gdm_config_parse_most: Invalid server line in config file. Ignoring!
vi: gdm_config_parse_most: Dòng server trong tập tin cấu hình không hợp lệ. Bỏ qua!
zh_cn: gdm_config_parse_most：配置文件中含有非法服务器行。忽略！

source: The applied settings cannot take effect until gdm is restarted or your computer is rebooted. You can restart GDM when all sessions are closed (when all users log out) or you can restart GDM now (which will kill all current sessions)
vi: Các thiết lập được áp dụng chưa thể có tác dụng tới khi nào GDM khởi động lại hoặc khởi động lại máy tính. Bạn có thể khởi động lại GDM khi mọi session đều kết thúc (khi mọi người dùng đều thoát) hoặc bạn có thể khởi động GDM ngay bây giờ (và sẽ chấm dứt hoạt động của mọi session)
zh_cn: 在 gdm 重新启动或重新启动计算机 以前，已应用的设置无法生效。当 所有会话都被关闭时 (所有用户均 注消) 您可以重新启动 GDM，或者 您立即重新启动 GDM (这将杀死所有 当前会话)

source: Restart after logout
vi: Khởi động lại sau khi đăng xuất
zh_cn: 注消后重新开始

source: Restart now
vi: Khởi động lại ngay
zh_cn: 立即重新开始

source: Are you sure you wish to restart GDM now and lose any unsaved data?
vi: Bạn có muốn khởi động lại GDM ngay bây giờ và sẽ đánh mất tất cả dữ liệu chưa được lưu?
zh_cn: 您确信您现在要重新启动 GDM 并丢失所有未保存的数据？

source: The greeter settings will take effect the next time it is displayed. The rest of the settings will not take effect until gdm is restarted or the computer is rebooted
vi: Các thiết lập chào hỏi sẽ có tác dụng ngay lần xuất hiện sau. Phần còn lại của các thiết lập sẽ chưa có tác dụng tới khi nào GDM được khởi động lại hoặc khởi động lại máy tính.
zh_cn: 欢迎程序设置将在下次显示 时生效。其余设置将在 gdm 重新启动或计算机重新启动 后生效。

source: You have not defined any local servers. Usually this is not a good idea unless you are sure you do not want users to be able to log in with the graphical interface on the local console and only use the XDMCP service. Are you sure you wish to apply these settings?
vi: Bạn chưa định nghĩa bất kỳ server nội bộ nào. Thường thì điều này không hay trừ khi bạn chắc là bạn không muốn những người dùng có thể đăng nhập vào giao diện đồ họa trên console nội bộ và chỉ dùng dịch vụ XDMCP. Bạn có muốn áp dụng những thiết lập này?
zh_cn: 您尚未定义任何本地服务器。 除非您确信您不希望用户从 本地控制台通过图形界面登录 而只使用 XDMCP 服务，否则 这就不是个好主意。 您确信您要应用这些设置吗？

source: Could not delete session %s Error: %s
vi: Không thể xóa session %s Lỗi: %s
zh_cn: 无法删除会话 %s 错误：%s

source: Could not remove session %s Error: %s
vi: Không thể loại bỏ session %s Lỗi: %s
zh_cn: 无法删除会话 %s 错误：%s

source: Could not write session %s Error: %s
vi: Không thể ghi session %s Lỗi: %s
zh_cn: 无法写入会话 %s 错误：%s

source: Could not write contents to session %s Error: %s
vi: Không thể ghi nội dung của session %s Lỗi: %s
zh_cn: 无法将内容写入会话 %s 错误：%s

source: Could not unlink old default session Error: %s
vi: Không thể xóa session mặc định cũ Lỗi: %s
zh_cn: 无法断开原默认会话 错误：%s

source: Could not find a suitable name for the default session link
vi: Không thể tìm thấy tên thích hợp cho liên kết session mặc định
zh_cn: 无法为默认会话连接找到适当的名称

source: Could not link new default session Error: %s
vi: Không thể liên kết với session mặc định mới Lỗi: %s
zh_cn: 无法连接新默认会话 错误：%s

source: There were errors writing changes to the session files. The configuration may not be completely saved.
vi: Xảy ra lỗi khi ghi các thay đổi của session lên tập tin. Tập tin cấu hình có thể không được lưu hoàn chỉnh.
zh_cn: 在将改变写入会话文件时出现错误。 可能没有完整地保存配置。

source: This will destroy any changes made in this session. Are you sure you want to do this?
vi: Việc này sẽ hủy toàn bộ thay đổi trong session. Bạn có muốn thực hiện việc này?
zh_cn: 这将丢失该会话所做的一切修改。 您确信您要这样做？

source: This will destroy any changes made in the configuration. Are you sure you want to do this?
vi: Bạn sẽ hủy toàn bộ các thay đổi trong cấu hình. Bạn có muốn thực hiện việc này?
zh_cn: 这将丢失该配置所作的一切修改。 您确信您要这样做？

source: A command line must start with a forward slash ('/')
vi: Dòng lệnh phải bắt đầu với ký tự '/'
zh_cn: 命令行必须以除号开始 (“/”)

source: A descriptive server name must be supplied
vi: Phần tên mô tả server phải được cung cấp
zh_cn: 必须给出描述性的服务器名

source: A session name must be unique and not empty
vi: Tên session phải là duy nhất và khác rỗng
zh_cn: 会话名必须唯一并且不能为空

source: Enter a name for the new session
vi: Nhập tên của session mới
zh_cn: 为新会话输入名称

source: You have modified the sessions directory. Your session changes will still get written to the old directory however, until you reload the configuration dialog again.
vi: Bạn đã thay đổi thư mục session. Tuy nhiên các thay đổi trong session của bạn sẽ vẫn được ghi vào trong thư mục cũ tới khi bạn nạp lại hộp thoại cấu hình.
zh_cn: 您已经修改了会话目录。 在您重新装入配置对话框以前， 您对会话所作的修改仍然会 写入到原来的目录中。

source: A graphical application for configuring the GNOME Display Manager (GDM)
vi: Một ứng dụng đồ họa dùng để cấu hình GDM (Trình quản lý Display của GNOME)
zh_cn: 配置 GNOME 显示控制器 (GDM) 的图形应用程序

source: GDM Configurator
vi: Trình cấu hình GDM
zh_cn: GDM 配置程序

source: GDM Configuration Utility
vi: Tiện ích cấu hình GDM
zh_cn: GDM 配置工具

source: _Configuration
vi: _Cấu hình
zh_cn: 配置(_C)

source: Revert to settings in the configuration file
vi: Hoàn nguyên trở lại các thiết lập ban đầu trong tập tin cấu hình
zh_cn: 返回到配置文件中的设置

source: Revert settings
vi: Hoàn nguyên các thiết lập
zh_cn: 返回设置

source: Revert to settings that were shipped with your system
vi: Hoàn nguyên các thiết lập như khi ban đầu trên hệ thống
zh_cn: 返回到随您系统提供的设置

source: Revert to Factory Settings
vi: Hoàn nguyên trở lại thiết lập của nhà sản xuất
zh_cn: 返回到出厂设置

source: Apply the current changes
vi: Áp dụng các thay đổi
zh_cn: 应用当前改变

source: Apply
vi: Áp dụng
zh_cn: 应用

source: Options
vi: Tùy chọn
zh_cn: 选项

source: basic_settings
zh_cn: 基本设置(_S)

source: General Appearance
vi: Diện mạo chung
zh_cn: 通用外观

source: Logo:
vi: Biểu tượng:
zh_cn: 徽标：

source: Select a logo to be displayed during login
vi: Chọn biểu tượng được hiển thị trong suốt quá trình đăng nhập
zh_cn: 选择一个登录时显示的徽标

source: Minimised Icon:
vi: Biểu tượng thu nhỏ:
zh_cn: 最小化图标：

source: Select a GTK+ theme file (gtkrc)
vi: Chọn tập tin theme của GTK+ (gtkrc)
zh_cn: 选择一个 GTK+ 场景文件 (gtkrc)

source: This is the GTK+ RC file that describes the theme that the login window should use
vi: Đây là tập tin GTK+ RC mô tả theme cửa sổ đăng nhập nên dùng
zh_cn: 这是描述登录窗口应使用的场景的 GTK+ RC 文件

source: Gtk+ RC file:
vi: Tập tin Gtk+ RC:
zh_cn: Gtk+ RC 文件：

source: Login appearance
vi: Diện mạo đăng nhập
zh_cn: 登录外观

source: Greeter Look and Feel
vi: Diện mạo trình chào hỏi
zh_cn: 欢迎程序外观

source: Show the "System" menu. This has the shutdown, reboot and configuration items
vi: Hiện menu "Hệ thống". Menu này chứa lệnh Tắt máy, Khởi động máy và Cấu hình
zh_cn: 显示“系统”菜单。它含有关机、重新启动和配置项目

source: Show the 'system' menu, (for reboot, shutdown etc.)
vi: Hiện menu 'Hệ thống' (để tắt máy, khởi động lại...)
zh_cn: 显示“系统”菜单，(提供重启、关机等功能。)

source: Allow users to run the configurator from the system menu
vi: System
zh_cn: 允许用户从系统菜单运行配置器

source: If the user fails to authenticate himself the login window should Quiver to indicate failure
vi: Nếu người dùng thất bại khi xác nhận, cửa sổ đăng nhập nên rung nhẹ để thể hiện sự thất bại
zh_cn: 如果用户认证自身失败，登录窗口应抖动以表明失败

source: Quiver on failure
vi: Rung nhẹ khi thất bại
zh_cn: 失败时抖动

source: Show the title bar on the login window. If this is off the user won't be able to move nor iconify the login window
vi: Hiện thanh tựa đề trên cửa sổ đăng nhập. Nếu tắt tùy chọn này, người dùng sẽ không thể di chuyển hoặc thu nhỏ cửa sổ đăng nhập.
zh_cn: 为登录窗口显示标题条。如果关闭该选项用户即不能移动，也不能图标化登录窗口

source: Show title bar on login window
vi: Hiện thanh tựa đề trên cửa sổ đăng nhập
zh_cn: 为登录窗口显示标题条

source: Welcome to %n
vi: Chào mừng tới %n
zh_cn: 欢迎来到 %n

source: This is %n
vi: Đây là %n
zh_cn: 这是 %n

source: The welcome message displayed on the login window
vi: Thông điệp chào mừng được hiển thị trên cửa sổ đăng nhập
zh_cn: 在登录窗口中显示欢迎消息

source: Default font:
vi: Font mặc định:
zh_cn: 默认字体：

source: Welcome message:
vi: Thông điệp chào mừng:
zh_cn: 欢迎消息：

source: The font to use on the welcome message
vi: Font dùng trong thông điệp chào mừng
zh_cn: 用于显示欢迎消息的字体

source: Pick a Font
vi: Chọn Font
zh_cn: 选取一个字体

source: Extras
vi: Mở rộng
zh_cn: 其它

source: Default locale:
vi: Locale mặc định:
zh_cn: 默认区域设置：

source: This is the locale that GDM uses when it cannot find what the system locale is set to. This should be in the standard format such as "en_US" for American English or "cs_CZ" for Czech
vi: Đây là locale mà GDM dùng khi không có locale hệ thống nào được thiết lập. Locale nên ở dạng chuẩn như "en_US" (Tiếng Mỹ) hoặc "cs_CZ" (tiếng CH Séc)
zh_cn: 这是在 GDM 无法确认系统的区域设置时使用的区域设置。这应该是标准格式，譬如美国英语应使用“en_US”，捷克语应使用“cz_CZ”

source: Always use the 24 hour format for the clock in the greeter, even if the norm for the current locale is 12 hour
vi: Luôn dùng dạng thức thời gian 24h cho đồng hồ của trình chào hỏi, ngay cả nếu locale hiện thời quy định là dạng 12h
zh_cn: 总是在欢迎程序中使用 24 小时时钟格式，而不管当前区域设置是否为 12 小时格式

source: Always use 24 hour clock format
vi: Luôn dùng dạng 24h
zh_cn: 总是使用 24 小时时钟格式

source: Position
vi: Vị trí
zh_cn: 位置

source: Set the initial position of the login window to the values below
vi: Thiết lập vị trí ban đầu của cửa sổ đăng nhập bằng giá trị ở dưới
zh_cn: 将登录窗口的初始位置设置为以下值

source: Manually set position
vi: Gán vị trí thủ công
zh_cn: 手工设置位置

source: Do note allow the user to drag the login window around
vi: Không cho phép người dùng kéo cửa sổ đăng nhập đi chỗ khác
zh_cn: 不允许用户拖动登录窗口

source: Lock position
vi: Cố định vị trí
zh_cn: 锁定位置

source: X position:
vi: Toạ độ X:
zh_cn: X 位置：

source: Y position:
vi: Tọa độ Y:
zh_cn: Y 位置：

source: Xinerama screen:
vi: Màn hình Xinerama:
zh_cn: Xinerama 屏幕：

source: If you have xinerama multi display setup which screen should the login window appear on. 0 will usually do just fine.
vi: Nếu bạn thiết lập mult-display (Xinerama), tùy chọn cho biết cửa sổ đăng nhập nên xuất hiện trên mành hình nào. Khuyến khích giá trị 0.
zh_cn: 如果您拥有 xinerama 多头显示支持，就请设置那个屏幕应该显示登录窗口。0 号屏幕应该可以很好地工作。

source: Login behaviour
vi: Hành vi đăng nhập
zh_cn: 登录行为

source: Face browser
vi: Duyệt bộ mặt
zh_cn: 头像浏览器

source: Show a browser of user face images. The users can put their picture in ~/.gnome/photo
vi: Hiện trình duyệt, duyệt các ảnh dùng làm bộ mặt. Người dùng có thể thêm ảnh của người dùng vào trong thư mục ~/.
zh_cn: 显示一个用户头像浏览器。用户可疑将他们的照片存放到 ~/.gnome/photo 中

source: Show choosable user images (enable face browser)
vi: Hiện ảnh người dùng có thể chọn (bật "Duyệt bộ mặt")
zh_cn: 显示可选择的用户头像 (启用头像浏览器)

source: Default face image:
vi: Ảnh bộ mặt mặc định:
zh_cn: 默认头像图像：

source: Global faces directory:
vi: Thư mục mặt chung:
zh_cn: 全局头像目录：

source: Maximum face width:
vi: Chiều rộng mặt tối đa:
zh_cn: 最大头像宽度：

source: Select an image for users with no 'face'
vi: Chọn một ảnh cho người dùng "không có mặt"
zh_cn: 为没用“头像”的用户选择一幅图像

source: Choose the directory to search for faces
vi: Chọn thư mục tìm mặt
zh_cn: 选择搜索头像的目录

source: Maximum face height:
vi: Chiều cao mặt tối đa:
zh_cn: 最大头像宽度：

source: Exclude these users:
vi: Loại trừ người dùng:
zh_cn: 排除这些用户：

source: A comma separated list of users to exclude from the face browser.
vi: Danh sách cách nhau bởi dấu phẩy tên những người dùng bị loại trừ khỏi trình uyệt bộ mặt.
zh_cn: 以逗号分隔的，头像浏览器不会显示的用户列表。

source: Background
vi: Nền
zh_cn: 背景

source: Background type:
vi: Kiểu nền:
zh_cn: 背景类型：

source: The background should be the standard background
vi: Dùng nền chuẩn
zh_cn: 背景应为标准背景

source: None
vi: Không
zh_cn: 无

source: The background should be an image
vi: Nền là ảnh
zh_cn: 背景应该为图像

source: Image
vi: Ảnh
zh_cn: 图像

source: The background should be a color
vi: Nền là màu sắc
zh_cn: 背景应为一种颜色

source: Color
vi: Màu sắc
zh_cn: 颜色

source: Scale background image to fit the entire screen. If this is not set then the image will be tiled on the background.
vi: Phóng to/thu nhỏ ảnh nền cho vừa màn hình. Nếu không chọn tùy chọn này, ảnh sẽ được lát đều trên nền
zh_cn: 缩放背景图像以充满整个屏幕。如果不选择此选项，图像将平铺在背景中。

source: Scale background image to fit
vi: Phóng to/thu nhỏ cho vừa
zh_cn: 缩放背景图像到充满背景

source: Background color:
vi: Màu nền:
zh_cn: 背景颜色：

source: The color to use on the background
vi: Màu dùng làm nền
zh_cn: 用于背景的颜色

source: Pick a color
vi: Chọn màu
zh_cn: 选取一种颜色

source: Background image:
vi: Ảnh nền:
zh_cn: 背景图像：

source: On remote login screens only set color to reduce network traffic
vi: Đối với đăng nhập từ xa, chỉ thiết lập màu nền để giảm tải cho mạng
zh_cn: 远程登录屏幕仅设置颜色以减少网络流量

source: Only color on remote displays
vi: Chỉ dùng màu trên các mành hình ở xa
zh_cn: 远程显示仅设置颜色

source: Background program
vi: Chương trình nền
zh_cn: 背景程序

source: Background program:
vi: Chương trình nền:
zh_cn: 背景程序：

source: Select a file containing Locale information
vi: Chọn một tập tin chứa thông tin Locale
zh_cn: 选择一个含有区域设置信息的文件

source: The program to run in the background of the login.
vi: Chương trình cần chạy đằng sau quá trình đăng nhập.
zh_cn: 运行在登录后台的程序

source: Automatic login
vi: Tự động đăng nhập
zh_cn: 自动登录

source: Automatic login:
vi: Tự động đăng nhập:
zh_cn: 自动登录：

source: Login a user automatically on first bootup
vi: Tự động đăng nhập cho người dùng khi khởi động
zh_cn: 首次启动时自动登录一个用户

source: Timed login
zh_cn: 延迟登录

source: Timed login:
zh_cn: 延迟登录：

source: Seconds before login:
vi: Số giây trưới khi đăng nhập:
zh_cn: 登录前延迟秒数：

source: Login a user automatically after a specified number of seconds
vi: Đăng nhập tự động sau một khoảng thời gian
zh_cn: 在等待指定秒数之后自动登录一名用户

source: expert
vi: chuyên gia
zh_cn: 专家

source: Allow logging in as root (administrator) user.
vi: Cho phép root (administrator) đăng nhập.
zh_cn: 允许作为根用户 (管理员) 登录。

source: Allow root to login with GDM
vi: Cho phép root đăng nhập
zh_cn: 允许根用户通过 GDM 登录

source: Allow logging in as root (administrator) user from a remote host using GDM. This is only relevant if you enable the XDMCP protocol.
vi: Cho phép root (administrator) đăng nhập từ máy chủ ở xa. Chỉ có giá trị nếu bạn bật dịch vụ XDMCP .
zh_cn: 允许使用 GDM 从远程主机登录根 (管理员) 用户。只有在您开启了 XDMCP 协议时该选项才有意义。

source: Allow root to login remotely with GDM
vi: Cho phép root đăng nhập từ xa
zh_cn: 允许通过 GDM 远程登录根用户

source: Allow logging in using the timed from a remote host using GDM. This is only relevant if you enable the XDMCP protocol. Note that this is insecure since remote hosts can gain access to this computer without the use of a password, so be careful.
vi: Cho phép đăng nhập tự động sau một khoảng thời gian chờ đối với các máy chủ ở xa. Chỉ có giá trị nếu bật dịch vụ XDMCP. Chú ý rằng đây là một tính năng không an toàn vì máy chủ ở xa có thể truy cập vào máy tính này mà không cần mật khẩu. Vì vậy hãy cẩn thận.
zh_cn: 允许使用 GDM 从远程主机进行延迟登录。只有在您开启了 XDMCP 协议时该选项才有意义。请注意由于远程主机可以不使用口令而获得对该电脑的访问权，因而是不安全的，所以请小心。

source: Allow remote timed logins
vi: Cho phép tự động đăng nhập từ xa sau một khoảng thời gian
zh_cn: 允许远程延迟登录

source: Determines whether GDM should kill X clients started by the init scripts when the user logs in.
vi: GDM có nên kết thúc các X client trước khi thực hiện các script init khi người dùng đăng nhập hay không.
zh_cn: 确定 GDM 是否应该在用户登录时杀死由 init 脚本启动的 X 客户端。

source: Kill 'init' clients
vi: Kết thúc các client 'init'
zh_cn: 杀死“init”客户端

source: Should GDM print authentication errors in the greeter
vi: GDM nên in lỗi xác nhận trong trình chào hỏi không
zh_cn: GDM 是否要在欢迎程序中打印认证错误

source: Select how relaxed permissions are
vi: Chọn quyền truy cập khi rảnh
zh_cn: 选择许可权限的宽松程度

source: Permissions:
vi: Quyền truy cập:
zh_cn: 权限：

source: Allow world writable files and directories
vi: Cho phép mọi người có quyền ghi tập tin và thư mục
zh_cn: 允许所有人写入文件和目录

source: World writable
vi: Ghi thoải mái
zh_cn: 所有人可写

source: Allow group writable files and directories
vi: Cho phép nhóm có quyền ghi tập tin và thư mục
zh_cn: 允许同组的人写入文件和目录

source: Group writable
vi: Quyền ghi nhóm
zh_cn: 同组用户可写

source: Only accept user owned files and directories
vi: Chỉ chấp nhận người dùng sở hữu tập tin và thu mục
zh_cn: 只允许文件和目录的所有者写入

source: Paranoia
vi: Hoang tưởng
zh_cn: 偏执狂

source: Authorization Details
vi: Chi tiết quá trình xác nhận
zh_cn: 认证细节

source: GDM runs as this user:
vi: GDM chạy như người dùng:
zh_cn: GDM 以该用户的身份运行：

source: User 'auth' directory:
vi: Thư mục 'auth' của người dùng:
zh_cn: 用户“认证”目录：

source: User 'auth' FB directory:
zh_cn: 用户“认证”FB 目录：

source: User 'auth' file:
vi: Tập tin 'auth' của người dùng:
zh_cn: 用户“认证”文件：

source: GDM runs as this group:
vi: GDM chạy như nhóm:
zh_cn: GDM 以该组的身份运行：

source: Limits
vi: Giới hạn
zh_cn: 限制

source: The number of seconds before a login is allowed after an unsuccesful try.
vi: Số giây trước khi được phép đăng nhập sau lần đăng nhập không thành
zh_cn: 在一次失败的登录后进行下次尝试前需延迟的秒数。

source: The maximum size of a file that gdm will attempt to read. This is for files that are read into memory and so you don't want users "attacking" gdm by having large files.
vi: Kích thước tập tin tối đa mà GDM cố đọc. Tùy chọn này dành do những tập tin được đọc vào bộ nhớ và vì thế bạn không muốn người dùng "tấn công" GDM bằng cách nạp tập tin cực lớn.
zh_cn: gdm 试图读取的文件的最大尺寸。这是关于需要读入内存的文件的，所以您就不会遭到巨型文件对 gdm 的“攻击”了。

source: Retry delay:
vi: Khoảng đợi trước khi thử lại:
zh_cn: 重试延迟：

source: Maximum user file length:
vi: Kích thước tập tin tối đa:
zh_cn: 最大用户文件长度：

source: Maximum session file length:
vi: Kích thước tập tin session tối đa:
zh_cn: 最大会话文件长度：

source: The session file is read in a way where a higher limit is still ok. That is it is never stored in memory.
vi: Tập tin session được đọc vào bộ nhớ có một giới hạn cao hơn. Nhờ thế nó không bao giờ được lưu trong bộ nhớ.
zh_cn: 该会话文件是以保证不超过最高限额的方式读入的。它绝不会被存储在内存中。

source: Security
vi: Bảo mật
zh_cn: 安全

source: No XDMCP support in the binary. To enable XDMCP support you must recompile GDM with the XDMCP libraries.
vi: Không hỗ trợ XDMCP nhị phân. Để bật XDMCP bạn phải biên dịch lại GDM với thư viện XDMCP.
zh_cn: 可执行文件不支持 XDMCP。为启用 XDMCP 支持您必须在带有 XDMCP 库的情况下重新编译 GDM。

source: Enable XDMCP, a protocol to allow others to log in remotely
vi: Bật XDMCP, một giao thức cho phép người dùng đăng nhập từ xa
zh_cn: 启用 XDMCP，一种允许其它人远程登录的协议

source: Enable XDMCP
vi: Bật XDMCP
zh_cn: 启用 XDMCP

source: Connection Settings
vi: Thông số kết nối
zh_cn: 连接设置

source: Honour indirect requests
zh_cn: 允许非直接请求

source: Maximum indirect wait time:
vi: Thời gian chờ gián tiếp tối đa:
zh_cn: 最大间接等待时间：

source: Maximum wait time:
vi: Thời gian chờ tối đa:
zh_cn: 最大等待时间：

source: Maximum remote sessions:
vi: Số session từ xa tối đa:
zh_cn: 最大远程会话数：

source: Max pending indirect requests:
vi: Số yêu cầu gián tiếp bị hoãn tối đa:
zh_cn: 最大阻塞间接请求数：

source: Maximum pending requests:
vi: Số yêu cầu bị hoãn tối đa:
zh_cn: 最大阻塞请求数：

source: Listen on UDP port:
vi: Sử dụng cổng UDP:
zh_cn: 监听 UDP 端口：

source: Ping interval (minutes):
vi: Ping mỗi (phút):
zh_cn: Ping 间隔 (分钟)：

source: Interval in minutes in which to ping the server. If the server doesn't respond in this many minutes (that is before the next time we ping it) the display will be terminated.
vi: Khoảng thời gian (theo phút) thực hiện lệnh ping server. Nếu server không trả lời, display sẽ tự kết thúc.
zh_cn: 两次 ping 服务器间隔的分钟数。如果服务器在这段时间内没有应答 (就是我们下次 ping 服务器之前)，显示就将被终止。

source: The script to run when the server sends a WILLING response to a QUERY. If this is empty or does not exist, the standard message with the system ID is sent. Only the first line of output from this script is read.
vi: Script dùng để chạy khi server gửi tín hiệu WILLING để trả lời QUERY. Nếu không có script này, thông điệp chuẩn đi kèm với mã ID hệ thống sẽ được gửi. Chỉ dòng đầu tiên của đầu ra từ script này được dùng.
zh_cn: 当服务器对一个查询发送 WILLING 响应时运行的脚本。如果这为空或者不存在，将发送带有系统 ID 的标准消息。只读入该脚本所输出的第一行。

source: Willing script (optional):
zh_cn: Willing 脚本 (可选)：
