{
  "id": 714215,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC83MTQyMTU=",
  "url": "https://hackerone.com/reports/714215",
  "title": "curl on Windows can be forced to execute code via OpenSSL environment variables",
  "state": "Closed",
  "substate": "informative",
  "severity_rating": "high",
  "readable_substate": "Informative",
  "created_at": "2019-10-14T23:02:51.094Z",
  "submitted_at": "2019-10-14T23:02:51.094Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "supersausage",
    "url": "/supersausage",
    "profile_picture_urls": {
      "small": "/assets/avatars/default-25f7248a18bdf9e2dc8310319b148d66cff430fa0fade6c5f25fee1b8d7f27ed.png"
    },
    "is_me?": false,
    "cleared": false,
    "verified": false,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 35663,
    "url": "https://hackerone.com/curl",
    "handle": "curl",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/035/663/2faf4c279d437d64bfda6d23d62ce1833813a4d9_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/035/663/2faf4c279d437d64bfda6d23d62ce1833813a4d9_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "curl",
      "twitter_handle": "",
      "website": "https://curl.se",
      "about": "cURL is an Open Source project providing a library and command-line tool for doing internet transfers"
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [
    "CVE-2019-1552",
    "CVE-2019-5443"
  ],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2021-02-08T07:54:17.110Z",
  "bug_reporter_agreed_on_going_public_at": null,
  "team_member_agreed_on_going_public_at": "2021-01-08T08:21:12.992Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "Preface: While I have an interest in security, I am not a professional security researcher, so please be forgiving of any lack of convention in this submission. The intent is to help improve security of the OpenSSL and curl projects, their consumers and end users. I will be sending this same content to both projects, curl via hackerone, and OpenSSL via openssl-security@openssl.org, per directions at each maintainer website.\n\nI'm writing with regard to:\n - OpenSSL CVE-2019-1552\n - curl CVE-2019-5443\n \nBackground:\n - The root of each of these is that a default path in the OpenSSL build system for Windows targets is a location writable by a non-privileged user, and that OpenSSL configuration files placed there can change the behavior of OpenSSL, including code execution and escalation of privilege.\n - A PoC for code execution and escalation of privilege was published at:\n   https://hackerone.com/reports/608577\n - This PoC uses a dynamic engine definition in such an OpenSSL configuration file to load a DLL in the security context of the application integrating the OpenSSL library, whose DLL_PROCESS_ATTACH handler inside DllMain can execute code in that context. This permits a non-elevated user to deploy code that may be executed by an elevated application.\n \nContext of this email:\n - I am currently working with OpenSSL 1.0.2t as a LTS solution.\n - I have not tested or substantially researched other branches at this time.\n \nSummary of current status:\n - OpenSSL project appears to have:\n   - Designated CVE-2019-1552 as \"Low\" severity, even though the issue allows for EoP and potentially degrading the communication security intent of integrating applications, e.g. via inserting CA certificates.\n   - At a high level, stated as \"Fixed in OpenSSL 1.0.2t\" (https://www.openssl.org/news/vulnerabilities.html) by this commit:\n     https://github.com/openssl/openssl/commit/d333ebaf9c77332754a9d5e111e2f53e1de54fdd\n\t The fix is, however, a fix to documentation, and changes in the build script that add a sample  for --prefix that is similarly insecure.\n - curl project appears to have:\n   - Recommended that users update to 7.65.1_2\n   - Stated that this commit \"completely disables curl's ability to load an OpenSSL config when invoked.\"\n     https://github.com/curl/curl-for-win/commit/51b658a76594942cf1d6f227d8fc4732bb8ec277\n\t \n\nMy contentions:\n\n (A) The statement that CVE-2019-1552 was \"Fixed in OpenSSL 1.0.2t\" is extremely misleading, and could likely lead to users of the project updating OpenSSL without realizing that additional changes are required on their part. \n\n (B) The sample \"--prefix=c:/some/openssl/dir\" is equally as vulnerable as the default, but more significantly, it is difficult to conceive of a path that is actually safe to use, and this might not be obvious to all developers. For example:\n \n  - C:\\Windows\\System32 - Windows may not always be installed on drive letter 'C', leaving a hard-coded path similarly vulnerable on some systems\n  - C:\\Program Files - This path can be localized (e.g. \"Programmes\" in French-native installations), leaving a hard-coded path similarly vulnerable on some systems\n    \n  The OpenSSL code does not support passing an environment variable for runtime resolution, which would be a still vulnerable option, not least because Configure.pl will modify any path that is not an absolute path with drive letter, or one beginning with \"/\":\n\n    $openssldir=$prefix . \"/\" . $openssldir if $openssldir !~ /(^\\/|^[a-zA-Z]:[\\\\\\/])/;\n    \n  One of few \"safer\" options I could think of was passing --prefix=\\NUL --openssldir=\\NUL, which should lead to a path or compound path after Configure.pl that is guaranteed to be invalid or else contain no content under Windows.\n    \n  In fact, in the aforementioned hackerone thread, \"vsz\" alludes to the fact that the fix in curl is not guaranteed:\n    \n  \"After further experiments, I managed to tweak the build so that engine support can be kept enabled, and OpenSSL be built with a secure prefix. The trick was to use C:/Windows/System32/OpenSSL. This location can be fairly assumed to be a restricted directory on majority of installs and on all default installs going back a long time.\"\n    \n  Per above, this in not true unless Windows is installed on the 'C' drive. These are supposed to be projects implementing security, potentially integrated into end products distributed to millions of users with varying OS configurations. I personally would not call this \"fixed\". \"Hardened\", perhaps.\n  \n  (C) This still does not make the OpenSSL library safe, and I believe curl CVE-2019-5443 is actually *not fixed*, because the OpenSSL will read the path to configuration data from the OPENSSL_CONF environment variable.\n  \n  I downloaded curl 7.66.0 from:\n\n    https://curl.haxx.se/windows/dl-7.66.0_2/curl-7.66.0_2-win32-mingw.zip\n    \n  I could compile and execute the same PoC as provided in the hackerone thread simply by setting the user-level environment variable:\n\n    OPENSSL_CONF=C:\\test\\openssl.cnf\n    \n  The OpenSSL library used by curl (and other third-party apps who integrate it), will read this environment variable before the hard-coded path. Windows does not elevation to set user-level environment variables, and child processes can inherit them. This means that any elevated application using the OpenSSL library started from a compromised user account can be used as a EoP technique in the same way as before. For example, if OPENSSL_CONF is set at the user level, and the user signs out and later signs in again, the shell (Explorer.exe) inherits this environment variable, as does any process the user elevates.\n    \n  I have not tested, but if, as the text on the OpenSSL vulnerabilities page alludes to, this also allows someone to \"insert CA certificates, modify (or even replace) existing engine modules\", this same issue potentially weakens the communications secrecy of integrating apps.\n    \n  Aside: I see various places in the OpenSSL library code where other environment variables are queried, and I do not have time to evaluate each for potential issues.\n\n## Impact\n\nThe attacker could run code in the context of an elevated process if they can modify user-level environment variables, or when Windows is not installed on the C drive.\n\nEssentially, this report is that issues similar to CVE-2019-5443 persist in curl 7.66.0.",
  "weakness": {
    "id": 75,
    "name": "Privilege Escalation"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": null,
  "vote_count": 2,
  "voters": [
    "monke",
    "xdanes09"
  ],
  "severity": {
    "rating": "high",
    "score": 7.9,
    "author_type": "User",
    "metrics": {
      "attack_vector": "local",
      "attack_complexity": "low",
      "privileges_required": "low",
      "user_interaction": "required",
      "scope": "changed",
      "confidentiality": "high",
      "integrity": "high",
      "availability": "none"
    }
  },
  "structured_scope": {
    "databaseId": 18844,
    "asset_type": "SOURCE_CODE",
    "asset_identifier": "https://github.com/curl/curl",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
