{
  "id": 762510,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC83NjI1MTA=",
  "url": "https://hackerone.com/reports/762510",
  "title": "How the Bug stole hacking",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "none",
  "readable_substate": "Resolved",
  "created_at": "2019-12-20T19:05:22.123Z",
  "submitted_at": "2019-12-20T19:05:22.123Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "archangel",
    "url": "/archangel",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/mi30nrehc6ke2ckv60y093wljrt2/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98"
    },
    "is_me?": false,
    "cleared": true,
    "verified": true,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 13,
    "url": "https://hackerone.com/security",
    "handle": "security",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/000/013/fa942b9b1cbf4faf37482bf68458e1195aab9c02_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": true,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "HackerOne",
      "twitter_handle": "Hacker0x01",
      "website": "https://hackerone.com",
      "about": "Vulnerability disclosure should be safe, transparent, and rewarding."
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": false,
  "disclosed_at": "2019-12-20T19:36:07.561Z",
  "bug_reporter_agreed_on_going_public_at": "2019-12-20T19:36:07.495Z",
  "team_member_agreed_on_going_public_at": "2019-12-20T19:35:00.968Z",
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "In light of the season - here's a story I wrote for you:\n\n\n```\nEvery hacker down in Hackerone liked hacking alot,\nBut the Bug who lived down in the source code, did not!\n\nThe Bug hating hacking! The whole Bug-hunt season!\nNow please don’t ask why. No one quite knows the reason.\n\nIt could be perhaps, that his impact was too low.\nIt could be just that he was too hard to repro.\n\nBut I think that the most likely reason of all\nMay have been that his CVSS was too small.\n\nBut whatever the reason, his skiddies or account hijackers,\nHe stood there on hunting-eve hating the hackers,\n\nStaring down from his app with a sour Buggy frown,\nAt the warm-lighted monitors that glow in their town,\n\nFor he knew that every hacker down in Hackerone crew,\nWas busy now finding more Bugs anew!\n\n“And their low-hanging IDORs” he snarled with a frown.\n“They’ll find me soon, too! I’m sure to be found!”\n\nThen he growled, with his Bug fingers nervously drumming,\n“I must find some way to keep the hackers from coming!\n\nFor tomorrow, I know all my hacker foes and fiends\nWill wake bright and early. They’ll rush to their screens!\n\nAnd then! Oh the bounties! Oh the bounties! Bounties! Bounties!\nThere’s one thing I hate! All the BOUNTIES! BOUNTIES BOUNTIES!\n\nThen the hackers, young and old, will sit down for a hunt,\nAnd they’ll hunt! And they’ll hunt!  And they’ll HUNT! HUNT! HUNT! HUNT!\n\nThey’ll hunt on Paypal, and good ol Gitlab,\nFor Gitlab’ an app that pays out quite fab!\n\nAnd then they’ll do something I hate most of all!\nEvery hacker down in Hackerone, the tall and the small,\n\nThey’ll stand at the ready, with their bitcoin addresses.\nThey’ll stand close-together finding developer’s messes!”\n\n“And they’ll hack! And they’ll hack! And they’ll HACK! HACK! HACK! HACK!”\nAnd the more the Bug thought of this hacker bug-bash,\nThe more the Bug thought, I must stop cause this to crash!\n\nWhy for fifty-three cycles I’ve put up with it now!\nI must stop the hunters from hacking! But how?”\n\nThen he got an idea! An awful idea!\nThe Bug got a wonderful, awful idea!\n\n“I know just what to do!” The Bug laughed in his throat.\n“I’ll make a quick hacker hat and hoodie coat.”\n\nAnd he chuckled and clucked, “What a great buggy joke!\nWith his hoodie and black jeans, I’ll look just like Saint Stok!”\n\n“All I need is a 0-day.” The Bug looked around.\nBut since 0-days are spendy, there was none to be found.\n\nDid that stop the Bug? Hah! The Bug simply said,\n“If I can’t find an 0-day, I’ll make one instead!”\n\nSo he took his own keys, and his IP-address,\nAnd published it on Github, a public repo no less!\n\nThen he loaded some bags and some sacks made of wool,\nOn an old Stok skateboard, and a bunch of Redbull,\n\nThen the Bug said, “Giddyap!” and the board started going,\nTowards the Live-event hotel where the hackers lay a-snooze in their town.\n\nAll their monitors were dark. No one knew he was there.\nAll the hackers were all dreaming of bounties paid fair\nWhen he came to the first little laptop of the square.\n\n“This is stop number one,” the old Buggy Stok hissed,\nAs he climbed to the keyboard, empty bags in his fist.\n\nThen he rooted the laptop, a fit a bit too snug,\nBut if Stok could root it, then so could the Bug.\n\nHe got stumped only once, for a minute or two.\nThen he saw all the installed apps, some of which he knew\n\nWhere Tomnomnom’s tools were all installed in a row.\n“This Burpsuite,” he sneered, “Is the first thing to go!”\n\nAnd he slithered and slunk with a smile mostly cruel,\nAround the whole laptop, and he torched every tool!\n\nMetasploit, sublister, shodan, and zap!\nTrufflehog, censys, and every other app!\n\nAnd he stuffed them in directories. And without making a racket,\nMoved them all over into his own s3 bucket.\n\nThen he pivoted to next machine as quick as a flash.\nWhy that bug even cracked the sha-256 hash!\n\nThen he stuffed all the notes to his bucket with glee.\n“Now,” grinned the bug, “I will steal the bounties!”\n\nAs the Bug stole the bounties, and he started to shove,\nHe heard a small sound like the coo of a dove.\n\nHe turned around fast, and saw a bug hoarder!\nLittle Nahamsec, a Youtube recorder.\n\nHe stared at the bug and said, “Freddy Stok, why,\nWhy are you taking our tools and bounties? Why?”\n\nBut, you know, that old Bug was so smart and so slick,\nHe thought up a lie, and he thought it up quick!\n\n“Why, my sweet little Ben,” the fake Freddy Stok lied,\nThere’s a tool on this laptop that crashes every time.\n\nSo I’m checking it out, making a PR, my dear.\nI’ll hotfix it there, then I’ll bring it back here.”\n\nAnd his fib fooled the streamer. Then he patted his head,\nAnd he got him a beer, and sent him to bed.\n\nAnd when Ol Ben Sadegipour back with his brisk,\nHe went back to the laptop and wiped the whole disk!\n\nThen he moved on to the next laptop even quicker,\nAnd the last thing he took was the H1-702 sticker.\nThe Bug couldn’t have been faster, he couldn’t have been slicker.\n\nAnd the one bit of data he left on the machine,\nWas a picture of Ol’ Ben, for he was feeling quite mean.\n\nThen he did the same thing to the other hacker’s lappy’s,\nFrom Tommy’s, to Santi’s, to Inti’s, to Naffy’s!\n\nIt was quarter of dawn, all the hackers still asleep,\nAll the hackers still a-snooze, when he started to creep,\n\nLoaded up with their tools, their notes, and their findings,\nTheir bitcoins, their bounties, so bright it was blinding.\n\n10 thousand feet away, to his corner of the net,\nHe got ready to sell it, to make quite a profit.\n\n“Pooh-pooh to the Hackers!” he was Buggishly humming.\n“They’re finding out now that no hacking is coming!\n\nThey’re just waking up! I know just what they’ll do!\nTheir mouths will hang open a minute or two\nThen the hackers down in Hackerone will all cry boo-hoo!\n\nThat’s a noise,” grinned the Bug, “that I simply must hear!”\nHe paused, and the Bug put a hand to his ear.\n\nAnd he did a hear a sound rising over the web.\nIt started to grow, and didn’t start to ebb.\n\nBut this sound wasn’t sad!\nWhy, this sound sounded glad!\n\nEvery hacker down in Hackerone, the tall and the small,\nWas hacking without any tools or bounties at all!\n\nAnd the Bug, with his buggy brain started to think\nHe stood puzzling and puzzling. “Why aren’t in a kink?”\n\nIt came without bounties! It came without tools!\nIt came without laptops! How am I such a fool?!\n\nHe puzzled and puzzled till his puzzler was sore.\nThen the Bug thought of something he hadn’t before.\n\nMaybe hacking, he thought, comes an immunity.\nMaybe hacking, he thought, is all about community!\n\nAnd what happened then? Well, at Hackerone they say,\nThat the bug’s CVSS grew 3 severities that day!\n\nAnd the true meaning of hacking came through,\nAnd the Bug found the strength of ten hackers, plus two!\n\nAnd now his heart didn’t feel quite so tight,\nHe whizzed with his loot through the bright morning light\n\nWith a smile to his soul, he went back to the hackers,\nCherily bringing lots of snacks for the snackers\n\nHe road into Hackerone. He brought back their loot.\nHe brought back their bounties and their tools to boot.\n\nHe brought back their Burpsuite and their plugins and cash,\nBrought back their browsers and Metasploit in a flash,\n\nHe brought everything back! All the rep points that he found!\nAnd he, he himself, the Bug, got his first bounty.\n\n```\n\n## Impact\n\nHappy Holidays and thanks for all you do. <3",
  "weakness": {
    "id": 55,
    "name": "Insecure Direct Object Reference (IDOR)"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": "2020-01-19T19:35:01.074Z",
  "allow_singular_disclosure_after": -128368734.89658509,
  "singular_disclosure_allowed": true,
  "vote_count": 452,
  "voters": [
    "al-madjus",
    "mjyintl",
    "smirnoffq",
    "k0z3r0",
    "napoleon17",
    "0xcyborg",
    "jukra",
    "th3_protocol",
    "pmnh",
    "irek",
    "and 442 more..."
  ],
  "severity": {
    "rating": "none",
    "author_type": "User"
  },
  "structured_scope": {
    "databaseId": 3,
    "asset_type": "URL",
    "asset_identifier": "hackerone.com",
    "max_severity": "critical"
  },
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
