[
  {
    "source": "## https://sploitus.com/exploit?id=6DE430D6-180D-5B38-ABBB-E243D17C4E24\nJenkins is an open source automation server. It helps automate the parts of software development related to building, testing, and deploying, facilitating continuous integration, and continuous delivery.\n\n**CVE-2024-23897(Arbitrary File Read Vulnerability)**\nJenkins 2.441 and earlier, LTS 2.426.2 and earlier does not disable a feature of its CLI command parser that replaces an '@' character followed by a file path in an argument with the file's contents, allowing unauthenticated attackers to read arbitrary files on the Jenkins controller file system.\n\n**Affected versions:** Jenkins 2.441 and earlier, LTS 2.426.2 and earlier\n\nThis exploit scans whether the provided target is vulnerable to CVE-2024-23897 and reads the file supplied, from the remote vulnerable server.\n\n**Usage:** python3 CVE-2024-23897_threads.py -u http://localhost:8888/ -f /var/jenkins_home/secrets/master.key\n\nFor this exploit to work, atleast one of the following conditions have to be met:\n1. Legacy mode authorization is enabled.\n2. Configuration “Allow anonymous read access” is checked in the “logged-in users can do anything” authorization mode.\n3. The signup feature is enabled.\n\n**Note:** If the exploit takes too long to complete/reads only the first few bytes of the file, terminate the exploit and run it again. Also this exploit only works if the vulnerable Jenkins instace is configured with default settings\n\nYou can also manually do the exploit with jenkins-cli.jar.To know more, refer the below\nhttps://github.com/vulhub/vulhub/tree/master/jenkins/CVE-2024-23897\n\n**References:**\nhttps://www.sonarsource.com/blog/excessive-expansion-uncovering-critical-security-vulnerabilities-in-jenkins/\nhttps://github.com/vulhub/vulhub/tree/master/jenkins/CVE-2024-23897\nhttps://www.splunk.com/en_us/blog/security/security-insights-jenkins-cve-2024-23897-rce.html\n\n**Disclaimer: This exploit is to be used only for educational and authorized testing purposes. Illegal/unauthorized use of this exploit is prohibited.**",
    "id": "6DE430D6-180D-5B38-ABBB-E243D17C4E24",
    "href": "https://github.com/Praison001/CVE-2024-23897-Jenkins-Arbitrary-Read-File-Vulnerability",
    "title": "Exploit for Vulnerability in Jenkins"
  }
]
