{
  "id": 463695,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC80NjM2OTU=",
  "url": "https://hackerone.com/reports/463695",
  "title": "Certificate warnings and similar UI elements in Web protection of Anti-Virus products family are susceptible to clickjacking",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "medium",
  "readable_substate": "Resolved",
  "created_at": "2018-12-17T10:02:35.319Z",
  "submitted_at": "2018-12-17T10:02:35.319Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "palant",
    "url": "/palant",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/125/397/69a28ca9d5030b1db03411852407732328b571c3_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98"
    },
    "is_me?": false,
    "cleared": false,
    "verified": false,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 2379,
    "url": "https://hackerone.com/kaspersky",
    "handle": "kaspersky",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/002/379/d7dc3ce53a84816885872fb423816bfbbbd36390_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/002/379/d7dc3ce53a84816885872fb423816bfbbbd36390_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "disabled",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": false,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "Kaspersky",
      "twitter_handle": "kaspersky",
      "website": "http://www.kaspersky.com",
      "about": "Kaspersky is the world’s largest privately-held vendor of endpoint protection and cybersecurity solutions for business and consumers."
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2019-08-28T17:54:56.804Z",
  "bug_reporter_agreed_on_going_public_at": "2019-07-29T17:54:50.586Z",
  "team_member_agreed_on_going_public_at": null,
  "comments_closed?": false,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "**Summary**\nClickjacking can be used to trick users into overriding certificate warnings, disabling Safe Money functionality or phishing alerts.\n\n**Description**\nOn certificate warning pages, a single click is sufficient to trigger overriding a wrong certificate. While an additional warning is displayed outside of the browser, the message is very generic and won't really tell users what they are agreeing to. This allows attackers who can MiTM user's connections (e.g. on a public WiFi) to attack SSL-protected connections. The issue reported under https://hackerone.com/reports/461780 makes matters worse here because certificates can be overridden even for high-profile websites like Google.\n\n**Environment**\n- Scope: Application\n- Product name: Kaspersky Internet Security\n- Product version: example: 19.0.0.1088\n- OS name and version (incl SP): Windows 10.0.17134, tested browsers are Firefox 64, Internet Explorer 11, Microsoft Edge\n- Attack type: Clickjacking\n- Maximum user privileges needed to reproduce your issue: no privileges\n\n**Steps to reproduce**\n1. Edit the file %WINDIR%\\sysnative\\drivers\\etc\\hosts as administrator and add the following line: `93.184.216.34 www.google.com` (that's the IP address of example.com to simulate a MitM attack).\n2. Go to https://www.google.com/ in your browser - note how Kaspersky will display a certificate error page.\n3. Now download the attached certerror_clickjacking.html and open it in your browser (can be opened directly from the file system).\n4. The page masquerades as a warning from Kaspersky about your network not being protected, which is probably true if the attackers managed to show you this page. Click the \"I understand the risks and wish to continue\" link. Note: this has been tested with the English version of Kaspersky, there is a slight chance that this link won't be positioned correctly with other languages.\n5. An additional warning by Kaspersky opens saying: \"You are about to go to an insecure web resource. Are you sure you want to continue?\" That warning is in line with what you already saw, so you click \"Continue.\"\n6. Now go to https://www.google.com/ again. Note how the site loads now (shows \"Not Found\"), the certificate error is gone.\n\nThe link you clicked on in step 4 didn't belong to the certerror_clickjacking.html page but rather to the certificate error page for www.google.com. So when you clicked it you actually confirmed to override the wrong certificate of www.google.com.\n\nOther warning pages displayed by Kaspersky are similarly affected by clickjacking. So the attackers could trick you into clicking the link which disables Safe Money protection for your bank for example. Or the link that permanently overrides the phishing warning for almost-my-bank.com. Both these actions would have worked without an additional confirmation, so no social engineering required - the user merely needs to click somewhere on the attacker's page.\n\n**Recommendations**\nBrowsers' certificate error pages are resilient to clickjacking. Both Firefox and Chrome will require **two** clicks on **different** parts of the page to override a certificate: first \"Advanced\" button, then the actual override. This approach is also advisable for other reasons: technical details only confuse the general population, the important information being that they should leave the page which is not secure. Only people who are technical enough to look at the advanced section should see the override possibility.\n\nAlso, the additional confirmation message displayed by Kaspersky should be made less generic. At the very least, it should mention the website that the user is overriding the certificate for.\n\nFinally, there is no valid reason for the Safe Money prompt to appear within a frame, so this could be prevented using X-Frame-Options HTTP header.\n\n## Impact\n\nOn a public network, attackers might redirect user's unencrypted (plain HTTP) traffic to their server and display a message to them that they would plausibly want to override. If the user clicks the override link then, they will have unwittingly overridden the wrong certificate warning for some SSL-protected website and will have given attackers the possibility to hijack this connection.",
  "weakness": {
    "id": 74,
    "name": "UI Redressing (Clickjacking)"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": "2019-08-28T17:54:50.641Z",
  "allow_singular_disclosure_after": -140815236.20844382,
  "singular_disclosure_allowed": true,
  "vote_count": 11,
  "voters": [
    "foobar7",
    "mik317",
    "zayn1337",
    "0-1",
    "what_web",
    "cryptographer",
    "sp1der",
    "saharuzzaman",
    "demo_cd67",
    "henry742689",
    "and 1 more..."
  ],
  "severity": {
    "rating": "medium",
    "author_type": "Team"
  },
  "structured_scope": null,
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
